{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Needs new energy", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r436482671-m11068-Medieval_Madness-Alexandria_Virginia.html#review436482671", "text": "The first sentence was \"I came with an expired Groupon\", and that kind of summed up the show. Way too long of a monologue by the \"hero\" of the show who played more of a mother in law hater than a duke. Food came 90 minutes into the show so eat a late lunch. Ladies and gent were good but could've used a better story line. An ok evening. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-11T17:30:28-0500", "location_id": "2294300", "id": "436482671", "user": {"username": "GypsyTraveller94", "user_location": {"name": "Washington DC, District of Columbia", "id": "28970"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-08", "title": "Disappointed", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r409019847-m11068-Medieval_Madness-Alexandria_Virginia.html#review409019847", "text": "The show was ok and kind of funny, but we expected better. The food was decent but was definitely not enough food for the number of people at the table. We were hungry when we left (I was really not happy about this). They are very stingy with the food portions and refused to bring us a little more bread. Some at our table didn't get bread because there wasn't enough. It took a very long time for food to be served and we wound up being there for 3 hours. Make sure you have that amount of time. Unfortunately for the owners, things were made worse by the air conditioner not working so it was very warm inside. I have mostly positive reviews on Trip Advisor, so it pains me to write this one. I'm sorry but we were sadly disappointed and would not recommend this show to family or friends.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-08-22T17:51:02-0400", "location_id": "2294300", "id": "409019847", "user": {"username": "Keatman14", "user_location": {"name": "Mechanicsville, Maryland", "id": "41262"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Don't waste your hard earned money!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r383834403-m11068-Medieval_Madness-Alexandria_Virginia.html#review383834403", "text": "It started off badly because our party was the only one that was not seated across from each other but in a straight line facing a wall it not allow for any conversation. The music playing did not help set the mood at all ( last I knew \"The Pink Panther\" theme song and Frank Sinatra \" Fly Me to the Moon\" we're not typical medieval songs. \n\nIt was a long time before we were even approached about how everything worked, yet other tables seemed to get a lot of information from their servers. \n\nFood was awful, sounded pretty good from their menu discription but the bread was stale like it sat out all day, the chicken seemed like it was boiled, and slathered with really bad honey mustard. Plus it's a little hard to eat rice and blueberries with your fingers.  \n\nThey said it was PG-13 however the songs the wenches sang was more R rated, I didn't appreciate the Isis jokes, I don't know how that or the religious jokes fit the midieval theme.  The man who I think the person who wrote it was also the Duke who very often mouthed the lines if the other actors.  Some actors appeared to be dresses in midieval attire but when you really looked on wench had on sneakers with some silver design and there were a couple of other poor wardrobe choices.  \n\nAlso one wench came by our table and said how are you can the member of our party was \"choking\" (something went down the wrong way ) and they coughed a I'm choking out and the girl just kept on walking.\n\nSo in review. atmosphere: very poor\nFood: awful\nEntertainment?: well the question mark says it all.\nService: there wasn't much. \n\nI have been to at least 3 other Midieval dinners that have been wonderful but this one really misses the mark and that was a lot of money down the drain. If you're looking for great midieval shows check out King Henry's Feast, Midieval Times!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-18T19:39:53-0400", "location_id": "2294300", "id": "383834403", "user": {"username": "somernaut", "user_location": {"name": "Erie, Pennsylvania", "id": "52607"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-03", "title": "Medievil Feast?", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r360921262-m11068-Medieval_Madness-Alexandria_Virginia.html#review360921262", "text": "Wife and I went on a groupon and was very disappointed.   I won't comment to much on the show, except to say if you like Monty Python style skits and comedy you would probably find the show entertaining. \n\nHowever, I can comment on the food, medievil feast? More like mediocre meal!  I understood thier concept of authentic medievil meal, but food still has to taste good and they say feast but the portions didn't add up.  You eat with your hands so things like rice, peas, and small slices of roast beef just don't work.\n\nThe food was also not prepared well.  The peas tasted like Steam fresh microwaved peas, the carrots were watered down and flavorless, and the roast beef was so overcooked it was almost uneatable.  The three pieces of chicken with honey mustard sauce on a skewer was the best of the night.\n\nWe left hungry that night and appreciated the fact that we had stopped for an appetizer prior to the show.\n\nThe concept is good,  The staff is authentically dressed and friendly, the location is small but very well decorated and clean, but the food just brought the experience down.\n\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-02T08:10:28-0400", "location_id": "2294300", "id": "360921262", "user": {"username": "Rob M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-07", "title": "A Good Concept but Lame Implementation", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r290410492-m11068-Medieval_Madness-Alexandria_Virginia.html#review290410492", "text": "I really like what Medieval Madness is trying to do.  They are trying to expose the public to medieval customs and cuisine in a way that's entertaining.  They use only food and beverages that were available before 1453.  Unfortunately, the execution is so clumsy, especially the entertainment part, that I can't recommend it.\n\nThe events take place in the Great Hall of John Strongbow's Tavern, which is operated by the same organization.  It is on King Street in Old Town Alexandria, easily accessible from the Metro station via the free Old Town Trolley (bus).  The room itself is well-decorated, but very noisy, with lots of echo that makes conversation difficult, including hearing what the servers (\"wenches\") have to tell you about the event.  People sit at long tables are served communally. \n\nThe meal is fun.  The only implement you have to work with is a spoon.  Thus, you pick up the meat (sausages, roast beef, chicken skewers) with your hands.  A large towel is provided to help you keep your fingers clean.  In addition to the meat, there are rice, peas, and carrots, along with Linzer tart for dessert.  Everyone is entitled to a glass of wine, a flagon of mead, or two tankards of ale.  More modern beverages (including soft drinks) are available at the bar.\n\nThe entertainment is a series of comedy skits with a plot loosely linking them together.  Some of them are downright tedious.  The jokes are lame, and the delivery has little sparkle.  It seems as if the actors are just going through the motions.  Near the end of the evening, there is a brief presentation of medieval combat, which was probably the most interesting part of the entertainment.\n\nThe evening I attended, they said it was the first night of the new script.  Moreover, the script was a departure for them, an attempt to write in the style of Monty Python.  Perhaps that contributed to the problems described above.  While I am local to the area and may give them another try some time, had I known what it would be like, I would not have booked the tickets.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-07-19T08:28:06-0400", "location_id": "2294300", "id": "290410492", "user": {"username": "Davanden", "user_location": {"name": "Alexandria, Virginia, USA", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-04", "title": "What a waste", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r266881277-m11068-Medieval_Madness-Alexandria_Virginia.html#review266881277", "text": "Bought tickets for my family online due to the incredible number of 4 & 5 star reviews.  What a waste.  My party's name wasn't even on the list, but I brought my printed confirmation so they did seat us. The beginning monologue dealt with current politics (what that had to do with medieval times?) I have no idea.  The play was mediocre at best.  The \"sword fight\" lasted all of 2 minutes and seemed more like an advertisement for the local jujitsu establishment than any medieval anything. The mead wine was actually the best thing they offered but being served by anyone was nearly impossible. Well I could say compleletely impossible since me or my party was never served by anyone.   Didn't get the family and friends vibe from ANYONE working but did manage to squeeze my way out of the table arrangement and walk to the bar for self serve.  In addition to the 60 per person charge they passed around a wooden bowl both for the sword fight and wench tip.  Absolutely ridiculous! Completely unimpressed and would NEVER recommend nor attend another event by this establishment.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-04-20T12:02:39-0400", "location_id": "2294300", "id": "266881277", "user": {"username": "mamgavin", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2014-11", "title": "Good show, good beer", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r242072599-m11068-Medieval_Madness-Alexandria_Virginia.html#review242072599", "text": "Found a Groupon offer and decided to give it a go-the husband and I enjoyed the night!  The show was very good, and I love that everything offered is researched to be as historically accurate as possible.  The beer offerings were excellent.  The sword fighting was excellent, and it was very impressive to hear they have a martial arts center where people train in the ancient arts.  I don't think I would have paid the $59 per person original cost, but for the $39 Groupon deal, it was worth every penny.  We took a look at their regular restaurant menu and want to go back to try lunch or dinner.  I would recommend this for a different kind of night out!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-11-30T02:54:10-0500", "location_id": "2294300", "id": "242072599", "user": {"username": "Carol M", "user_location": {"name": "Stafford, Virginia", "id": "58204"}}}, {"lang": "en", "rating": 2, "travel_date": "2014-10", "title": "Good Beer, pity about the rest", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r239355414-m11068-Medieval_Madness-Alexandria_Virginia.html#review239355414", "text": "Title says it all; did like the open mike night.  Reformed chicken, or that's what it tasted like. Really good beer tho'", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2014-11-11T11:07:20-0500", "location_id": "2294300", "id": "239355414", "user": {"username": "Nic C", "user_location": {"name": "Huntingdon, United Kingdom", "id": "209939"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-10", "title": "A breath of fresh air!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r236963542-m11068-Medieval_Madness-Alexandria_Virginia.html#review236963542", "text": "While I can understand a four star rating for this establishment, I believe it warrants 5 stars for a few key reasons:\n\n1.  It was started by 3 disabled, distinguished Veterans, and is still owned and operated by disabled, distinguished Veterans.  That being said, they epitomize what this country is all about.  Entrepreneurship at it's finest!  This is not Medieval Times, but it is so much more personable, making you really feel like you are part of what's going on.  To be short, it was like you were hanging out with a bunch of friends.\n\n2.  While it was pricey (unless you got it on Groupon or Living Social), it was understandably so after seeing what you got for it.  You will not go home hungry unless you choose to.  You will get enough to drink but can buy more.  You will be served extremely well by people who really love what they are doing.  You will laugh and have more fun than you've had in a while.  You will get a non-polished, sometimes impromptu, comedy show that is surprisingly dated yet current at the same time.  All this and, even with tips for the waitresses (or wenches as you'll come to endearingly refer to them) and sword fighters, you're still getting a deal.  \n\n3.  Comfort and uniqueness.  This place just felt good.  It felt like you were not in the 21st century, it was as thought out and put together as anything I'd ever seen.  There is a reason it has been successful, and that is because they take a whole lot of pride in what they do, and they absolutely love doing it.  \n\nBottom line, if you don't get a coupon, the night for 2 people will cost you in the neighborhood of $160 without buying more drinks.  That being said - you'll leave feeling like you got your money's worth, just so long as you don't have expectations that this is something that it is not...it is exactly as it advertises pretty much.  Don't expect to 'be fed like a king' by today's standards - because what kings then were fed was more like what a much lower class gets fed today (not talking quantity or even quality here...just 'style')...but make no mistake, you'll get VERY unique dishes, many of which you've never had before, and you'll likely love all of it!  (and both sauces are great and pretty much - surprisingly - can be put on just about anything and taste good...quite odd!  Don't look for modern, or anything that is 'by today's standards'...the point is to take you back in time a bit...so keep your expectations as such.  It's a dinner theater comedy show...enjoy it for what it is!\n\nGREAT job to everyone at Medieval Madness!  We will be back sometime for sure, and will continue to tell our friends to try it out!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-10-29T10:57:23-0400", "location_id": "2294300", "id": "236963542", "user": {"username": "tvptraveler", "user_location": {"name": "Manassas, Virginia", "id": "60895"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-05", "title": "I Liked It", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r231730604-m11068-Medieval_Madness-Alexandria_Virginia.html#review231730604", "text": "Our adult daughter came to visit and specifically asked to see this dinner/show.  This was before they moved to their new location.  We thought the food was great, the show was fun, and had a great evening!  I especially liked that the servers told us the recipes for the variety of food we were served (family style) were from Medieval times.  The family style way they served things was also great ice breaker for getting to know the folks next to you as you sit next to strangers at long tables.  It wasn't a problem for me, but just so everyone knows. =)", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-09-29T19:00:35-0400", "location_id": "2294300", "id": "231730604", "user": {"username": "kendallc-h", "user_location": {"name": "Alexandria, Virginia", "id": "30226"}}}, {"lang": "en", "rating": 3, "travel_date": "2014-09", "title": "Fun but not enough food", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r227364325-m11068-Medieval_Madness-Alexandria_Virginia.html#review227364325", "text": "We had a fun time at Medieval Madness.  The show was pretty good but might put some parents on edge if attending with children.  Included with the admission price were the meal and two tankards of ale.  Seemed like a pretty good value when we booked through Living Social.  The place was full with at least fifty people in attendance.  The two courses were served to groups of six people.  The first course consisted of a meat pie, sausages, and peas.  The second course consisted of chicken skewers, rice with blueberries, and cinnamon-covered carrots.  Also provided were a pear sauce and mustard.\n\nThe meal was intended to fit into a 15th Century England theme.  I especially enjoyed the meat pie and sausages; the rye ale served was excellent.  However, despite us guests being \"lords and ladies,\" it seemed like we were not really fed as such; the portions and amounts served with each course were rather small.  Then, the amount of dessert served, a Linzer Torte, was rather disappointing and awkward, as the six of us had to divvy up eight pieces from two small tortes amongst ourselves.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-09-06T14:06:17-0400", "location_id": "2294300", "id": "227364325", "user": {"username": "John S", "user_location": {"name": "Arlington, Virginia", "id": "30242"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-08", "title": "Great food and lots of fun for the entire family", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r222165119-m11068-Medieval_Madness-Alexandria_Virginia.html#review222165119", "text": "This was our fist visit to Medieval Madness, which has moved to a new location on Alexandria's King Street in historic Old Towne.  Although the audience was mostly adults, there were a few children sprinkled in the audience.  The performance were PG rated, so they were perfect for the entire family.  \"Serving Wenches\" brought our food at 7PM (Fridays and Saturdays only, I believe) and diners were also served two containers of ale or mead.  The Duke and Duchess arrived and the fun began.  The entertainment was a combination of skits and stand up comedy, which everyone seemed to find quite amusing.  The serving wenches sang a slightly bawdy song which was only PG rated and two knights in armor fought over a $140 pot that had been donated by the diners, which meant that they fought hard!  We had a great time as did everyone else we chatted with.  The 2:45 event ended around 9:45, in plenty of time to grab another glass of ale at the tavern downstairs.  We're sure to return  in the Spring.  Highly recommended!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-08-16T05:52:31-0400", "location_id": "2294300", "id": "222165119", "user": {"username": "kr51", "user_location": {"name": "Fairfax, Va.", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2014-05", "title": "Non-existent Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r207656884-m11068-Medieval_Madness-Alexandria_Virginia.html#review207656884", "text": "We tried but it was to no avail and it seemed no one cared. Food & Entertainment mediocre at best. Parking is a nightmare and all for this???", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-05-28T11:15:16-0400", "location_id": "2294300", "id": "207656884", "user": {"username": "wiggyb2013", "user_location": {"name": "Alexandria, Virginia", "id": "30226"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-07", "title": "Live entertainment at its finest!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r205985760-m11068-Medieval_Madness-Alexandria_Virginia.html#review205985760", "text": "This place is a gem - an absolutely superb take on dinner theater, done in a medieval manner.  The food is delicious, the wine and beer second to none, and the entertainment will have you rolling in laughter.  A must hit if you're in the DC area!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-05-17T21:09:33-0400", "location_id": "2294300", "id": "205985760", "user": {"username": "TheAnvil", "user_location": {"name": "San Diego, California", "id": "60750"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-10", "title": "Pure fun in a unique setting", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r201318346-m11068-Medieval_Madness-Alexandria_Virginia.html#review201318346", "text": "An evening of food, comedy and jousting from the middle ages. They cook food from recipes from the middle ages and it is really good. Add to that a intelligent stand-up comedy routine based on current events which changes every couple of months. The night will be capped off with Knights in armor battling for your votes. \n\nGo visit and enjoy something different in Alexandria.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-04-15T16:29:51-0400", "location_id": "2294300", "id": "201318346", "user": {"username": "MikeD56", "user_location": {"name": "Alexandria, Virginia", "id": "30226"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-03", "title": "Good time!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r200490908-m11068-Medieval_Madness-Alexandria_Virginia.html#review200490908", "text": "Loved the decor.  We had a fun time!  You must make reservations well in advance because they book up fast.  Comedy might not be appropiate for young children.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-04-09T10:02:40-0400", "location_id": "2294300", "id": "200490908", "user": {"username": "tinylilron", "user_location": {"name": "Connecticut", "id": "28928"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Wonderful show!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r199918642-m11068-Medieval_Madness-Alexandria_Virginia.html#review199918642", "text": "Absolutely love this place. We've been back with many different friends and family members and everyone always has a great time. Great food, great drinks and a guaranteed great time!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-04-04T14:41:59-0400", "location_id": "2294300", "id": "199918642", "user": {"username": "Tezzy_n", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2013-11", "title": "Great show!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r193312717-m11068-Medieval_Madness-Alexandria_Virginia.html#review193312717", "text": "We've been to this show several times over the years and absolutely love it! Great show, atmosphere and food  I'd highly recommend it for a night out of doing something different. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2014-02-06T21:43:25-0500", "location_id": "2294300", "id": "193312717", "user": {"username": "Tezzy_n", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2013-12", "title": "Wonderful experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r187795582-m11068-Medieval_Madness-Alexandria_Virginia.html#review187795582", "text": "My friend and I went to the 4:00 showing this past SAT; wonderfully entertaining and the food was not bad either.  The cast did a wonderful job coupled with an interesting script infused with political satire; the fencing toward the end was also good and authentic.  The entire evening was well worth it even without a groupon - we paid full freight but worth it!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-12-16T06:21:00-0500", "location_id": "2294300", "id": "187795582", "user": {"username": "Cari D", "user_location": {"name": "Potomac Falls, VA", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2013-11", "title": "Great Time", "url": "https://www.tripadvisor.com/ShowUserReviews-g30226-d2294300-r183530481-m11068-Medieval_Madness-Alexandria_Virginia.html#review183530481", "text": "I was afraid the show would be a little lame but fortunately i was wrong.  I'm really glad i gave this place a shot, i was skeptical but figured i'd finally go for it.  the food was good- not fantastic, but kept with the times and was enjoyable. the ale was delicious!!! i wonder if it's open as a bar after the shows? it'd be nice to go back for some drinks.  the show was a lot of fun and i'd definitely go again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-11-04T07:46:18-0500", "location_id": "2294300", "id": "183530481", "user": {"username": "S89f", "user_location": {"name": "Washington DC, District of Columbia", "id": "28970"}}}]}