{"paging": {"total_results": "6", "skipped": "0", "previous": null, "results": "6", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "the FRIES!!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g29556-d8091033-r429230315-m11068-Elevation_Burger_Ann_Arbor_Liberty-Ann_Arbor_Michigan.html#review429230315", "text": "Wow, these fries are to DIE FOR!\nI have no idea why, they don't really have anything special about them. They are simply potato, coarse sale and grease, but that is the combination that knocks it out of the park! basic, simple and delish!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mike T, Owner at Elevation Burger Ann Arbor - Liberty, responded to this review", "text": "Thank you!  We cut them fresh, cook them in 100% olive oil and add a dash of salt.  So glad you like them!", "title": "Owner Response", "published_date": "2016-10-19T08:21:55-0400", "id": "429722960"}, "trip_type": "Solo travel", "published_date": "2016-10-18T06:00:47-0400", "location_id": "8091033", "id": "429230315", "user": {"username": "veggieyoga", "user_location": {"name": "Ann Arbor, Michigan", "id": "29556"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Meh.", "url": "https://www.tripadvisor.com/ShowUserReviews-g29556-d8091033-r383272892-m11068-Elevation_Burger_Ann_Arbor_Liberty-Ann_Arbor_Michigan.html#review383272892", "text": "The burgers taste no better than a fast food burger, but are way more expensive.  The fries are average also.  Charging $18 for two people, you'd think they would be able to fix the cracked concrete floors.  The staff was helpful and friendly, but overall it was mediocre.  If you want a quality burger in Ann Arbor, try somewhere else.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mike T, Owner at Elevation Burger Ann Arbor - Liberty, responded to this review", "text": "Hi Cara,\n\nThank you for giving us a shot and taking the time to post your honest feedback.  I am sorry you did not have a great experience.\n\nThe floor is the original terrazzo from this historic building.  It would have been cheaper just to cover over it rather than restoring it as we did, but I felt it was the right thing to do.  I think it gives the place some charm, but do also understand the fact that it's  not perfect can cause annoyance.  Sorry for that!\n\nYes, the ingredients we use are more expensive than you would find in a fast food burger restaurant.  To be honest, even though our aim is quick service, I would not call us fast food.  We are cooking the food fresh, using real ingredients.\n\nOur Elevation Burger (nearly half pound of beef) is $6.00.  Most of the toppings you add are free, but a few toppings do cost extra.  A regular size fry is $3.50, and is a large portion that is often enough to share.  My hope is the 100% organic, 100% grass-fed beef, hand-cut potatoes cooked in 100% olive oil, etc. justify our slightly higher prices with superior taste, nutrition and environmental impact, but I know that will not necessarily be true for everyone.\n\nThank you again for giving us a shot.  I can't ask for more than that.\n\nMike", "title": "Owner Response", "published_date": "2016-06-18T06:17:30-0400", "id": "383663494"}, "trip_type": null, "published_date": "2016-06-16T14:58:39-0400", "location_id": "8091033", "id": "383272892", "user": {"username": "Cara B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "Their cheeseburger is crack on a bun (addicting). It's served with above-average customer service.", "url": "https://www.tripadvisor.com/ShowUserReviews-g29556-d8091033-r316198227-m11068-Elevation_Burger_Ann_Arbor_Liberty-Ann_Arbor_Michigan.html#review316198227", "text": "My husband and I ate here between 6:30 and 7 p.m. Sunday night. The restaurant was moderately busy. There was no line at the order register. The man who took our order was helpful, professional and friendly. Our order was prepared and brought to our table quickly. We forgot to order fries. My husband subsequently ordered those. He overpaid by one dime. The order-taking server brought the dime to our table. The fries were brought to our table. At that time, the server asked if we were enjoying our burgers. \n\nAfter we ate our meal, we stayed at our table to talk. A different server offered to clear our trays and trash. He too asked if we enjoyed our meals. \n\nThe food was delicious. We very much enjoyed our burgers and fries. \n\nI'm a Pepsi person. This restaurant serves Coke products and tea (unsweetened and \"slightly sweetened\"). Coke is the reason I didn't give this restaurant five stars. \n\nEither this is the rare restaurant that bothers to train employees in customer service skills or it hires friendly, motivated employees and sets a high bar for their behavior toward customers. Each staff member we encountered seemed to care whether we were happy with our dining experience. I was impressed by the staff.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mike T, Owner at Elevation Burger Ann Arbor - Liberty, responded to this review", "text": "Awesome review!  Thank you!  I love my staff.\r\n\r\nWe do have Boylan's soda in bottles in the reach-in cooler.  Might be a good option if you're not a fan of a Coke?\r\n\r\nThanks!\r\n\r\nMike", "title": "Owner Response", "published_date": "2015-10-06T06:56:21-0400", "id": "316569143"}, "trip_type": "Couples", "published_date": "2015-10-04T21:22:01-0400", "location_id": "8091033", "id": "316198227", "user": {"username": "livininmousa", "user_location": {"name": "Saint Charles, Missouri", "id": "44876"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-08", "title": "What is all the fuss about?", "url": "https://www.tripadvisor.com/ShowUserReviews-g29556-d8091033-r306098333-m11068-Elevation_Burger_Ann_Arbor_Liberty-Ann_Arbor_Michigan.html#review306098333", "text": "Friends have been raving about Elevation Burger, so I decided to drive all the way across town and give it a try.  The ingredients used by this restaurant are supposed to be healthier with 100% organic, grass-fed, free-range beef burgers and fresh fries cooked in olive oil.  That is all well and good, but don't expect the flavor of your burger and fries to be any better than most burger restaurants like Wendy's and Red Robin.  I was expecting a burger that was a good as the ones my mother used to prepare at home, but Elevation Burgers are mediocre.  As for cooking the fires in olive oil, I question the wisdom of that.  Different oils have different smoke points.  When the oil reaches the point that it smokes, it begins to break down into ingredients that include carcinogens.  Olive oil has a low smoke point compared to other oils.  If the oil has to be heated to this temperature in order to be hot enough to properly cook the fries, then the choice of using olive oil is questionable.  Anyway, is Elevation Burger worth a trip across town in order to dine there?  No, definitely not.  Would I eat there if I'm in the neighborhood?  Yeah, why not?", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "Mike T, Owner at Elevation Burger Ann Arbor - Liberty, responded to this review", "text": "Hello,\r\n\r\nI do appreciate you going out of your way to try us out, and thank you for taking the time to provide the review and feedback.\r\n\r\n\"This is what burgers used to taste like back in the day\" is actually one of the most frequent compliments we get - especially from those who are a little older or happened to have grown up on a ranch.  Taste memory recognition is very strong and those who used to eat beef before the industry starting grain-feeding cattle and pumping them full of antibiotics and hormones, instantly recognize the flavor or our beef.  I would be curious to know what toppings you chose.  For a beef connoisseur trying us for the first time, it's often best to go light on the toppings to really let the flavor of the beef shine through.  Too many toppings and dressings can mask the flavor, making it less distinguishable from some of those other restaurants you mentioned.\r\n\r\nExtra virgin olive oil does indeed have a lower smoke point, due to the burning of the compounds within it that give it it's distinct flavor, not the burning of the oil itself.  Deep frying in EVOO would definitely be a mistake.  We use a more refined olive oil (Bertolli Classico).  Many of the flavor compounds have been removed giving our oil a smoke point of 460F which is well above our fryer temps.  If it were burning, you would see smoke coming from the fryers, and the fries would taste burnt, which I do not believe is the case.\r\n\r\nThat said, using olive oil and using fresh cut potatoes does introduce a lot of challenges and variability into the process.  The restaurants you mentioned use frozen fries.  They are taken to a huge central facility, and cut at the time when the sugar and starch content of the potato is ideal and then frozen.  They are also likely dusted with something to make them crisp up more in the fryer.  The oils they use can go to even higher temps than ours which also makes it easier to crisp up the fries.  We will always be challenged in meeting the consistency of their fries.  We are cutting fresh potatoes every day, so the starch content varies, and as mentioned, we do not fry our oil as hot as other options.  That means, each time you order our fries, they could be slightly different (e.g., sometimes a little more crispy and sometimes a little less) - kind of like home cooked.  I personally (biased) love them.  I love the flavor the olive oil gives.  I love the natural taste.  I love that they are healthier, and I even appreciate the variability.  I do understand that is not necessarily the case for everyone, but if you do try us out again, you might have a very different fry experience.\r\n\r\nSorry for such a long winded response, but you took the time to provide thoughtful feedback, so I wanted to give you a thoughtful response.\r\n\r\nThanks,\r\n\r\nMike", "title": "Owner Response", "published_date": "2015-09-03T11:28:32-0400", "id": "306737422"}, "trip_type": "Solo travel", "published_date": "2015-09-01T14:55:49-0400", "location_id": "8091033", "id": "306098333", "user": {"username": "Scales1967", "user_location": {"name": "Ann Arbor, Michigan", "id": "29556"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-08", "title": "great staff organic meat.", "url": "https://www.tripadvisor.com/ShowUserReviews-g29556-d8091033-r305614899-m11068-Elevation_Burger_Ann_Arbor_Liberty-Ann_Arbor_Michigan.html#review305614899", "text": "very nice staff. however for the price you pay. the food is not big enough for the value. needs to change grilled cheese sandwich to sandwich bread", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mike T, Owner at Elevation Burger Ann Arbor - Liberty, responded to this review", "text": "Hello.  Thank you for giving us a shot and taking the time to write a review.  Using the quality of ingredients that we do and preparing them fresh the way we do, does the drive the cost up versus many other burger options.  My sincere hope is the taste, quality and service is enough to still deliver real value, but I know that may not always be the case for everyone.\r\n\r\nWe are actually in the process of changing our grilled cheese sandwich to a more standard size and shape bread.  We've identified the specific bread recipe we'll use, and we're just waiting for them to get stocked into our distributor so we can get them into the restaurant, so coming soon!", "title": "Owner Response", "published_date": "2015-09-02T06:05:06-0400", "id": "306288502"}, "trip_type": "Solo travel", "published_date": "2015-09-01T01:33:26-0400", "location_id": "8091033", "id": "305614899", "user": {"username": "theswamp6", "user_location": {"name": "Birmingham, Michigan", "id": "41996"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-06", "title": "Nice place", "url": "https://www.tripadvisor.com/ShowUserReviews-g29556-d8091033-r287427024-m11068-Elevation_Burger_Ann_Arbor_Liberty-Ann_Arbor_Michigan.html#review287427024", "text": "Knew already the other one in Ann Arbor and was in downtown, so decided to go here to show my friends. They close early! The burgers are nice, everything is organic and I just absolutely LOVE the fries with all toppings, I can't help myself. Luckily they write the number of calories on the menu, so you know the damage!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Mike T, Owner at Elevation Burger Ann Arbor - Liberty, responded to this review", "text": "Thank you so much for trying out our new location and for the kind review.  I really appreciate it!", "title": "Owner Response", "published_date": "2015-07-11T12:39:03-0400", "id": "287973254"}, "trip_type": "Friends getaway", "published_date": "2015-07-09T15:48:16-0400", "location_id": "8091033", "id": "287427024", "user": {"username": "suusco66", "user_location": {"name": "Ann Arbor, Michigan", "id": "29556"}}}]}