{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Great food pretty good service", "url": "https://www.tripadvisor.com/ShowUserReviews-g29099-d4742799-r372978615-m11068-South_North_Dragon_Restaurant-Antioch_California.html#review372978615", "text": "I was at a business close to this establishment. The owner was very sick and couldn't go home. I went to S N Dragon to get her some hot and spicy chicken soup...and some for me too. The person who took my order could have been more friendly, but he was almost passable. The soup was excellent. My wife and I have gotten take out there several times since.  Everything we have purchased has been excellent.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-05-14T23:04:38-0400", "location_id": "4742799", "id": "372978615", "user": {"username": "Randy B", "user_location": {"name": "Antioch, California, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Our goto restaurant", "url": "https://www.tripadvisor.com/ShowUserReviews-g29099-d4742799-r307983743-m11068-South_North_Dragon_Restaurant-Antioch_California.html#review307983743", "text": "When we need to eat something that will be reliably good and fast and reasonably priced we call South North. \nWe love their fried rice, cherry pork, and wonton soup. We usually order a family meal so we can get the freebies that come with it and have it delivered.\nThere food is always fresh/hot and definitely the best Chinese restaurant in the Antioch/Pittsburg/Brentwood area.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-09-07T20:35:50-0400", "location_id": "4742799", "id": "307983743", "user": {"username": "Will D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2013-08", "title": "Great Food Cheap!", "url": "https://www.tripadvisor.com/ShowUserReviews-g29099-d4742799-r173561214-m11068-South_North_Dragon_Restaurant-Antioch_California.html#review173561214", "text": "This is one of our favorite Chinese Restaurants. It's a typical hole in the wall place, but clean. Not the best location, next door to a bar, in one of the older parts of town. But if you can overlook that you will find yourself enjoying a terrific meal. \nThe owners are a young husband and wife team. Amy, the wife, waits tables and takes all the to go orders...and they have a lot of them. The husband cooks, and he knows what he's doing. They were just recently voted as one of the top 100 Chinese Restaurants in the U.S. by Chinese Restaurant Magazine and Guide.\nDon't get me wrong...it's not perfect. But then nothing is. Plus food reviews are so subjective. Everyone has different tastes and what one person may love, another hates. But I highly recommend giving this place a try. The quality is very good and the price is beyond affordable. Plus they are so accomodating. They will change up anything for you and make it the way you like it. #1 plus in my book. There's nothing worse than a restaurant that's inflexible and unwilling to accomodate different tastes. Amy will bend over backwards to make her customers happy. She's so friendly and wants to know everyone's name, which she remembers next time you go in. Very impressive.\nWe've tried many dishes since we first started coming here about 4 months ago. We really like to love almost everything. The only exception, so far, has been the pork fried rice, which we would normally not order, but it came as part of the $9.95 Family Dinner #2. It was a little dry for us. Amy has since told us she would happily substitute Chicken Chow Mein, which we love and is one of the best we've ever tasted, at no additional charge next time we order that meal. \nJust an example of how reasonable their food is. On our first visit we ordered the Family Dinner #1 @ $7.95 per person. Until coming here, We NEVER ordered pre set dinners at Chinese restaurants but this one had 2 good entree dishes and we felt it was a good way to get a taste for the cuisine without spending a lot of money, in case it wasn't so good.\nThe meal came with Hot & Sour Soup, which is typically not our favorite, but I have to say this one was pretty good. Then we each got a crispy and delicious spring roll, the main courses were Lemon Chicken, one of our favorites, Broccoli Beef and steamed rice. Big plate fulls of food too, not small portions. The Chicken and Beef dishes were some of the best we've had and Amy promptly told us the next time we came in, she would give us Won Ton Soup instead of the Hot and Sour. We've since substituted Green Bean Chicken for the Broccoli Beef and a few other things too. What more can you ask for $7.95 per person? Their prices are literally dollars less per dish than other restaurants in the area.  The Moo Shu is perfection, the Kung Pao delicious, the Honey Walnut Prawns and Sizzling Beef w/Sweet Plum Sauce outstanding,The Sweet & Sour Prawns huge, perfectly cook, a large portion and at only $8.95, a real bargain. We recently went out with another couple for a celebration dinner at another upper scale type Chinese place in town and paid $12.95 for the same dish that wasn't nearly as well prepared or generous.\nSo, if you want a really great, inexpensive meal served by a friendly, happy lady then give South North Dragon a try. I don't think you'll be sorry. Plus they do a lot of take out and they also deliver. You can order online too from their website. www.southnorthdragon.com You get free bees depending on how much you order...example: Free order of egg rolls w/$20 or more, free Fried Rice w/$30 or more, free Fried Pork Wontons w/$40 or more and free Orange Chicken w/$50 or more (and this counts with dine in eating too, not just take out/delivery). No one else does that!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2013-08-22T14:14:33-0400", "location_id": "4742799", "id": "173561214", "user": {"username": "Vickiefromca", "user_location": {"name": "Antioch, Ca.", "id": null}}}]}