{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-11", "title": "Go for a float!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30274-d5613151-r429722966-m11068-U_Float-Auburn_Washington.html#review429722966", "text": "I find float tanks to be a great way to unwind and relax. This is a non-pretentious float spa with good tanks, good water temps, and informed staff. This is a great spot for first timer floaters or experienced ones.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-10-19T08:21:56-0400", "location_id": "5613151", "id": "429722966", "user": {"username": "djstatick", "user_location": {"name": "Lakewood, Washington", "id": "58555"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-05", "title": "A relaxing escape and fabulous experience!", "url": "https://www.tripadvisor.com/ShowUserReviews-g30274-d5613151-r207619241-m11068-U_Float-Auburn_Washington.html#review207619241", "text": "I took my husband here as a surprise on our anniversary, and it was such a great experience, from the excellent service provided by the owner Phil to the small touches of attention to detail in the float rooms. My husband suffers from terrible back issues and is constantly in and out of the chiropractor to be adjusted, as his discs are severely out of whack most of the time. This was a perfect way for him to completely relax and let go and when he emerged from his float room, his cheeks were rosy, he had a happy grin on his face and the one word that came out was, \"Awesome!\"\n\nThe place is small and tucked away in downtown Auburn. The waiting area is very clean and pleasantly quiet. Phil explained everything to us and showed us to our rooms. There were towels, rags, soap, a shower and a mirror in each room. We were instructed to shower, put earplugs in, and climb into the dark cocoon, and that soft piano music would start playing to alert us that our time was up. We were told to experiment with arm placement (either arms at your sides or in a \"goalpost\" formation to take pressure off the shoulders) and shown where a pool noodle was tucked away in case extra support was needed under our backs or behind our necks. \n\nThe idea is to be in complete darkness and silence and relax your mind and body completely. It's a little scary being in a dark chamber at first but you can open the door anytime if you need light. I fell asleep a few times and my husband said he slept most of the time. \n\nOverall, the experience left us energized and relaxed at the same time. It was clean at the facility, Phil made us feel super comfortable, and it was easy to do. The hour flew by! We will definitely do it again and have already recommended it to several friends. :)\n", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2014-05-28T09:29:38-0400", "location_id": "5613151", "id": "207619241", "user": {"username": "Emily M", "user_location": {"name": "Seattle, Washington, United States", "id": null}}}]}