{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "Fun!", "url": "https://www.tripadvisor.com/ShowUserReviews-g35394-d4299388-r379516738-m11068-Lucky_Dog_Tavern-Boise_Idaho.html#review379516738", "text": "We hit up the Lucky Dog while staying at the hotel across the street. It was a busy night. We knew it was a gay bar and thought we'd join in the fun. All ages. Mostly guys. Bartenders was efficient and friendly. In fact, most of the clientele were friendly. We had a great time. There was a DJ. No one was dancing but it was a lively night.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-03T19:09:37-0400", "location_id": "4299388", "id": "379516738", "user": {"username": "joburkholder1", "user_location": {"name": "Annapolis, Maryland", "id": "29494"}}}, {"lang": "en", "rating": 3, "travel_date": null, "title": "Nice gay bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g35394-d4299388-r274534541-m11068-Lucky_Dog_Tavern-Boise_Idaho.html#review274534541", "text": "Found out this was one of the local gay bars in Boise. And it was right across the street from my hotel. So I had to check it out. Went in on a Saturday afternoon. Didn't eat anything, only a drink. \n\nAt 3:00pm on a Saturday I was a bit surprised the place was so empty. Wasn't more than 6 people there, including the bartender. So pretty empty. The place was a nice joint. Clean and very well kept. Kind of old fashioned in a 1960's pre-stonewall / pre-modern gay rights kind of way. 1960's torch-song like music playing; perhaps just the afternoon music, who knows? \n\nThey had a few rather nice pool tables and seating tables for customers. The few people there were all at the bar however. Very little in this bar was indicative of it being a gay bar. A few rainbow colored ceiling tiles, not arranged in a rainbow pattern. A small rainbow colored American flag mounted in the window out back on their fenced private outdoor patio. A poster on the wall advertising a local gay event.\n\nThe bar itself was clean and very well maintained. Drinks were good, bartender friendly and somewhat outgoing. Other clientele were on the older side, 40's, 50's, and perhaps 60's. I'm in my 50's so that's cool with me.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-05-25T15:06:53-0400", "location_id": "4299388", "id": "274534541", "user": {"username": "Bolero49", "user_location": {"name": "Reardan, Washington", "id": "58701"}}}, {"lang": "en", "rating": 4, "travel_date": null, "title": "Good pub fare and great desserts", "url": "https://www.tripadvisor.com/ShowUserReviews-g35394-d4299388-r268159826-m11068-Lucky_Dog_Tavern-Boise_Idaho.html#review268159826", "text": "Recently attended an a sporting event in Plymouth and we were looking for a place for a late lunch. One of the locals suggested Lucky Dog Tavern in the center of town.  \n\nIt is an informal place with knotty pine and rustic decor. We were seated in a booth with a view of the street.  The menu is fairly extensive as you might expect from a tavern in a college town.  It includes salads, burgers, sandwiches, Mexican, and a variety of appetizers.    Our party ordered a large appetizer that included fries, onion rings, and chicken fingers.  This was not the best value we determined later as we might have been better off ordering individual appetizers.   But the quality was good.  \n\nOur meals included a veggie burger, a veggie quesadilla, a traditional burger, and a pulled pork sandwich.  The burgers were very good with generous amounts of hand cut fries or curly fries. The fries here are seasoned and very good.  The pulled pork was good but not as tender as we had hoped and a little dry.   The quesadilla was very good and contained fresh ingredients. \n\nWe ordered two desserts: the brownie sundae and the s'mores.  The brownie was huge and luckily 3 of us shared it and it was great. The s'mores is a setup where they bring a tray with a flame in the center and ingredients around it.  You make your own s'mores and there was enough for all 6 of us to make a few. \n\nService was prompt and friendly and prices are reasonable.  You can check out the menu online. \nWe did not try any alcoholic beverages but they had a good variety of domestic and craft beer. \n\nOverall I can recommend this as a good option for lunch in the Plymouth area if you are looking for a casual place with good food and greet desserts.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-04-26T13:21:44-0400", "location_id": "4299388", "id": "268159826", "user": {"username": "Northern_Traveler701", "user_location": {"name": "Portland, Maine", "id": "40827"}}}]}