{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Skip IHOP there's a great new pancake house in town!", "url": "https://www.tripadvisor.com/ShowUserReviews-g35698-d10234849-r367980900-m11068-Sophia_s_House_of_Pancakes-Bolingbrook_DuPage_County_Illinois.html#review367980900", "text": "Sophia's House of Pancakes better then IHOP and has a much better selection too!  They have great pancakes, waffles, French toast, blintzes, crepes and awesome apple pancakes!  The apple pancakes include the regular, junior and the Dutch apple pancake, all of which are excellent and yummy!  I had a classic breakfast of two(2) eggs, hash browns, bacon and pancakes, which was all cooked to perfection.  One of our group ordered the biscuits and gravy with eggs and hash browns. they said it was very good as well.  Another ordered scrambled eggs with French toast which was just as good and tasty.  Another ordered a burger with fries and he said it was very juicy and tasted very good!  The breakfast meals offer omelets, eggs benedicts, frittatas, skillets, and Steak and eggs.  Every breakfast meat is offered from regular bacon to Canadian bacon, turkey bacon, sausage links and patties, turkey sausage, country ham off the bone and corned beef hash.  for lunch they offer, burgers, classic sandwiches, chicken sandwiches, triple decker sandwiches, paninis, wraps as well as soups and salads.  they have everything for any palette.  They also have a kid menu for little mouths. \nThe service was warm and pleasant, they kept our coffee cups full and hot. They delivered the meal without any errors and seemed very happy to serve us.  All in all it was a terrific experience and a pleasant place to eat for a very reasonable price.  Final; review, excellent and much, much, much better then IHOP!  If I had a choice, I will come here rather then go to IHOP and so should you!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-26T16:30:45-0400", "location_id": "10234849", "id": "367980900", "user": {"username": "Rene G", "user_location": {"name": "Bolingbrook, Illinois", "id": "35698"}}}]}