{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Nice place", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r436249801-m11068-The_Statler_Tower-Buffalo_New_York.html#review436249801", "text": "I went there for an event.  The food was very good and the venue is very nice.  We went to the bar afterward for drinks and they had a good selection of beer and it was reasonably priced. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-11-10T15:07:25-0500", "location_id": "275724", "id": "436249801", "user": {"username": "Deb M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Turn of the Century Elegance", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r401882670-m11068-The_Statler_Tower-Buffalo_New_York.html#review401882670", "text": "The first floor bars, where I attended a pre-wedding gathering, were gorgeous!!!! The alcohol was good, due to a talented bar tender. Atmosphere was relaxing and elegant. Parking was valet but perhaps because of the number of guests.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-08-05T16:21:19-0400", "location_id": "275724", "id": "401882670", "user": {"username": "Ann N", "user_location": {"name": "Jamestown, New York", "id": "47964"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Beautiful wedding reception", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r387595644-m11068-The_Statler_Tower-Buffalo_New_York.html#review387595644", "text": "We attended my cousin's son's wedding reception at the Statler last week-end and it was beautiful!  The renovations on this historic building were outstanding.  The pillars and arches were elegant.  The appetizers and entree were delicious.  Our waiter, Mike, was quite personable and entertaining.  It was a beautiful setting for a beautiful reception!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-29T14:34:42-0400", "location_id": "275724", "id": "387595644", "user": {"username": "Ronalee M", "user_location": {"name": "Schuylerville, New York", "id": "48579"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Wedding Celebration!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r380677903-m11068-The_Statler_Tower-Buffalo_New_York.html#review380677903", "text": "Statler City was the perfect setting for my daughter's wedding.  The Grand Ballroom was 1930's architecture which added to the elegance of this happy life celebration.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-06-07T14:18:13-0400", "location_id": "275724", "id": "380677903", "user": {"username": "ctgrohan", "user_location": {"name": "Hornell, New York", "id": "47923"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Lovely and elegant wedding venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r316142737-m11068-The_Statler_Tower-Buffalo_New_York.html#review316142737", "text": "We attended a wedding at the Statler recently and it was absolutely lovely.  The wedding ceremony took place on a balcony area.  It was a nice size area for an intimate wedding ceremony.  After the ceremony we went down to a bar area outside the main ballroom.  There were cheese and meat stations set up.  In addition there were many passed appetizers.  The passed appetizers came out hot and were nicely presented.  After drinks we were directed into the ballroom.  The room itself is breath taking from an architectural standpoint.  Our dinner progressed at a nice pace with salad, entree's and wedding cake.  We had a choice of fish and filet and both were perfectly cooked.  We agreed that they were the best entree's we have had at a wedding in a very long time. After dinner the ballroom was large enough to accommodate a large dance floor.  Overall a lovely wedding event at the Statler.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-10-04T13:37:12-0400", "location_id": "275724", "id": "316142737", "user": {"username": "sket101", "user_location": {"name": "lima", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-02", "title": "Trendy statler lobby bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r256939714-m11068-The_Statler_Tower-Buffalo_New_York.html#review256939714", "text": "We just went to the lobby bar. It's very trendy. Big huge couches, very comfortable .  Glad to see what they did with this historic building. We just stayed for a few drinks but really enjoyed the atmosphere.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-02-28T08:34:44-0500", "location_id": "275724", "id": "256939714", "user": {"username": "cheryl g", "user_location": {"name": "Wilson, New York", "id": "48900"}}}, {"lang": "en", "rating": 2, "travel_date": "2014-12", "title": "Ice Ball 2014 (Please read)", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r247279901-m11068-The_Statler_Tower-Buffalo_New_York.html#review247279901", "text": "Mark Croce should be ashamed of the iceball that he put on at the Statler Hotel in Buffalo, NY. The only positives were:  People from Buffalo were dressed beautifully.  It was so nice to see everyone out looking the way they did.  Boys of Summer was one of the bands that played, and they were very good.  The waitress who brought our drinks was very nice and worked very hard. \n\nThe negatives:  Sushi was served for appetizers but was not fresh at all.  In fact, it was quite disgusting and tasted old.  I was hoping that our meal would be more satisfying, but it was terrible too.  It reminded me of bad buffet food.  At $150 per person, the food should have been, at least, good.  I never felt satisfied.  The food was all served on plastic plates with plastic ware.  I can handle the plastic, but I can't handle the bad food.  Now for the big NEGATIVE, the Ice Ball states that premium liquor will be served.  I couldn't even get Tangeray Gin, and the mixers tasted like koolaid.  Our drinks tasted like they were watered down.  Everyone at our table was complaining about it.  One room had a DJ playing club type music, and he was so inexperienced.  There wasn't even a designated place to dance in that area.  It was so strange.  The other room with a band that wasn't Boys of Summer felt the same way.  It was just plain weird.  Now, since this is a big celebration night and many people took cabs to the event to be responsible, you would think that there would be a line set up for people wanting to return home in cabs.  It was so disorganized.  People were fighting for cabs going out in the freezing cold to try and hail one.  \n\nI really had high hopes for this party because we like going out to celebrate and supporting Buffalo event; however, you would be better off trying to find another place.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-01-03T16:51:01-0500", "location_id": "275724", "id": "247279901", "user": {"username": "Moreland5", "user_location": {"name": "Buffalo, New York", "id": "60974"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-06", "title": "Beautiful venue for a classic wedding in the city", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r164898352-m11068-The_Statler_Tower-Buffalo_New_York.html#review164898352", "text": "I went here for a wedding, and i was blown away by the old - school detailing in the architecture.  Beautiful inside and out. A nice touch was the entry area and the balconies were small but convenient for fresh air/ smoke break, and offered nice views of downtown buffalo. Id reccommend this place , however i am unsure of the costs.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2013-06-23T06:57:58-0400", "location_id": "275724", "id": "164898352", "user": {"username": "Nachotown", "user_location": {"name": "East Rochester, New York", "id": "47648"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-06", "title": "In Process", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r164198227-m11068-The_Statler_Tower-Buffalo_New_York.html#review164198227", "text": "The renovation setup, while understandably necessary, certainly detracts from old time beauty of this building. I'm not sure what could be done to prevent the obvious signs of concrete work, etc. \n\nThe ballrooms are large and nicely decorated. I found the staff to be quite helpful, actually, contrary to other reviews I had read. \n\nWere we to book an event of our own, however, we would likely not choose this venue until it has been refurbished. In its current state, guests can feel like they will be handed a hammer and put to work at any time!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-06-16T14:56:59-0400", "location_id": "275724", "id": "164198227", "user": {"username": "Gaseoustania", "user_location": {"name": "Lake Helen, Florida", "id": "34365"}}}, {"lang": "en", "rating": 2, "travel_date": "2013-05", "title": "Lovely renovation, but lousy service", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r162064739-m11068-The_Statler_Tower-Buffalo_New_York.html#review162064739", "text": "Attended a family wedding reception here, and nearly drove by the place.  Absolutely no visible signage...building covered in scaffolding...looks like an abandoned or construction site.  The interior lobby has been beautifully restored to it's old-fashioned glory and really is lovely to see.  It's clear that's where the owners have spent their $. And that's it. The service is abysmal. The food for the cocktail portion of the reception was served without any tableware...or even toothpicks.  Is carrot slaw finger food?  And the nice spread of cheeses and prosciutto ham made one's hands greasy to eat.  Bad catering management.\n\n  An hour later, the meal was rushed at us. The food quality is good, but you'd better eat fast.  A trip to the ladies' room (clean at first, but no refill on paper towels & TP later on) made me miss out on the wedding cake.  The table was swept clear of all, even napkin & water glass.  My husband had to go into the kitchen!! to ask for two slices of cake, and forks, as they were storing them away as quickly as possible.  (For whose later enjoyment?) No waiter would bring another water glass...\"Go ask at the bar\".\n\n   Because we were there for a family wedding, we expected the usual reception rigamarole.  The very minimum was finished as briskly and brusquely as possible. Never any introduction of the groom's father or bride's mother.  The requisite bride/father and groom/mother dances, and two quick toasts. The cake cutting happened before salads were served.  It was not unlike much cheaper receptions we've attended where the room was rented to another party soon after...not the case here. We were booked for 5 hours, but all service but the two barmen was GONE halfway through.\n\n  if you plan any event there....since it really IS a lovely venue...be very forceful in your demands with the management.  They haven't yet worked out the kinks & don't seem to know how to run a formal party, no matter what they're charging.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-05-27T22:18:49-0400", "location_id": "275724", "id": "162064739", "user": {"username": "E L", "user_location": {"name": "Nyack, New York", "id": "48310"}}}, {"lang": "en", "rating": 4, "travel_date": null, "title": "Great Memory", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r160209956-m11068-The_Statler_Tower-Buffalo_New_York.html#review160209956", "text": "Attended a Luncheon  - great food, great job,  beautiful building!  I's so glad that this magnificient building was saved!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2013-05-09T14:02:03-0400", "location_id": "275724", "id": "160209956", "user": {"username": "Mary M", "user_location": {"name": "Cheektowaga, New York", "id": "47454"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-04", "title": "Great venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r158020646-m11068-The_Statler_Tower-Buffalo_New_York.html#review158020646", "text": "I was here for the UNYTS Bucket List Bash and had a geeat time in this beatufilly restored, historic building. The main ball room and lobby area are magnificent. It is just so nice that Buffalo has a venue as exquisite as this. The ball room would also be perfect for weddings.  Since our event ended early, we headed to  the Lobby Bar also inside the Statler. This is a perfect hangout spot with many tvs, shuffleboard, cocktails, and craft beer. It is a classy bar which is away from.Chipewa so you feel safe as well. I am so glad the Statler has been restored and Im looking forward to attending many more events here.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2013-04-17T06:32:42-0400", "location_id": "275724", "id": "158020646", "user": {"username": "kwnike13", "user_location": {"name": "Grand Island, New York", "id": "47812"}}}, {"lang": "en", "rating": 1, "travel_date": "2013-01", "title": "Roswell Park Employee Event", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r149692599-m11068-The_Statler_Tower-Buffalo_New_York.html#review149692599", "text": "It was the worst dinner I have ever been to. If you have more than 300 people find some place else. They did not have enough seats. The food ran out and what was available was poor quality.\nI had to wait in line for 40 minutes to get food and when we did get some we had no place to sit. Who ever was in charge of the event should loose their job. People at Roswell Park loose their jobs for alot less.The only thing we enjoyed about the place was the decor.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2013-01-14T14:21:51-0500", "location_id": "275724", "id": "149692599", "user": {"username": "Brain C", "user_location": {"name": "Buffalo, New York", "id": "60974"}}}, {"lang": "en", "rating": 5, "travel_date": "2012-10", "title": "Hosted our wedding!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r149616209-m11068-The_Statler_Tower-Buffalo_New_York.html#review149616209", "text": "If you can get a reservation here for your wedding, you will have the best night of your life!  The food is delicious, and the service is absolutely second to none.\n\nThese people are going to make sure that your wedding day is perfect.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-01-13T16:00:05-0500", "location_id": "275724", "id": "149616209", "user": {"username": "Wayne B", "user_location": {"name": "Buffalo, New York", "id": "60974"}}}, {"lang": "en", "rating": 2, "travel_date": "2013-01", "title": "Can't handle big crowds", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r149566646-m11068-The_Statler_Tower-Buffalo_New_York.html#review149566646", "text": "Went there 1/11/13 for the Roswell Park Holiday party. We waited in line for 45 minutes at the buffet... one buffet for hundreds and hundreds of people!! No plates when we finally got to the table, but that's ok because there was no food. EVERY tray was empty! There was not enough seating for every one. I mean a hundred people standing! The bar didn't have orange juice and the toilets overflowed!  When it came time to leave I asked the gentleman who was outside and incharge of the valet service if he could hail us a taxi. He said there is one over there, pointed across the street and turned his back on me. So I went out, stood in the street in the rain and flagged down a taxi...isn't it your job to do that?  The building is beautiful, no doubt about that but the management has no clue of the proper way to deal with large crowds of people....  and they have demonstrated this time and time again. In the past, Roswell has held their party and either the Hyatt or the Adams Mark. Both places managed the large crowd beautifully. No lines for food because they had many food stations set up all over. They also had plenty of seating for all. I hope Roswell goes back to one of those establishments next year. I was so excited to go to the Statler, no I hope I never have to go there again, what a shame.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-01-13T04:20:10-0500", "location_id": "275724", "id": "149566646", "user": {"username": "deb s", "user_location": {"name": "Lackawanna, New York", "id": "48011"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-01", "title": "New Year's Eve 2013 in the Statler.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r149125801-m11068-The_Statler_Tower-Buffalo_New_York.html#review149125801", "text": "The Statler is a classic hotel built around 1920.  It has been mostly vacant for several years.  As a native of Buffalo living in Virginia it is nice to see the downstairs main areas being renovated.  I don't know who owns it now, but I congratulate them for their efforts;  very expensive.  My wife, friends and I spent this past New Year's Eve at the Hotel's Second Annual Ice Ball.  It was an experience worth the travel expense and to once again feel the frigid cold weather.  Providing food for any large event is difficult, nevertheless, the Statler staff did an incredibly great job of serving an interesting, good and plentiful buffet in several different hotel locations.  Also, the wait staff wherever we went was consistently friendly and competent.  We also enjoyed the Frank Sinatra music in one of 5 party rooms.  Finally, I was impressed by both the management and the quality of this event.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-01-07T15:11:33-0500", "location_id": "275724", "id": "149125801", "user": {"username": "Gmerek", "user_location": {"name": "Virginia", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2011-12", "title": "Take a LOOK!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r144774234-m11068-The_Statler_Tower-Buffalo_New_York.html#review144774234", "text": "what a building!  Went to see the Statler of my youth---and, although it's got a ways to go, I felt such hope that it'll be restored to it's former beauty!  The Golden Ballroom, the site of many Capitol Hill shows,  proms, weddings was needy-as are most corners of this huge building.  It takes time and lots of money to save our buildings from Buffalo's \"glory days\".  The chandeliers alone are worth walking into the Statler!  High ceilings, vast banquet rooms, ornate plaster and iron work are everywhere you look. It's a beautiful building! Can't wait for completion!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2012-11-06T08:58:32-0500", "location_id": "275724", "id": "144774234", "user": {"username": "rbrfan", "user_location": {"name": "West Seneca, New York", "id": "48858"}}}, {"lang": "en", "rating": 3, "travel_date": "2012-09", "title": "Turn this around - quick!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r141313193-m11068-The_Statler_Tower-Buffalo_New_York.html#review141313193", "text": "The renovated building is gorgeous indeed, but the service is appallingly bad.  We came into the front door and were immediately - even if politely -- challenged (not welcomed), \"can I help you?\"  Is security that big an issue that three, well-dressed business people cannot walk in the door without being asked why they are there? Note:  It was not a welcoming, \"can I help you.\"  It was a \"You're not taking one more step until I assess you.\"  \n\nWe continued on to the bar area, which is lovely, took a seat and after waiting a bit, found there is no wait staff.  I went to the bar and got our drinks but the bartender was aloof, distracted and really not interested in making us feel welcome.   We later ordered a few bar snacks and waited, and waited and waited.  When they did come out and sat on the bar, I went and retrieved them, but everything was ice cold.  I tried to track down a manager to no avail. \n\nThis place has the potential to be a real downtown gem. But it's a high-end, high-priced venue with low end service.  Management must tackle this issue immediately, or people will not be back.  \n\nIn summary: Go to see the renovations - it's worth that alone. But don't expect anyone to care that you're there -- except the gate keeper.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2012-09-26T03:17:43-0400", "location_id": "275724", "id": "141313193", "user": {"username": "stkittchick", "user_location": {"name": "Ontario", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2012-02", "title": "What a beautiful place!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r134215129-m11068-The_Statler_Tower-Buffalo_New_York.html#review134215129", "text": "I hope to see this place fully restored.  It is truly a nice place for events.  I'm sorry for those that rated it so poorly based on an event rather than the building itself.  Maybe it was just the caterers that were bad, or maybe they just were overwhelmed...I don't know, I didn't go to the Ice Ball and i do not know if it is the same management for every event.  \n\nI did go here for the \"Powder Keg Festival\" though.  My friends and I had a great time and really enjoyed seeing the Statler for the first time.  I'll hold my comments on the \"Powder Keg Festival\" for its own review.  The Statler Tower itself is beautiful.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2012-07-12T11:59:24-0400", "location_id": "275724", "id": "134215129", "user": {"username": "mjkelly75", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": null, "title": "nice", "url": "https://www.tripadvisor.com/ShowUserReviews-g60974-d275724-r124554011-m11068-The_Statler_Tower-Buffalo_New_York.html#review124554011", "text": "have attended numerous events.  always enjoy the wonderful architecture.  a great bit of history", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2012-02-13T17:22:11-0500", "location_id": "275724", "id": "124554011", "user": {"username": "hokeyma", "user_location": {"name": "Amherst, New York", "id": "29810"}}}]}