{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "Holistically enriching", "url": "https://www.tripadvisor.com/ShowUserReviews-g46340-d5951675-r398078397-m11068-St_Joseph_Polish_Catholic_Church-Camden_New_Jersey.html#review398078397", "text": "Not being a catholic parishioner myself, yet still finding it religiously elevating and more than holistically fulfilling a Christian man. I wholeheartedly, enjoy architecture in every degree and at the same time am facinated about religious cultural differences as we all have evolved from bits a piences of each others religions, over the ages. For me ti was like stepping out of time and into Ephesian, where Paul to date, if my memory serves me correctly. is the only apostile through which our lord and Jesus christ deatl with the gentiles effectively and fervantly to the uncircumcised christian foloowers of Christ. In true admiration of the his Roman citizenshio, and also, liken unto aniother, John The Bapitist, and their experience of birth and understandings of the religious doctrines have pathed the way for many unto salvation. But back to the church, it was revelational in religious enrichment and spiritually ept in its authentic purpose of serving as a both and iconic structure and yet, as a architecture wonder many now days take likely, in it's existance. I 100% fiully recomend your vist and a self-oberservational review of your walk as a moral man/woman of character and as a global citizen. For within us all lies a wealth of knowledge desiring of cultivating, but we must take the first step.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-27T11:34:58-0400", "location_id": "5951675", "id": "398078397", "user": {"username": "durtwill", "user_location": {"name": "Camden, New Jersey", "id": "46340"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-12", "title": "WELL WORTH YOUR TIME", "url": "https://www.tripadvisor.com/ShowUserReviews-g46340-d5951675-r363316920-m11068-St_Joseph_Polish_Catholic_Church-Camden_New_Jersey.html#review363316920", "text": "THIS IS ONE BEAUTIFUL interesting roman catholic church the stained glass windows are great as well as the rest of the interior of the church very well maintained go on sunday morning", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-11T05:26:42-0400", "location_id": "5951675", "id": "363316920", "user": {"username": "Joseph O", "user_location": {"name": "St. Petersburg, Florida", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2013-12", "title": "A true pearl hidden in Camden", "url": "https://www.tripadvisor.com/ShowUserReviews-g46340-d5951675-r190557030-m11068-St_Joseph_Polish_Catholic_Church-Camden_New_Jersey.html#review190557030", "text": "Saint Joseph's Parish was founded in 1891 when a group of Polish immigrants . In 1892 Saint Joseph's Church was officially incorporated . Philadelphia architect George I. Lovatt designed a Baroque-style church which was constructed in 1913. In May 1914 the new church was consecrated. We are glad we visited it - it is a remarkable place. The church is beautifully maintained in spite of being located in the troubled city of Camden. The interior is impressive with many unique details. Especially amazing are the stain glass windows. The church has a safe parking lot but if you want to feel completely confident visit it during the times of masses.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-01-11T17:36:41-0500", "location_id": "5951675", "id": "190557030", "user": {"username": "podrozniczka60", "user_location": {"name": "New Jersey", "id": "28951"}}}]}