{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-01", "title": "Best deal for 'quality' beer", "url": "https://www.tripadvisor.com/ShowUserReviews-g3511549-d5847934-r248558878-m11068-Quality_Beer-Champaign_Urbana_Illinois.html#review248558878", "text": "I was shocked at some of the prices on the bottles.  Really good deals. Also, extremely friendly staff. Friend told me to check out the Blind Pig Brewery, but preferred Quality.\n\nProbably best for 22-35 yo.\n\nNo food - they offer pub mix for a buck.  We saw people with food there, so they must no have a problem with outside food. Really a laid back, fun environment.\n\nNo TVs - instead they have darts, boardgames, pinball, and pacman.  \n\nAgree with other poster, got pretty busy on the weekend while we were there.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-01-09T18:40:39-0500", "location_id": "5847934", "id": "248558878", "user": {"username": "James V", "user_location": {"name": "Vancouver, Canada", "id": "154943"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-12", "title": "Trendy, hip bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g3511549-d5847934-r245613895-m11068-Quality_Beer-Champaign_Urbana_Illinois.html#review245613895", "text": "This bar is great when it's not busy.  They have a large variety of microbrews, as well as a full bar.  \n\nThe bartender who served us was very friendly, and let us try samples even though it was a busy Saturday night.  \n\nHowever, as it was a Saturday night the place was absolutely PACKED.  We tried to sit at the bar, but two girls came back from smoking outside to reclaim their seats.  We stood around for a while, decided we couldn't have much of a conversation over the roaring din of boisterous drinkers and left.\n\nBUT, they have two pinball machines tucked away in a corner which we were very excited about.  It's $1 per play, which is a little high for me to play more than once.  They also have a bookshelf full of board games that people can borrow and play in the bar.  This works when it's not busy.  On a Saturday night, I'm not sure you'd have much luck with this unless you're friends with a wookie. \n\nUltimately this bar is probably ideal for singles aged 22-27 and beer connoisseurs.  It's least busy between 5-7 on a weeknight, so grab a pint before you see a show at the Art Theatre.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-12-23T04:15:33-0500", "location_id": "5847934", "id": "245613895", "user": {"username": "Sarah3M", "user_location": {"name": "Champaign-Urbana, Illinois", "id": "3511549"}}}]}