{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2016-05", "title": "Wedding ", "url": "https://www.tripadvisor.com/ShowUserReviews-g35805-d5965674-r383111550-m11068-A_New_Leaf-Chicago_Illinois.html#review383111550", "text": "A unique concept for an event with much potential. This venue which is half flower shop and half event space with a beautiful outdoor courtyard has many nice features.  However I would caution you on the type of event you use this space for. There are several challenges and limitations. I attended a wedding reception here and seating space was limited to half of the 90+ guests. Not fun having to stand and eat.  The space is better used for cocktail events as it has a lower and upper level so this really separates your guests. The band played upstairs and many of the older guests could not walk the cool suspended stairs or ramp to participate.  The modern decor with exposed brick walls and metalwork really play to a chic event and with the right creative planning you can make this a memorable positive experience. Food stations work best but find a way to fill the space with lots of high tops and small tables so guests can set a drink or sit. Although the courtyard is filled with beautiful flowers, plants and benches unless you have nice weather it's useless.  Or pitch a large canopy and lots of heaters (10) on rainy or cool days/nights. I believe you can bring in your own caterer however be sure who ever you hire is familiar with the property.  It can be challenging to work in such a small space.  The caterer used at the wedding I attended was flustered, unprepared and slow due to kitchen restrictions and outdoor grill issues. There is no parking so guests will need to cab/uber it to and from.  Final suggestion. Be very clear with venue staff on what you can and cannot do, with set up and serving expectations and timing of service. It appeared that the kinks were still being worked out at this May's event. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-16T05:24:01-0400", "location_id": "5965674", "id": "383111550", "user": {"username": "Pat F", "user_location": {"name": "Strongsville, Ohio", "id": "51017"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "This is an excellent party space", "url": "https://www.tripadvisor.com/ShowUserReviews-g35805-d5965674-r298884602-m11068-A_New_Leaf-Chicago_Illinois.html#review298884602", "text": "I attended a party here recently and it has a wonderful blend of indoor and outdoor space, all featuring A New Leaf's beautiful greenery. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-13T10:20:09-0400", "location_id": "5965674", "id": "298884602", "user": {"username": "SLWatty", "user_location": {"name": "Chicago, Illinois", "id": null}}}]}