{"paging": {"total_results": "7", "skipped": "0", "previous": null, "results": "7", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2014-11", "title": "Not a recommended wedding venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r239159506-m11068-The_Sage-Clearwater_Florida.html#review239159506", "text": "My wife and I used the Sage/The Palazzo for our November 2014 wedding and reception.  The purpose of this review is to give people exploring wedding venues a glimpse at my personal experience with this location.  I can tell you what we looked for in a venue, why we chose this location, and our results.  A wedding is a complicated and stressful event to plan which (hopefully) results in a very happy life with your significant other.  You deserve to be well-appraised of any party you plan to do business with for your wedding.  I do apologize for the length of this review.\nBackground: My wife and I needed to pay for the wedding ourselves.  We had a budget of roughly $10k-$12k.  We anticipated about 80-100 guests.  Neither of us are very religious, so doing the wedding and reception together would be the easiest route.  We wanted our guests to enjoy themselves, and not worry about nearby hotels or a cash bar.  Good food and an open bar were high on our priorities.\nExperience: We chose The Sage (currently known as The Palazzo, still the same owner) in August 2013 because they rolled the venue cost and food cost together in one per-head rate, they allowed us to bring in our own hard liquor, and they added a dessert table (a supposed $500 value).  The wedding coordinator, Christina, was very helpful in arranging for our needs.  The total cost for 5 hours at the venue, 4 hours of open bar (beer wine, mixers, and soda) and food for 80 guests was roughly $7,700.  The Sage (Palazzo) allowed us to make a $1,000 deposit and pay a monthly charge on my credit card so we would not have to pay the entire amount in one installment.  We took a gamble on this venue.  Later, we were able to visit The Sage (Palazzo) and try the food.  Overall, we liked the food during the tasting events.  The owner, Vincent, is a very gregarious man.\nDuring the time between August 2013 and November 2014, the venue would forget to charge my credit card.  I would have to remind them to charge me so that my wife and I could afford the wedding.  For a period in the early winter, they neglected to charge my card, so the payments went up accordingly.  This was annoying because we had carefully budgeted for the wedding.  Later they had credit card issues, so I had to send them checks.  Periodically, I would need to inform them of the payments made and the balance.  They did not keep very meticulous records.  This forced me to spend more time checking and re-checking figures than necessary.  I sporadically received invoices, and they were often missing a payment.  \nIn May of 2014, we learned the coordinator, Christina, had left The Sage (Palazzo) when we tried to contact her.  I cannot comment on how busy they were at this time, but from my personal point of view it would have been polite to let us know whom to be in contact with for any wedding issues.  \nOur new contact, Ellie, had to get up-to-speed with us very quickly.  She tried very hard to make sure everything was going smoothly.  She informed us in either August or September that our previous agreement to bring in hard liquor could no longer be honored.  The venue decided to tell us this at nearly the last minute.  They said they could still do the open bar portion, but made no serious attempts to correct the situation until I sent them a scanned copy of the contract.  \nOn the day of the wedding, the venue looked very nice.  The Sage (Palazzo) has a Mediterranean feel.  There is soft lighting which made for an intimate setting.  The bridal party had a small room set up for them (the groom’s party got ready in my hotel room).  Overall, the ceremony went off very well.  The acoustics were nice, and there was enough room for our 80 guests to sit comfortably and watch the ceremony.  \nThe Sage (Palazzo) opened the bar and served appetizers while my wife and I took pictures.  We did not get a chance to enjoy the appetizers, but our guests said they were good.  Our DJ did an excellent job as master of ceremonies throughout the night.  I initially did not want a DJ, but he proved his worth.  The dinner was adequate.  My guests enjoyed their meal, but I thought the food was just so-so.  \nOur free dessert table was… tolerable.  It was a bit odd because there were desserts like cannoli and, I believe, cheesecake near bowls of smarties.  There was also a mixed bowl of skittles and M&M’s.  I have no idea why someone would mix those two.  The dessert table was listed at $500, and I would have been upset if it were not a free addition.\nI brought home-brewed beer for my guests (which I cleared with the venue well in advance) and they served it during the reception.  At one point, they claimed to have run out.  It turned out they had just left half of it in the back.  They also claimed to have run out of the Gentleman Jack, Kaluha, moderately-priced scotch, and Bailey’s when we collected our liquor at the end of the night.  I am not suggesting any impropriety, but I am curious why the most expensive liquors were gone (especially when only 2 or 3 guests mentioned drinking the Kaluha and Bailey’s).  My father-in-law called about this, but did not hear back.\nThere was also an unpleasant smell during the reception that nobody could pinpoint.  I have no idea what it was, but it was distracting at times.  \nSynopsis: I think the people at the Sage (Palazzo) are nice.  The atmosphere is enjoyable.  Downtown Clearwater is a nice area with lovely beaches and affordable hotels.  If we could go back in time, my wife and I would have chosen another venue.  I cannot recommend this location to anyone planning a wedding.  While it is convenient to have the food and venue costs lumped together, I do not feel like I was able to trust them to keep their financial records straight.  I personally did not have a high opinion of the food or the way the wedding was coordinated.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2014-11-10T12:54:08-0500", "location_id": "4926773", "id": "239159506", "user": {"username": "HankScorpi0", "user_location": {"name": "Philadelphia, Pennsylvania", "id": "60795"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-05", "title": "Stay away!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r209491389-m11068-The_Sage-Clearwater_Florida.html#review209491389", "text": "I was in the wedding party for my friend who got married at this venue.  Before the event even began there were problems.  No one was supposed to be allowed in the venue until 30 min before the ceremony so that the bridal party could take pictures. However people were arriving and inside an hour and a half prior.  The bridal suite bathroom had no paper towel, minimal toilet paper, and there weren't enough chairs. The valet also never showed up for the arriving guests. The ceremony was beautiful and we made the best of the reception to spite additional problems with The Sage. The AC wasn't working and so all evening people were fanning themselves and sweating. They ran out of food and had people waiting in the buffet line for over 10 minutes before asking them to be seated. They also ran out of glasses and served me wine in a small vase.  As a result of the temperature, the cake and party favors (small cookies) melted. Guests also left early because of the heat and lack of food.  Lastly the tables were packed very closely together and some people couldn't get to their seats or fit in their seats without rearranging chairs.  Although I have not had personal contact with the owner, I have heard he is very difficult to work with and has not responded to my friend since her event. To me, this is unacceptable,  you only have one special day and he was responsible for making good on his contract, which he failed to do.  The venue is beautiful but I would think twice before booking this for your special day.", "helpful_votes": "6", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2014-06-08T20:10:53-0400", "location_id": "4926773", "id": "209491389", "user": {"username": "Jessi E", "user_location": {"name": "Clearwater, Florida", "id": "34141"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-05", "title": "Aweful", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r208928758-m11068-The_Sage-Clearwater_Florida.html#review208928758", "text": "Run. This place is beautiful but the owner did an aweful job running the place and never fed most the people at the wedding and gave the wrong food ", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2014-06-04T16:56:21-0400", "location_id": "4926773", "id": "208928758", "user": {"username": "Polly142", "user_location": {"name": "Clearwater, Florida", "id": "34141"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-05", "title": "SINCE THIS HAS BEEN DELETED FROM OTHER REVIEWS", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r208787069-m11068-The_Sage-Clearwater_Florida.html#review208787069", "text": "We drove 12 hours to the Clearwater Area for my cousin's wedding. Having never been to Sage, and after hearing how great the food tasting had gone, my husband and I, along with my nearly 80 grandmother were excited about the reception at Sage. The service was slow--an entire section of the top floor never received their food! Our section received our food 1 1/2 after everyone else... nearly as people were leaving. The food was disgusting, they served the wrong chicken item to people. It isn't even worthy of one star. The best part is that the person that was paid to be there wasn't even there. This was a disaster.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2014-06-03T18:41:50-0400", "location_id": "4926773", "id": "208787069", "user": {"username": "Mad_Reception_Guest", "user_location": {"name": "Hattiesburg, Mississippi", "id": "43810"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Wedding Reception At Sage", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r200534917-m11068-The_Sage-Clearwater_Florida.html#review200534917", "text": "We recently held our wedding reception at Sage and it was better then we could have imagined. Vincent & Christina were excellent host and the staff was awesome! Vincent is a talented chef , his Penne Vodka was the best I ever had and Christina ran the dinning room like a captain steering a ship , everything was right on course. I must say if you are thinking of a wedding or any type of event Sage is by far the best place in Clearwater.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2014-04-09T18:02:56-0400", "location_id": "4926773", "id": "200534917", "user": {"username": "Chris M", "user_location": {"name": "Tampa, Florida", "id": "34678"}}}, {"lang": "en", "rating": 1, "travel_date": null, "title": "AWFUL PLACE & OWNER", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r195697442-m11068-The_Sage-Clearwater_Florida.html#review195697442", "text": "SAVE YOUR MONEY!!  STAY HOME!! \nMy wife and I like to support local talent and restaurants. We heard this place has a new owner so we decided to go. The evening was suppose to cost $37.50 a person. I paid $100 for both of us in cash and the owner, Vincent, who said he would bring the change to my table, NEVER brought it over. Instead he gave us some of his bottled pasta sauce. The meal was mediocre at best. Evidently, they have a sewage problem because the smell was wafting over to our table. The talent was worth it, but weeks later, I heard the owner stiffs the talent on multiple occasions. These kids work hard for their money, and I have zero tolerance for weasels like him! I have urged my friends to not support this place. You'll get better Italian food at Carrabba's!!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2014-02-28T09:26:45-0500", "location_id": "4926773", "id": "195697442", "user": {"username": "MajorSherman", "user_location": {"name": "Tampa, Florida", "id": "34678"}}}, {"lang": "en", "rating": 2, "travel_date": "2013-09", "title": "A pretty venue, but...", "url": "https://www.tripadvisor.com/ShowUserReviews-g34141-d4926773-r178980495-m11068-The_Sage-Clearwater_Florida.html#review178980495", "text": "We rented the Sage for a costume party in mid-September.  A pretty venue, and nicely decorated, but the food and air conditioning left much to be desired.  The staff was very friendly and helpful, but the buffet was a bit on the bland side.  The temperature never got down to a comfortable range. probably hovering about 80.  We understand that there is parking about a block away, but we did not use it, taking a limo instead.  The band was lackluster, but the acoustics were good.  Plan carefully if you use this venue, and make your choices very specific.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-09-28T12:55:58-0400", "location_id": "4926773", "id": "178980495", "user": {"username": "CaptJason", "user_location": {"name": null, "id": null}}}]}