{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Somewhere between historic & quaint and tired & rough", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r437711913-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review437711913", "text": "If you are walking around downtown and like old historic buildings, do walk through the lobby and have a look.  The lobby area is historic and beautiful.  The hotel has the advantage of being in the center of it all, and if that is important you'll get it here.  They gave me a spacious king suite on the 14th floor, and the room itself if large and pretty nice, but at the same time there is a tired worn look about it.  For being on the 14th floor it is noisy.  I hear the honking of the car horns below, every door close down the hallway, and a whoosh - rumble as the elevator goes up and down.  Not a great place for a light sleeper.   I had much higher hopes for the property.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-16T00:17:51-0500", "location_id": "95212", "id": "437711913", "user": {"username": "DJ-USA", "user_location": {"name": "Standish, Maine", "id": "40904"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Only so-so", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r437597933-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review437597933", "text": "I've stayed here many times, but this is probably the worst experience.  I'm a Gold Elite member and upon checking in, I was placed on the 8th floor, instead of club level.  The room was musty and was super long and narrow.  This is important to know because the bed is on one wall and the tv is wayyyyyy across the room.  And, it's not a big tv...\n\nIt was late when I checked in, so I decided to take care of this the next morning.  Upon returning from the day's  business, my bed had been made, but otherwise, the room had no been cleaned at all.  A used washcloth was on the floor, another was still  by the sink.   There was also some wood chips by the door, as if the door was flaking off.  Very evident when I entered the room, but obviously, not apparent at all to the housekeeper.   It was if, somebody got distracted in the middle of cleaning and never came back.\n\nThen, I was moved to club level, but in a room right outside of the hotel mechanicals on the 12th floor.  I tried to go with the flow, I really did.  The noise was just unbearable.  Currently,I am in a much more comfortable room on the 14th floor.\n\nOne important thing to note is that not all the rooms have heat that you can adjust.  You get this line about the historical nature of the hotel, but heck, it's November, it's cold.  Turn the heat up.  I'm guessing the temp in the room to be in the 50s.  They do offer space heaters.\n\nMy current room does allow me to adjust the temperature, but I had already asked for a space heater.  The first two rooms had big stickers on the radiator cover explaining that the controls were only for air conditioning.  So, I never checked in my 3rd room.  I wish I had known last night, I slept in my leggings and a sweater over my gown.\n\nI was credited 500 Marriott points for my trouble.  I really hate to complain and change rooms and all that kind of thing.  But, I kind of took it personally that I was placed on the 8th floor upon checking in and was at the counter with another guy and a gal with whom I shared an elevator.  They both pressed club level floors.   My transaction was completed FIRST.  Obviously, club level rooms were available. Why assign only ME to a non club level room...? Just seemed like a complexion connection to me...\n\nAnd last, Tonda in the concierge lounge is the best!  I would only ask that she or whomever prepares the bacon, not make it all so super extra crispy.  Like, the stage just before burnt...", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-15T11:46:38-0500", "location_id": "95212", "id": "437597933", "user": {"username": "Vivimama1", "user_location": {"name": "Ohio", "id": "28956"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Very neat older hotel, but getting a little rough around the edges", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r437059834-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review437059834", "text": "I've stayed here multiple times over the last 10 years, but this review is focused on my stay here last week with me wife on an impromptu get away. Location is great. Right on public square and easily walkable to casino and fourth street. Lobby is has a lot of style and very nice. I have status with Marriott and I believe I was in a newer room that was \"ok\". Hotel HVAC is a real problem. It was a warm November day when we were there and the hotel had switched the entire system over to heat, so the only way to cool the room down was to open windows the 4\" they were allowed to open. Result was room was very hot all night and nothing that could be done. We ultimately called front desk for a fan during the night. I heard other guests having the same observations at breakfast the next morning. Other main take away is the hotel breakfast. We had a free breakfast included with our room, however when we went down it was terribly clear the restaurant size was only geared up to accommodate a fraction of the guests that stay there. We waited 15 minutes for a table and by the time we left line was twice as long. Buffet was pretty standard and ok, but nothing special. Restaurant staff was somewhere between overwhelmed and rude. Avoid the breakfast......", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Chad C, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Dear MJ,\n\nThank you for your continued loyalty throughout the years to Marriott and the Renaissance Cleveland Hotel. Appreciate you mentioning our superior location to Public Square and our iconic and stylish lobby. We are excited to share that we are in the process of upgrading our entire hotels HVAC units and will soon be providing state of the art controls for our guests. Thank you for the candid feedback with regards to Breakfast. Our Team is consistently complimented on our great service and atmosphere; obviously we failed to execute as well on the morning you were with us. We will use your feedback for training and to insure improvement. Thank you again for your business and for choosing the Renaissance Cleveland Hotel. We hope to see you on your next trip to the area. \n\nAll the best,\n\nChad", "title": "Owner Response", "published_date": "2016-11-15T04:26:21-0500", "id": "437438145"}, "trip_type": "Couples", "published_date": "2016-11-14T03:18:16-0500", "location_id": "95212", "id": "437059834", "user": {"username": "mjmorris009", "user_location": {"name": "Chagrin Falls, Ohio", "id": "50184"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Wedding weekend ", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r432005496-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review432005496", "text": "Downtown Cleveland was pretty clean. A lot of renovation but plenty of places to eat nearby and casino Jack right next door. Parking was convenient along with entertainment. Basketball and Football arenas within walking distance. Homelessness present but what big city do you know of that homeless people hangout downtown?", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Chad C, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Dear Joel,\n\nGlad to hear you enjoyed our superior Downtown Cleveland location! The 40 million dollar renovation of Public Square has really enhanced the central core of the City ...great meals, entertainment and of course world class sports venues are at our doorstep. Hope to see you on your next trip to Cleveland.\n\nAll the best!\n\nChad ", "title": "Owner Response", "published_date": "2016-11-14T07:47:44-0500", "id": "437131544"}, "trip_type": "Family", "published_date": "2016-10-26T19:36:57-0400", "location_id": "95212", "id": "432005496", "user": {"username": "joelistenbee", "user_location": {"name": "Grand Prairie, Texas", "id": "55922"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Renaissance Hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r431865299-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review431865299", "text": "The hotel is gorgeous and the rooms are nice.  It was a really nice stay for a good price.  There is a Mediterranean restaurant in the hotel, a bar area, and even a pianist in the \"lobby\".  I recommend getting breakfast with your stay if available at the time of your reservation.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Chad C, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Dear Verus,\n\nThank you for taking the time to provide feedback with regards to your recent stay. The Renaissance Cleveland Hotel provides an iconic setting with a Grand lobby offering excellent food & beverage and entertainment options, glad you were able to enjoy during your visit. We look forward to seeing you on your next trip to Downtown Cleveland!\n\nAll the best,\n\nChad ", "title": "Owner Response", "published_date": "2016-11-14T07:42:50-0500", "id": "437130279"}, "trip_type": "Couples", "published_date": "2016-10-26T10:18:38-0400", "location_id": "95212", "id": "431865299", "user": {"username": "Jennifer W", "user_location": {"name": "Akron, Ohio", "id": "29912"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Work conference at hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r431051329-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review431051329", "text": "I was at the Renaissance for two nights in September, for a work conference. We arrived and the check in process was very easy. We, luckily, had wi-fi paid for by the hosts of the conference because I understand it is not free in rooms. That seems strange nowadays, when so many people rely on wi-fi availability when travelling. The room itself was spacious and clean. The bed was very comfortable. The room temperature was a bit hard to control - it was blowing pretty cold air. We were not in the room a lot, so it was okay. Someone else we were in the group with said she was brought a space heater by the hotel staff, which worked well for her. The bathroom was clean and functional - the Aveda products were a nice touch. The gym in the hotel was nice; had all the basics. The pool area is attached through the gym too. The conference space was nice, although all the different rooms were kind of hard to navigate and were within different levels of the hotel. The rooms were generally pretty cold too. The bar/restaurant was okay. The service was really slow the night we ate there, but they were super busy. No huge complaints. Good location in downtown Cleveland and the hotel is attached to the casino.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Sounds like you a good overall stay at the Renaissance Cleveland hotel. We are in the center of downtown Cleveland with plenty to do as you saw while staying with us. My staff will be pleased to hear that they were able to exceed your expectations. Look forward to your return visit when your travels take you to Cleveland again in the near future. ", "title": "Owner Response", "published_date": "2016-10-24T09:26:37-0400", "id": "431250787"}, "trip_type": "Business", "published_date": "2016-10-23T18:37:02-0400", "location_id": "95212", "id": "431051329", "user": {"username": "Mary M", "user_location": {"name": "Kenosha, Wisconsin", "id": "60003"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Lovely property. Friendly staff ", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r431051057-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review431051057", "text": "Really neat history if you care to look into it. Gorgeous property , very well kept. Every person we encountered there was looking to make our stay memorable and enjoyable. Would give this an A+ all the way around and will definitely stay there again. Didn't want to leave :)  \n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Wow! Thanks for the great review. The historic design and just overall details in the architecture are just amazing as you walk around this building. They just don't make them like this anymore. I will be sure to share your comments with my staff. I know they will be very happy to hear that you enjoyed your stay with us at the Renaissance Cleveland hotel. Look forward to servicing you again soon. ", "title": "Owner Response", "published_date": "2016-10-24T09:29:13-0400", "id": "431251590"}, "trip_type": "Couples", "published_date": "2016-10-23T18:34:21-0400", "location_id": "95212", "id": "431051057", "user": {"username": "karlak2t", "user_location": {"name": "Columbus, Ohio", "id": "50226"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-07", "title": "Good hotel but charging for wifi is crazy", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r430339379-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review430339379", "text": "Stayed immediately after the RNC and room was excellent. However was charged about $16 for 24 hours wifi, which I hadn't expected and which is crazy for a hotel like this.\n\nHotel car park is also really expensive. Better to use the surface car park next door at half the price. Entrance to the hotel via the car park is also pretty grotty.  \n\nOn the other hand the room was really good and the location is second to none, right on Public Square", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Thank you for taking the time to share your experience with us. I am happy to report that WIFI is free for all Marriott Reward members. All you have to do is sign up for Marriott Rewards and start streaming for free. I am happy to hear that you enjoyed your room. I will be sure to share that with our housekeeping team. Our location is amazing. We are in the middle of it all. You can walk to Morton's Steakhouse, walk to the casino or walk to Quicken Loan Arena without even stepping outside. Also if you don't want to take a cab to the Airport you can take a $2.50 train from the airport that takes you right to the hotel. When you do want to step outside the newly renovated Public Square is right across the street. It is absolutely beautiful. ", "title": "Owner Response", "published_date": "2016-10-23T17:22:00-0400", "id": "431041941"}, "trip_type": "Business", "published_date": "2016-10-21T08:51:20-0400", "location_id": "95212", "id": "430339379", "user": {"username": "keenerDublin_Ireland", "user_location": {"name": "Dublin, Ireland", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Good location", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r430180079-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review430180079", "text": "This hotel is located in a building that was obviously a centerpiece of Cleveland during its heyday.  Although the building is older it is well kept and all the staff are very welcoming in enhancing your stay.  As I am here for the next four or five weeks Tim at the front desk was kind enough to upgrade me to a room that will make this stay a little more comfortable.  The location is central to the attractions in the core and is 20 minute walk to 25th street if you need a change of scenery.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "I can tell you that I was in amazement when I first walked into this hotel. It literally took my breath away. The details of the interior design is something that you don't see anymore. I will be sure to recognize Tim for personalizing your check-in experience. Let me know if I can assist you throughout your 5 weeks here. ", "title": "Owner Response", "published_date": "2016-10-23T18:01:40-0400", "id": "431047122"}, "trip_type": "Business", "published_date": "2016-10-20T19:26:31-0400", "location_id": "95212", "id": "430180079", "user": {"username": "MB2034", "user_location": {"name": "Toronto, Canada", "id": "155019"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Classic Old And In Need Of Updating", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r428849018-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review428849018", "text": "As my title states, this is a real classic (nearly a century old) style hotel. First of all, the people working here are TOP NOTCH FRIENDLY. Everyone from the top down was accommodating in every way. The public spaces are gorgeous and one can really feel the history oozing from every corner. Also outstanding is the food: room service/club level/upscale bar really excelled. The bad stuff - rooms in need of major updates (rumor is that $15 million is earmarked in 2017) and no place in house to get snacks or toiletries.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Customer service is the true foundation of any great hotel. Our staff have a true connection to this hotel and a sense of pride because they work at such a great historic building. It is true that we are in the design phase right now to draft what the first part of our remodel is going to look like. I am so please to report that we will be keeping the historic and classiness of the hotel intact. I know you are going to love our new look.   ", "title": "Owner Response", "published_date": "2016-10-24T09:35:06-0400", "id": "431253414"}, "trip_type": "Business", "published_date": "2016-10-17T12:08:26-0400", "location_id": "95212", "id": "428849018", "user": {"username": "dadaevan", "user_location": {"name": "Pittsburgh, Pennsylvania", "id": "53449"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "MAshley's wedding", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r428490118-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review428490118", "text": "Early 19th century opulence at its best. The rooms were spacious and clean. The staff went out of its way to be accommodating. \n\nThe hotel is situated right in the heart of downtown Cleveland.unfortunately for me just a bit too close to the Jake casino. \n\nI highly recommend this hotel. If you get a chance to visit and are interested in the local history seek out the head Bellman he knows everything about the property and it's surroundings and Cleveland as a whole. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "We have done a great job in ensuring that all of our staff are very knowledgeable of the local area and the history behind all of it. Whether you want to press your luck at Jack's casino, go shopping at Tower City or catch a CAVs game at Quicken Loans arena when staying at the Renaissance Cleveland you can do it all with out even stepping outside. We are attached to all of the above and hop, skip and jump to many more of Cleveland's great restaurants and historical sites. So happy to hear about your memorable experience. Look forward to servicing you again soon.", "title": "Owner Response", "published_date": "2016-10-24T09:40:31-0400", "id": "431255048"}, "trip_type": "Family", "published_date": "2016-10-16T11:03:54-0400", "location_id": "95212", "id": "428490118", "user": {"username": "Patrick S", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "A diamond in the rough", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r428024581-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review428024581", "text": "So say I was pleasantly surprised would be an understatement.  This was my first foray outside of an SPG brand.  And had the Westin not been booked,  I would not have stayed in my first of what will be many stays in the newly combined SPG/Marriott brand hotels.  \nCheck in was fast, easy, and Abe at the front desk was welcoming and genuinely appreciative for my patronage.   He was quick to point out that my status at SPG would be honored at the Renaissance and made me feel like an familiar guest.  The rooms were clean, and well appointed.  Although thin walls in this very old building made for noisy hallway chatter, and the lack of heat in the rooms was odd and a bit chilly,  I did sleep well and in comfort.   Again,  I can't say enough about the hotel front desk staff.  They were all you would expect and more in an upscale hotel..", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "WOW! Thank you for taking the time to share your stay with us. With SPG and Marriott merging the Renaissance Cleveland hopes to be apart of many more exceptional experiences. Abe is one of our bests and I will be happy to share your comments with him. I am so happy we had the opportunity to serve you. We all look forward to your next visit when your travels take to Cleveland again soon. ", "title": "Owner Response", "published_date": "2016-10-24T09:46:38-0400", "id": "431256821"}, "trip_type": "Business", "published_date": "2016-10-14T17:55:20-0400", "location_id": "95212", "id": "428024581", "user": {"username": "Check_Please123", "user_location": {"name": "New York City, New York", "id": "60763"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Gets the job done", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r427296325-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review427296325", "text": "No major complaints. Room was clean, staff was friendly. \nNice lobby/bar area and close to bars, restaurants, convention center and more.\nAdjacent to public transport stops, so lots of activity/people all the time.\nI'd stay again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Thanks for taking the time to share your experience. So glad to hear that you will be returning on your next visit to Cleveland. Our location is in the center of it all. The multi-million dollar renovated Pubic Square just a couple under hundred feet outside our build is just breathtaking. You will enjoy the view whether you are experiencing it  in the afternoon or at night. Their is plenty to do and all in walking distance when staying at the Renaissance Cleveland Hotel. Look forward to servicing you again soon. ", "title": "Owner Response", "published_date": "2016-10-14T14:21:59-0400", "id": "427999884"}, "trip_type": "Business", "published_date": "2016-10-12T09:32:58-0400", "location_id": "95212", "id": "427296325", "user": {"username": "writegirl7", "user_location": {"name": "Denver", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Nice location, friendly staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r426330117-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review426330117", "text": "My husband and I stayed at the Ren 1 night for an Indian's game.  We arrived a few hours before the game, valeted the car (which was great, text to get the car, no waiting to talk to someone on the phone, prompt service) and checked in with no issues.  The main lobby was old school grand, not my style but nice.  Tall ceilings, gold and dark wood accents.  As we headed upstairs to put our bag in the room the interior halls were clean, but somewhat dark.  It felt like we were going in a big circle to get to our room, and once we walked in, we understood why, our room overlooked an interior courtyard, not the city line.  The room had tall ceilings, a small sitting area and nice bath.  Very clean, perhaps a bit dated decor, but again, not my style of decor.  It was almost reminded me of being in a museum.  We headed off to grab dinner and to the baseball game a few blocks away, an easy 10-15 min walk.  There are many good dinning options, a lot around 4th St which is close to the ballpark and hotel.  After the win, we headed back to the hotel.  Walking back was a little scarier than the way there, a lot of people standing around smoking waiting for the bus.  The hotel is next to Tower City, which used to be a shopping mall (still might be, haven't been inside in years), a connection to Cleveland's public transportation (train) and has a walkway to the Cavs arena.  Back at the hotel we stopped at the bar and had a few drinks.  It was still busy at the large bar, and it was nice to sit back and people watch.  As we headed to the elevators, there was a family getting on the elevator the same time as us with 3 children, the youngest a baby in a stroller.  Seemed a little late for kids to be up at that time of night, but as I told myself to mind my own business, the elevator stopped and we all happened to exit and be on the same floor.  We followed the family around the hallways to our room, their room was adjacent to ours.  As my hubby and I walked in, we thought, great, we are not going to get any sleep as we heard the muffled baby cry next door through the wall.  But thankfully 10 mins later, until the time we left the next day, we didn't hear any noises from outside our room.  The bed was comfortable.  We left early in the am, texted for our car, checked out and our car was waiting for us.  Easy driving in Cleveland in the early am!  Enjoyable stay.  We would stay again if we were up for another Cleveland event and would recommend to anyone looking for a clean hotel while in the area.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "It sounds like you had a great experience with us here at the Renaissance Cleveland hotel. You got the chance to experience many of the things that make downtown Cleveland unique. When walking to Quicken Loans Arena the tunnel located in Tower City (connect to the hotel) is so convenient and can be a less disturbing walk than if you decided to walk outside. So happy to hear about your restful sleep. Look forward to servicing you again soon. ", "title": "Owner Response", "published_date": "2016-10-24T09:56:43-0400", "id": "431259787"}, "trip_type": "Couples", "published_date": "2016-10-09T04:48:16-0400", "location_id": "95212", "id": "426330117", "user": {"username": "Jill V", "user_location": {"name": "Ashland, Ohio", "id": "29938"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Pleasant Visit", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r425306125-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review425306125", "text": "I visited as part of the Sherwin Williams awards ceremony and wanted to make sure the wonderful gentleman out front, Jemal, received a proper thank you for the service he delivered. Too often in cities across the country you encounter staff that just go through the motions but, Jemal was wonderful, with a charming smile and just a pleasure to talk to. Kudos to him and the rest of his staff!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Thank you so much for recognizing Jamal. You can truly tell when you experience authentic hospitality. Jamal is able to do this everyday without any effort. He is a great manager and true role model for his team. I will be sure to share your comments with him. ", "title": "Owner Response", "published_date": "2016-10-24T09:58:26-0400", "id": "431260302"}, "trip_type": "Business", "published_date": "2016-10-05T07:14:06-0400", "location_id": "95212", "id": "425306125", "user": {"username": "jham30001", "user_location": {"name": "Cleveland, Ohio", "id": "50207"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Outstanding Staff & Service at Older Hotel ", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r424731666-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review424731666", "text": "In reading other posted reviews, I see the mention of property somewhat dated. This is overshadowed by a friendly & wonderful staff. Tony who has worked here for 18 years greeted us with a warm friendly smile & can do attitude. He delivered us two bottle waters during the quick check in. He was very sincere in assuring us he was here to help in any way needed = class act... Cordina I believe checked us in, very pleasant & engaging. Lobby area is large, classy, beautiful. We spent two hours just relaxing there taking in NFL games & wonderful city views. I will return to this Hotel, the staff earned my respect & loyalty. Well done!  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "We have such great staff here at the Renaissance Cleveland hotel. They are so passionate about the building and about ensuring that every guests that stays with us has a great stay. They will be thrilled to hear that their efforts created another great stay. Tony and Lordina are great role models of what authentic hospitality truly should look like everyday. I will be sure to pass along your comments to them. Have a great day.", "title": "Owner Response", "published_date": "2016-10-24T10:04:36-0400", "id": "431262030"}, "trip_type": "Family", "published_date": "2016-10-03T08:13:20-0400", "location_id": "95212", "id": "424731666", "user": {"username": "BuddyDumeyer", "user_location": {"name": "Louisville, KY", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Excellent Service, dependable rooms.  Nice location.", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r422618046-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review422618046", "text": "I've stayed here twice a few years apart and I noticed big improvements across the board.  The rooms are really nice sized and the HVAC system works a lot better.  Most importantly, I really appreciate the fact that house keeping sent materials I left behind. Thank you!\n\nFor parking, city lots are easy to access across the street. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "I truly appreciate you recognizing my teams efforts. My staff and I at the Renaissance Cleveland are always striving to move the needle and improve on our customer service. Our lost and found area gets tons of items left behind by our guests but it is our security team that takes ownership of this area to ensure the valuable get back to their proper place. We look forward to your return visit with us.  ", "title": "Owner Response", "published_date": "2016-10-24T10:32:27-0400", "id": "431270204"}, "trip_type": null, "published_date": "2016-09-26T13:48:30-0400", "location_id": "95212", "id": "422618046", "user": {"username": "G3858VZ", "user_location": {"name": "Chicago, Illinois", "id": "35805"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Will Not Stay Again", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r420820411-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review420820411", "text": "This hotel is way over rated and expensive.  I had a king room that was noisy and way too cold with no way to make it comfortable.  My room overlooked the atrium that had a pool and workout area.  The room was extremely cold when I entered.  It had a wall unit for cooling with 3 selections (manual, auto, off) and no heating unit.  There was a sign that instructed you to open the window so the air from the atrium could heat the room.  That was a joke.  It took a couple of hours for the room to get comfortable; however, it cooled down during the night with no heating unit.  Not only that, but it sounded like dumpsters were being dropped whenever someone was using the weights in the exercise room.  This went on until the early morning hours.   There was mold in the tub area.  I had free Wi-Fi; however, unless you're a Marriott Rewards member, there is a charge for Wi-Fi.  No fridge or microwave. This was my last time staying here. I'll stay at the Hilton Garden Inn or Holiday Inn Express next time. I've stayed at both places, and they are much more comfortable than this one.  It is way over priced for the quality. The one good point is that it is close to restaurants downtown.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Dear ronilynn277, Thank you for your posting and for staying with us.  We can certainly understand how the temperature of your room and the noise from the atrium would have been disappointing.  Please accept our apologies.  Our staff is always available to address shortcomings.  Our hotel does have a wonderful restaurant, lobby bar and In Room Dining available and is in a fantastic location close to many restaurants and all the sports venues. We do hope you reconsider.  We would love the opportunity to regain your confidence. Sincerely, Ed S., Hotel Manager", "title": "Owner Response", "published_date": "2016-09-22T07:11:16-0400", "id": "421181750"}, "trip_type": "Business", "published_date": "2016-09-21T06:00:11-0400", "location_id": "95212", "id": "420820411", "user": {"username": "ronilynn777", "user_location": {"name": "Chattanooga, Tennessee", "id": "54946"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Wasn't impressed", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r420677636-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review420677636", "text": "The hotel is old.  The lobby is beautiful with lots of marble and character.  But, the rooms are outdated.  My room on the 10th floor had an unpleasant funky odor- mildew, a little like cigarettes?.  The air conditioning was freezing and there was nothing I seemed to do to alter the temp.  It was also very loud.  The pipes hummed whenever I turned the water on.  The 'health club' was very very small with worn out equipment.  The staff was inconsistently helpful and polite.  After checking in I waited in line for 10 minutes while the reception staff seemingly chatted with the same customer. right outside the door were many local folks who appeared to camp out during the day (and maybe at night? I didn't go out) asking for money.   I don't have any major complaints but I wouldn't stay here again.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Dear Lidco6, We appreciate your business and that you took the time to share your experience.  The hotel will be celebrating our 100 year anniversary in 2018!  The lobby is breathtaking and quite grand.  We are disappointed that you did feel the same in your guest room. We strive to make each room clean and comfortable and apologize that this was not your experience.  Your feedback has been shared appropriately.  We do hope you reconsider.  We would love to have you again as our guest and to provide you with the outstanding experience you expect. Sincerely, Ed S., Hotel Manager", "title": "Owner Response", "published_date": "2016-09-22T06:41:39-0400", "id": "421172851"}, "trip_type": "Business", "published_date": "2016-09-20T16:16:31-0400", "location_id": "95212", "id": "420677636", "user": {"username": "Lidco6", "user_location": {"name": "Berwick, ME", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Could use some TLC but overall ok", "url": "https://www.tripadvisor.com/ShowUserReviews-g50207-d95212-r420308778-m11068-Renaissance_Cleveland_Hotel-Cleveland_Ohio.html#review420308778", "text": "Stayed here for work last week.   Great location but the hotel needs some TLC which I hear is coming.  The downstairs is elegant and very old world but the room floors are very outdated and in need of renovation.  My room on the 10th floor was extremely quiet but the old HVAC made it a bit musty and there was not a lot of natural light.  The staff at the hotel was very friendly especially those at the bar.  Only one bad encounter with a doorman who was a bit short when I needed directions.  He didn't seem to grasp that as a visitor I had not idea where I was in relation to other locations in the area.  Missed having a little store in the hotel to pick up some food as there is nothing very close by to grab a snack.  Overall it is not up to the normal Renaissance standards but for a business trip is does the trick.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "Ed_Sylcox, General Manager at Renaissance Cleveland Hotel, responded to this review", "text": "Dear CRS444, We do have a great location and our staff is incredibly friendly!  Thank you for recognizing them.  Your feedback has been shared and is much appreciated.  We want to be the hotel you cannot wait to return to and will continue to work towards that goal!  It was our pleasure to have you as our guest and we look forward to exceeding your expectations on your next visit.  Sincerely, Ed S., Hotel Manager", "title": "Owner Response", "published_date": "2016-09-20T11:32:21-0400", "id": "420612361"}, "trip_type": "Business", "published_date": "2016-09-19T13:32:11-0400", "location_id": "95212", "id": "420308778", "user": {"username": "CRS444", "user_location": {"name": null, "id": null}}}]}