{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Excellent Food and Drinks", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r432790038-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review432790038", "text": "We visit this location often. The food is always outstanding and the drinks are amazing. The appetizer platter is always a win. Nachos tonight were some of the best we've had. Free dessert on the house, that's wouldn't have made a difference with our review. We will continue to come here. The patio seating is excellent. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-29T17:08:59-0400", "location_id": "4766002", "id": "432790038", "user": {"username": "Alicia S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Good Food and Music Videos from the 80's", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r415183284-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review415183284", "text": "Our family likes this place because of the excellent hamburgers.  I recently had the Cajun burger which is very good.  It comes with many choices of sides, I chose the spinach.  I also tried my co-diners cheese pizza, which was also very good, and another diners fries dipped in the marshmallow sauce.  At the end of our meal, we were brought a complimentary giant cotton candy, which the three teen aged kids couldn't finish.  We sat outside next to the fire, which I recommend because they have a pot of cinnamon sticks in water which smells good.  The check was just under $80 before tip for 2 parents and 3 teens.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-09-05T20:51:43-0400", "location_id": "4766002", "id": "415183284", "user": {"username": "Dennis K", "user_location": {"name": "Mission Viejo, California", "id": "32722"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Fun dining at The Triangle", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r412754718-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review412754718", "text": "My friend and I had a late lunch on a Sunday.  They have bottomless mimosas and bloody Mary's.  The problem with that is it took way too long to order and actually receive a drink or a refill.  By the time you have finished your meal, you've only had one or two drinks.  And, we could see the bartender make the mimosas with very little sparkling wine in the glass.  The whole experience of Saddle Ranch is fun but service is slow.  Our waiter was very nice but we could not find him when we needed something.  I recommend sitting outside as it's dark inside.  I've never been at night but I hear it's a bit crazy.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-30T08:07:05-0400", "location_id": "4766002", "id": "412754718", "user": {"username": "Bunny0016", "user_location": {"name": "Orange County, California", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Great Bloody Marys ", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r403566444-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review403566444", "text": "Went for brunch on a Saturday. The service was great. Loved the bottomless Bloody Mary. The fallen angel Bloody Mary is nice and spicy. The servings are pretty large. I enjoyed the breakfast burrito. My wife enjoyed her steak sandwich.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-10T04:58:07-0400", "location_id": "4766002", "id": "403566444", "user": {"username": "MervinS10", "user_location": {"name": "Pune, India", "id": "297654"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Chris DeFiore WORST manager ever!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r396954383-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review396954383", "text": "To whom it may concern: \nI am writing to inform you of the lack of customer service and professionalism that I received from Chris DeFiore the General Manager at Saddle Ranch Chop House, Costa Mesa. On Sunday, June 19th. My family and I, decided to have Father’s Day dinner at Saddle Ranch Chop House in Costa Mesa. This was my first father’s day, so we were pretty excited. I made a reservation, but we had to wait about 10 minutes (which was not bad). We were told by a hostess, that the reason why we had to wait was because there was not enough servers that day. Everything was going fine, we could see that our waiter (Matt Donahue) was running around doing the best he could. There was a “Manager in training” in a light blue shirt just walking around mostly. We asked the “manager in training” to get a few items which he did, but he never asked if we needed anything else. Our family was waiting for our check for approximately 20 minutes, finally when we got our check they took off some drinks because we were waiting so long. The new total bill was $201.00\nThe issue came when we tried to pay, we waited around for 10-15 minutes when we decided to try and pay at the bar. The bartender said he could not take my payment and that we needed to go to the hostess. The hostess gave the payment to the “Manager in training”, we explained to him that we wanted to pay $46.00 in cash, $100.00 to be put on our credit card and the rest to be put on our sister’s credit card. The “manager in training”, goes and hunts down our server Matt, who was in the bar area grabbing 2 drinks to take to a different table. Mind you, our server is serving several tables and serving drinks. We waited by the bar and asked the “Manager in training” if we should go wait at the table, he replied “yes”. \nMatt comes back with 2 receipts slips, 1 for $100.00 and the other for $101.00. What happened to the $46.00 cash? My family and I go back to the “Manager in training” and he says I remember you giving me cash, let me go get the server. Matt comes back and says “oh yes, you gave me cash, how much was it?” All of sudden the General Manager Chris DeFiore comes out and doesn’t say much or even apologize for any of what’s happened so far after explain the entire situation to him. At this point we are bothered because no one is helping the server out to assist us, everyone is just standing around and no one is apologizing for the inconvenience. We can’t believe that the managers are not assisting the server. Instead of trying to solve it themselves, they pull him away from what he is doing so that he can fix the problem. My family and I asked for their corporate number. \nMr. DeFiore says “it’s on my card, the 949-287-4652 and press 0”. I said no, I want corporates number, I don’t want the number to this location, I am asking for Corporates. Number. Mr. DeFiore repeats himself with the same answer over and over. I called on my cell phone and sure enough it’s not corporates Number, but instead the number for that specific location. Mr. DeFiore takes out his own cell phone and calls the phone number then proceeds to walk to the back towards the employee’s area. At this point, we now have 4 other employee’s looking for corporate’s number. I mentioned that it would be the same location that they would contact HR, an employee says I don’t know that number and walked away. \nFinally the general manager reappears and says “so what is that you guys want” we told him that we just want the cash back so that they don’t mess up the transaction any further. After Matt gives us the cash back we inform Mr. DeFiore that we cannot believe the lack of professionalism that he has shown and overall customer service from everyone that day. Mr. Defiore then replied “I think you guys are being irate and I am going to have to ask you to leave”. There was no reason for us to be irate over trying to get our missing cash and Corporates number. My family and my 9 month old baby was with us, so there would be no reason to allow anyone to get us irate. I was really taken back and offended by what the general manager commented to my family and I. We assured him that we were not irate and that we were just wanting corporates number. Finally, the General Manager was able to give us Corporates number and so did 2 other employees one of which who was our server Matt who googled it for us on his own phone.  I have never been in a situation like this, it totally ruined our night and made us feel like we were being mistreated by Mr. Defiore who personally attacked us by calling us irate and threatening to kick us out. \nWe walked out to greet the rest of our family and again and the server Matt came out to apologize. He freely gave us his name and said he was overwhelmed, with all the tables and no help. We told him that we understood that he was doing the best he could and the manager should have stepped up and helped him with his tables. \nI was really upset and disappointed that our father’s day ended that way. What’s worse, is that as I mentioned earlier that it was my family’s first ever. \n\nMr. Chris DeFiore  should remember, he is a reflection of all Saddle Ranch locations. He needs to learn to be courteous, respectful and sincere. Mr. Chris DeFiore should have apologized for not having enough staff and given the Corporate Number right away, my family and I should not have been put through all that. It was completely unnecessary and uncalled for being treated that way. \n\nAn update to this since I filed a complaint with the BBB, the business is stating that they offered us a $100 gift card which was not true. The fact that they think that a gift card would solve this issue, without even an apology shows the lack of professionalism from the company as well.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-25T14:43:28-0400", "location_id": "4766002", "id": "396954383", "user": {"username": "WALTER_M77", "user_location": {"name": "Orange County, California", "id": "659482"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "The Portions R Huge", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r394844550-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review394844550", "text": "We decided to stop at this restaurant after seeing it on the streets..Great choice. The food was excellent and they gave you such huge quantities. I had the 2  Chicken Tacos and I could only eat 1.  It came with chips and guacamole, chipotle and sour cream.  My husband had the light portion of choped BBQ Chicken Salad. The bowl was like a huge mixing bowl.  The menu covers everything; chicken steaks, seafood, ribs, salads, burger, etc.. The prices were good too, mine was $8 and my husbands was $10; and it was right across from another restaurant that had live music that you could listen to with no extra charge...lol  Breakfast, Lunch and Dinner.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-20T13:23:25-0400", "location_id": "4766002", "id": "394844550", "user": {"username": "scarp62", "user_location": {"name": "Menifee, California", "id": "32703"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Excellent Lunch Place!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r392136724-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review392136724", "text": "Everyone (4) at our table enjoyed there lunch choice.  I had the fish tacos.  Very tasty and would order again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-13T08:50:38-0400", "location_id": "4766002", "id": "392136724", "user": {"username": "MrBigWave", "user_location": {"name": "Albuquerque, New Mexico", "id": "60933"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Awesome! Great atmosphere & food", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r371646038-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review371646038", "text": "Had brunch with my daughter.  I had delicious French Toast that was beautifully presented.  The mimosas were incredible! Our server was so polite and friendly.  I can't wait to return when I fly back to California", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-09T20:54:17-0400", "location_id": "4766002", "id": "371646038", "user": {"username": "bluegoldstar", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-04", "title": "not good ", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r367476132-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review367476132", "text": "I have had fun at this place once before..  So we decided to come back.\n\nit was a cold slow night.. Service was poor,  food was terrible.\n\nhad to beg for extra crappy napkins for the ribs...\n\nCaesar dressing was pure mustard...super tangy something was wrong.\n\nMac n cheese... also was horrible..pasta was poorly prepped,  cheese sauce was poorly prepped, and it was poorly assembled.\n\nFish tacos...I forgot to ask what kind of fish...the trimmings of salmon buried in greens.. all stinky...\n\nSteak tacos were the replacement.. could barely eat them... literally reminded me of packet taco seasoning .\n\nthe guacamole app.. almost never showed.  but then did, half way through the entrees...we didn't finish it...\n\nso...the slow restaurant had inexperienced servers training new servers, bad food and no manager presence. \n   Nobody is doing a line check..( if they are then they are incompetent ).\n\nsorry not sorry\n\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-25T12:02:04-0400", "location_id": "4766002", "id": "367476132", "user": {"username": "cola1979", "user_location": {"name": "Sonoma County, California", "id": "1109451"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-04", "title": "Go for the cotton candy and bull riding.", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r364684848-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review364684848", "text": "Restaurant is located at Triangle Square. It has both inside and outdoor seating. While everyone is friendly and thanks us both coming in and going out I think this will be my one and only visit. The nacho platter was large as a matter of fact all of the servings were large but for my teeny piece of salmon. Everything that was served was overcooked, Our server was friendly but as the evening progressed she was AWOL and we had to ask that she be hailed so she could bring items we had asked for but never delivered. Water was never replenished unless asked to be. When I was asked how the salmon was and in indicated so so there was no response. The restaurant is really more a bar scene and if that is what you enjoy might be the place for you. For my taste food at best is average. Cotten Candy was great.\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-04-16T13:34:20-0400", "location_id": "4766002", "id": "364684848", "user": {"username": "Byron R", "user_location": {"name": "Laguna Beach, California", "id": "32588"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Tasty dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r358515407-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review358515407", "text": "Tasty food. Watch out as the portion size is very big.  Lots of choice with plenty on the menu. You can dine inside or outside. The waitress seemed to be under pressure dealing with all the customers on her own she definitely needed more help!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-25T11:59:20-0400", "location_id": "4766002", "id": "358515407", "user": {"username": "yleejansaudek", "user_location": {"name": "Cork, Ireland", "id": "186600"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-05", "title": "Silly", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r356354318-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review356354318", "text": "This place markets itself as a \"Western\" style restaurant, complete with mannequins standing outside on an upstairs balcony.  It's hoakey.  The food is edible but expensive.  Don't bother.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-03-17T10:01:16-0400", "location_id": "4766002", "id": "356354318", "user": {"username": "FineDinerPatty", "user_location": {"name": "Costa Mesa, California", "id": "32253"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-03", "title": "Fun with mediocre  food", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r353447654-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review353447654", "text": "Special shout out to our server Steven. You made our night delightful.  From start to  finish awesome  service.  We had ribs which were forgettable.  Sides  were sweet potatoes fries,  regular  fries, rice, sautéed  spinach,  mixed  vegetables and mashed potatoes . KFC has tastier  sides. Soda was bottomless.  Ordered  the rum punch which  tasted like  juice heavy on the syrup. The punch was certainly  lacking. The smores  was fun though. Kids get to do it on the patio  with fire pit. Since  it was my  birthday, I got a free 3 feet cotton candy. The star of the venue is the mechanical bull. We didn't get to ride it. Got  too lazy to read the long waiver form. Pretty much the same review  I would give the one  on Citywalk.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-03-06T16:36:38-0500", "location_id": "4766002", "id": "353447654", "user": {"username": "Maria2628", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-02", "title": "Birthday celebration", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r347495700-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review347495700", "text": "We came here to celebrate a birthday. I had reservations and we were seated right away.  We ordered the steak sandwich with fries, truffle Mac and cheese, grilled salmon with jasmine rice and vegetables, grilled chicken with sweet potatoes and veges. The steak sandwich was okay and fries were not good. The salmon and grilled chicken was good. The sweet potato fries comes with a marshmallow sauce and it was delicious. The truffle Mac and cheese was good too. For desert we shared the cotton candy tower and got it comped for the birthday boy. Overall the service was okay, food was good, and I like the ambience. They need to do better with bussing the tables though. We sat there for a while with empty and dirty dishes on our table.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-02-13T20:09:02-0500", "location_id": "4766002", "id": "347495700", "user": {"username": "Cheyenne P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-09", "title": "Lovely SoCal Setting", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r335570437-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review335570437", "text": "We had a really good evening here on our last night in Costa Mesa. The outdoor seating was great on a lovely evening and the food was good. The service was really good - the manager stopped by to find out how things were going and had a chat while we were waiting. Very enjoyable.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-12-28T17:08:50-0500", "location_id": "4766002", "id": "335570437", "user": {"username": "otbc_oz", "user_location": {"name": "Melbourne, Australia", "id": "255100"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-10", "title": "Good Food, Poor Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r324475881-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review324475881", "text": "First time at this restaurant. Visited on Halloween night, so I believe the staff was probably not their \"A-team\", While waiting for the rest of our group to arrive, ordered drinks. Took 15 minutes for drinks to arrive...via being clutched closely to the chest of the server (no tray). One of the drinks was a martini that I'm sure part of ended up on the server's top. My margarita was very average, the Mai Tai looks good. Next we were seated with our group. Ordered wine, chardonnay and pinot grigio, two glasses of red wine showed up, being brought by a gentleman identifying himself as some level of manager. Ordered food, two individuals ordered lettuce-wrapped burgers because of gluten intolerance allergies. The server read back the entire order correctly. As the server began to deliver the food, she recognized that she failed to get the burgers made without buns. We accepted the food and removed the bread. All meals were tasty and plentiful. My wife asked one of the servers for a refill on the water, but was never refilled. My wife later asked our primary server for a refill on her water, and the server took the glass but never retruned with it. We finally asked another individual who identified them self as one of the managers, and he quickly brought a full glass of water. We understand it was early in the evening, and attention my have been towards the upcoming excitement of Halloween night on a Saturday night, but there were some service questions I would have loved to ask the management team (like where were the trays).", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-11-04T10:06:31-0500", "location_id": "4766002", "id": "324475881", "user": {"username": "bimmerdude", "user_location": {"name": "Los Alamitos, California", "id": "32651"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-09", "title": "Good atmosphere, mediocre food, good service", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r311321686-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review311321686", "text": "My ladyfriend and I were looking for dinner the night before flying home. We happened upon the center where this restaurant is located, on Harbor Drive in Costa Mesa. Our service started slow but picked up and finished well. Our server was busy as the dickens but coped well, and ended up taking good care of us. Drinks were good, food was okay. Did not order the restaurant's special, which I think is steak. I ate a salad and it was just fine. Loved the outdoor seating. On a nice evening in SoCal, it was great.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-09-17T08:40:37-0400", "location_id": "4766002", "id": "311321686", "user": {"username": "CSamSmith", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-07", "title": "Birthday dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r286460078-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review286460078", "text": "Food was good service was very slow.  Desserts were great but again very slow to get it to the table.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-07-07T11:28:13-0400", "location_id": "4766002", "id": "286460078", "user": {"username": "50thbirthday4", "user_location": {"name": "Huntington Beach, California", "id": "32513"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-05", "title": "Mechanical bull + Alcohol = Tons of fun", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r280527593-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review280527593", "text": "Great spot to chill with friends or go on a date with good food and even better drinks.\n\nIt has a wheel of fortune, tons of TV's all over the place (great for seeing sports), a punching arcade game and a mechanical bull.\n\nThe portions are huge, the bread is probably the best I've ever had, bottom less mimosas for $12, and a good happy hour.\n\nThis location, the one in Orange California \"Outlets of Orange\" and the one in New Port Beach \"Triangle Square\" are all good.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-06-15T21:07:13-0400", "location_id": "4766002", "id": "280527593", "user": {"username": "HotelRinconTarasco", "user_location": {"name": "Morelia, Mexico", "id": "152771"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-02", "title": "Fun place to visit with outdoor/indoor bar.", "url": "https://www.tripadvisor.com/ShowUserReviews-g32253-d4766002-r278473611-m11068-Saddle_Ranch_Chop_House-Costa_Mesa_California.html#review278473611", "text": "Very large array of different drinks and fun place to go, but everything was a bit pricey. We settled for hamburgers, which were tasty. \nI would stop here again just for drinks, if I were in the area.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-06-07T05:56:52-0400", "location_id": "4766002", "id": "278473611", "user": {"username": "Teri M", "user_location": {"name": "New Hampshire", "id": "28950"}}}]}