{"paging": {"total_results": "8", "skipped": "0", "previous": null, "results": "8", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Dallas Public Library is a treasure!", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r398439397-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review398439397", "text": "As a librarian from New England visiting Dallas this summer, I am amazed by the offerings of Dallas's central library.  Each of the eight floors is well curated, with current related books displays and even museum quality artifacts relating to the subject.  Best genealogy collection I have seen in a public library.  Frank Lloyd Wright music stand.  So much more I could say, don't want to spoil the fun of self-discovery.  Staff is knowledgeable and friendly.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-07-28T07:46:08-0400", "location_id": "559930", "id": "398439397", "user": {"username": "Biblio57", "user_location": {"name": "Nashua, New Hampshire", "id": "46172"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-03", "title": "Genealogy Collection of the Dallas Public Library Worth a Visit", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r311562366-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review311562366", "text": "The public library is easily accessed by public transportation and visiting genealogists will want to reserve several hours for a research visit. Volunteers from the Dallas Genealogical Society are often on hand to help library staff answer questions about the collection. The collection (covering Texas, the USA, Ireland, England, Germany, and others) includes books, microfilm, and some manuscripts (check the old style card catalog for the manuscript collection). As with most large libraries, take time to do your pre-search in the on-line catalog so you can make the most of your visit.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2015-09-18T07:18:03-0400", "location_id": "559930", "id": "311562366", "user": {"username": "Mountain_History_Mom", "user_location": {"name": "Durango, Colorado", "id": "33397"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-04", "title": "DISAPPOINTING - NO DECLARATION OF INDEPENDENCE", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r268201418-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review268201418", "text": "As a visitor to Dallas, I would say my experience was VERY disappointing! The library's 7th floor is undergoing renovations, so the much touted Declaration of Independence WAS NOT on display. When making our itinerary of \"must see\" while in Dallas, for our family this document was # 1 on the list. We were all very disappointed when we discovered that several 7th floor items were supposedly on display on the 1st floor, not the Declaration of Independence or 1st Edition Shakespeare works. We walked 1/2-mile in a thunderstorm only to be disappointed. The library is fortunate to have this very historic document, which should always be on display for the public to enjoy.\n\nRecommendation: visit the library after it has been open for 1+ hours, there are 30+ transient/homeless lined up in front of the library, many of whom are smoking, and once the doors open there is a flood of them in the restrooms, etc. As a public building everyone is treated equally, another reason for the Declaration of Independence to be on display.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-04-26T19:38:34-0400", "location_id": "559930", "id": "268201418", "user": {"username": "Kimmey C", "user_location": {"name": "California", "id": "28926"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-02", "title": "Don't skip the Dallas Public Library", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r252821570-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review252821570", "text": "I am a Dallas native, and a big fan of our Dallas Library. It's easy to request books and CD's online, and check them out at your local branch with your library card. Sometimes there is a wait for delivery, but it is worth it, as these resources are free. \n\nIf you need Texas historical research, these librarians are top noch for assisting on any project. \n\nAs a Texas Realtor, and a member of preservation Dallas, a lover of architecture, I have found some amazing finds behind the desk, from newspaper clippings sorted by neighbohood, to searching the Sandborne footprint insurance maps on microfische. \n\nWhen you have time for a quick lesson, ask about our extense list of global data bases, media sources, and legal sources like Lexus Nexus, for deep and wide academic research. \n\nThe staff is incredibly smart and helpful.\n\nThe music department has an bunch of adorable and friendly listening kiosks, loaded with 8-track, reel-to-reel, cassette, and sterophonic record players!  \nThe 33 1/3 records and most media cannot be checked out, so plan to spend time here. \n\nRegarding new additions, we always get new-release films, on DVD and Blue ray.\nFiction and non-fiction include the top 10 New York Times Best Sellers, and more.  And, regarding older books, we have unlimited access to almost any author, thanks to WebCAT, that allows you interlibary loan services. \n\nWe have some great book sale events, and the meeting rooms are nice for groups. \n\nThanks to the public fund, the City of Dallas, come see the Ferguson and Casa View Branch to experience ome newly built modern, LEEDS certified library branches now. And, a nice remodel would be in order for all of our older locations; please donate to our libraries today. \n\nPlease become a friend of the Dallas Library. This place is priceless.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2015-02-05T15:42:56-0500", "location_id": "559930", "id": "252821570", "user": {"username": "ElaineCopeland", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 2, "travel_date": "2013-12", "title": "What a shame.", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r197862921-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review197862921", "text": "This library could be such a wonderful place. I should say it used to a wonderful place my daughter has fond memories here of many school projects and papers . However, now its just dangerous.  They have allowed the homeless situation to take over this place. Its dangerous walking up to the front and even worse in the parking garage.  I was even made to feel very uncomfortable in the elevators.  Its like there is no security at all.  They allow the homeless to come in and surf for porn and accost people legitimatly in there trying to enjoy what their hard earned tax dollars have put there.  I am just ashamed if out of towners come there and see this. Not to mention them practically bathing across the street at city hall.  Sad and shameful.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-03-18T10:16:37-0400", "location_id": "559930", "id": "197862921", "user": {"username": "rherb27", "user_location": {"name": "dallas", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "This is a government and patent file depository library.", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r139110005-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review139110005", "text": "We are so lucky to have this excellent library right downtown close to public transportation, near a few good restaurants if you need a break and extensive section of loanable A/V items to save you the money of purchasing same.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2012-09-01T16:53:48-0400", "location_id": "559930", "id": "139110005", "user": {"username": "Judith S", "user_location": {"name": "Terrell, Texas, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2012-07", "title": "Genealogy Dept was extensive", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r134746515-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review134746515", "text": "The genealogy department staff were very helpful in getting me started - pointed me in the right directions for the information I needed, and also gave me plenty of help with the equipment.  The Wi-Fi connection was easy to connect to, and was very fast. The parking garage was convenient and safe - there was a guard on duty the whole time, and both times I went, I was able to park a mere 30 feet away from the elevator, which took me directly to the floor I needed.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2012-07-18T10:01:16-0400", "location_id": "559930", "id": "134746515", "user": {"username": "Byrd11", "user_location": {"name": "Sacramento, California", "id": "32999"}}}, {"lang": "en", "rating": 5, "travel_date": "2012-06", "title": "Our son read us the Declaration of Independence", "url": "https://www.tripadvisor.com/ShowUserReviews-g55711-d559930-r132723001-m11068-J_Erik_Jonsson_Central_Public_Library-Dallas_Texas.html#review132723001", "text": "At this library location, in the West End district, there is an actual print copy of the Declaration of Independence from 1776.  It is located on the 7th floor of this library.  It was exciting to see this piece of history and our son read it to us, having to decipher all the misspellings (the f's at the printers must have looked like an s to the printer when looking at the blocks backwards).  This was quite an unexpected treat and cost us only the 75 cents we paid for parking.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2012-06-25T05:32:09-0400", "location_id": "559930", "id": "132723001", "user": {"username": "Juliann P", "user_location": {"name": "Overland Park, Kansas", "id": "38969"}}}]}