{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Good Shop, but Limited", "url": "https://www.tripadvisor.com/ShowUserReviews-g46403-d5965617-r418531342-m11068-Animal_Kingdom-East_Orange_New_Jersey.html#review418531342", "text": "This is a good pet shop (not a restaurant). I keep a freshwater aquarium.   I have patronized this store, albeit not exclusively, since the mid 1990s.  The fish inventory is always healthy. The staff is usually able to advise customers on the best care for the various species.  They carry  a decent variety, more than one would expect in a small shop like this one.  They are neat and clean and well-organized.  They sell self-packaged fish food at a good price, but their national label fish food is competitively priced.  Sometimes their prices are better than their big chain competitors.  You will generally have a good experience there.\n\nThe \"cons\" are the consistency of their variety and their abbreviated hours.  Sometimes the variety is not as robust as at other times. They open late and close early.  They close earlier on Saturday.  Needless to say, someone working regular or slightly later business hours will not have access.  \n\nThey also have a large variety of food and supplies for reptiles, birds and mammals, both live and pelleted.  They border dogs and have a few birds, small mammals and reptiles for sale.\n\nI like to support the local \"mom & pop\" that gives good service and products.  You get this at Animal Kingdom.  My only real drawback is the limited hours.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-09-14T10:32:49-0400", "location_id": "5965617", "id": "418531342", "user": {"username": "Leon D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "the best place to get your dog groomed", "url": "https://www.tripadvisor.com/ShowUserReviews-g46403-d5965617-r301179048-m11068-Animal_Kingdom-East_Orange_New_Jersey.html#review301179048", "text": "I am a first time dog owner and I have been taking my dog to Animal Kingdom since he was born.  This establishment does a wonderful job grooming the pets.  I have tried many groomers only to have to come back to this one.  They are by far the best!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-19T10:31:45-0400", "location_id": "5965617", "id": "301179048", "user": {"username": "Valb2333", "user_location": {"name": "East Orange, New Jersey", "id": "46403"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "It may be small - but its what you need", "url": "https://www.tripadvisor.com/ShowUserReviews-g46403-d5965617-r289627890-m11068-Animal_Kingdom-East_Orange_New_Jersey.html#review289627890", "text": "I have been an on and off customer of Animal Kingdom for over 20 years and 5 animals.  Unlike some other locations both your pet and YOU are treated with respect and understanding.  I have not purchased any pets from them - but have never heard of any problems either. They are clearly not a puppy mill and care about all of their pets.  I have utilized their grooming services for 20 years and YET to have a complaint (and I do not keep show dogs - though I am so very proud of them AFTER they are serviced - lol).", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2015-07-16T13:24:40-0400", "location_id": "5965617", "id": "289627890", "user": {"username": "NewarkScubaDiver", "user_location": {"name": "Newark, New Jersey", "id": null}}}]}