{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2015-06", "title": "Once was enough for me", "url": "https://www.tripadvisor.com/ShowUserReviews-g32358-d7972140-r285931422-m11068-La_Taqueria_Jalisco-Escondido_California.html#review285931422", "text": "hmmm,  run of the mill, sticky table that had a short leg so it was tipping the drinks.  The meat was dry and over cooked. Super loud TV's, with an added loud music.  We could not hear each other accross the table to talk.  Did not enjoy it.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-07-05T19:17:29-0400", "location_id": "7972140", "id": "285931422", "user": {"username": "flyawaySanDiego", "user_location": {"name": "san diego", "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-04", "title": "Cannot Recommend This Place", "url": "https://www.tripadvisor.com/ShowUserReviews-g32358-d7972140-r266510206-m11068-La_Taqueria_Jalisco-Escondido_California.html#review266510206", "text": "This is a relative newcomer to the crowded Mexican eatery scene in Escondido, CA. My wife (Mexican) and I went for lunch. They were playing very loud \"ranchero\" music as we entered and the place did not have the aircon turned on. We should have left there and then but we instead selected a table on the small patio outside (three tables). The table was dirty as were the menus. We were served by a woman who probably tried her best, but... The beers came poorly chilled and she didn't even offer drinking glasses, let alone chilled glasses. The Corona was served without a lime. The salsa bar was small, near empty, and they had run out of serving bowls so we were offered Styrofoam cups instead. Then the owners kids arrived accompanied by an unidentified adult. They kicked off their sneakers and started to play loudly on the little patio as if it was their home. She tried to correct them but to no avail. The situation was only corrected when their dad and apparent owner of the place arrived. He apologized and said we had selected the worst table (not that the waitress made any attempt to tell us or clean the table). He also apologized for the loud music, which was turned off. He said everything will be better \"next time\". \n\nThe food was OK and prices are pretty low but there are at least 5 better Mexican restaurants within walking distance from this one. With so much competition among Mexican restaurants in Escondido, this place needs to raise its level of ambition, service attitude and attention to detail (incl. cleanliness) if it wants to survive. Sorry to be so negative - as readers of my reviews know I mainly write positive reviews but this time I feel that I need to express caution. Definitely not a place if you expect higher Mexican cuisine and personal service. Hopefully they will raise the bar on their own performance - necessary to survive in the crowded Escondido restaurant market for Mexican food.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-04-18T17:57:24-0400", "location_id": "7972140", "id": "266510206", "user": {"username": "TraderBo", "user_location": {"name": "San Diego, California", "id": "60750"}}}]}