{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Best Food and Service since moving to Arkansas!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r435019981-m11068-Vetro_1925-Fayetteville_Arkansas.html#review435019981", "text": "We moved to Arkansas almost 2 years ago to Little Rock.  While we have enjoyed some good meals in our town I believe we found the Creme de la Creme of food and service here in Fayetteville on our first trip here for a Hogs game.  First off I thank Trip Advisor for allowing individuals to freely post reviews.  I have been posting and gaining knowledge from your resource for many years. It has helped my husband and I enjoy the best when traveling.  This trip is the same.  The reviews of this restaurant were spot on. This fine dining Italian restaurant is casual,  funky and extremely divine in its flair for tasty food. 4 of us had the pleasure of having Tammy serve us.  She was clear about how busy the restaurant was and some changes had been made since some items had been depleted due to the crowds from the game.  The chef had clearly made some wonderful changes and additions even with the crowds!  I started with a Banana Foster martini that Tammy recommended.  No doubt, hands down the best specialty martini I have ever had.  The antipasta plate we shared was wonderful. I ordered the bacon wrapped scallops  and my husband the veal chops, Everything was truly yummy and divine.  Fresh from local or fresh flown in.  This chef has exquisite taste in food selection and combining.  Our friend enjoyed their scallops and filets as well and stated their food was just wonderful.\n\nService here is fast and incredible!   All to Tammy's expertise of the menu and willingness to accommodate the customer, no question was out of her reach.  She knows this menu, restaurant, it's chef and manager well enough to make your time here a true food experience.\n\nThe manager shared some information with me when I told him I write a lot of reviews for Trip Advisor.  He explained they had had a call from someone with Trip Advisor a while back stating they believed someone was writing false reviews to pump up their ratings.  They stated they were going to drop their ratings status because of this.  I can only say that if this happened I am truly sad.  No doubt people taking the time to write a review is time consuming.  To write a truthful review and a valid review to help others is what this is all about.  Let the numbers of visitors be your quite and what the reviews state about the place.  This is surely a restaurant you want to take in while in the area.  It really is #1 in my book in Arkansas!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-06T02:52:37-0500", "location_id": "2436132", "id": "435019981", "user": {"username": "candi A", "user_location": {"name": "Little Rock, Arkansas", "id": "60766"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-11", "title": "So so", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r434923250-m11068-Vetro_1925-Fayetteville_Arkansas.html#review434923250", "text": "The bread was divine. The steak was good but the pork chop (I asked for well done) I had to send back and it still did not come out well done.  The pork chop had a very sweet flavor and I didn't like it. The sweet potato gnocchi was gross, sweet and tasted like cinnamon. Chocolate creme brûlée tasted like oranges and no one at the table liked it.   ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-11-05T16:00:01-0400", "location_id": "2436132", "id": "434923250", "user": {"username": "FYIgirl", "user_location": {"name": "Wentzville, Missouri", "id": "45032"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Fantastic Dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r433081056-m11068-Vetro_1925-Fayetteville_Arkansas.html#review433081056", "text": "Had friends visiting and went here for dinner.  It was AMAZING!  The service was excellent, the food options met everyone's taste and when we got our meals, it was some of the best food we have had.  This is not a cheap place to eat but if you want outstanding service and excellent food, this is the place.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-30T16:53:06-0400", "location_id": "2436132", "id": "433081056", "user": {"username": "Tatterbug", "user_location": {"name": "Seattle, Washington", "id": "60878"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "How can it rank so low?", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r430392713-m11068-Vetro_1925-Fayetteville_Arkansas.html#review430392713", "text": "My sister was in town from out of state so I decided to take her to this restaurant for a nice dinner during her trip.  I had been here once before but only once due to the cost. Well went back and yes it is expensive compared to most of the restaurants in town but the dinners were among the absolute best I have had throughout travels throughout the U.S. bar none (yes, I did taste my sister's dinner and shared mine with her as well so I tried 2 dishes). The appetizer we shared was really good and gave us a sampling of 3 dishes.  We each chose a different entree, both in the fish category (but we eyed the red meat going to adjacent tables, which got polished off with some speed). The sides were excellent.  We also shared a very good dessert with coffee.  I certainly can't identify any restaurant in town with any dishes that have been better.  A five star dining experience as service was great as well.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-21T12:03:56-0400", "location_id": "2436132", "id": "430392713", "user": {"username": "DrPatty", "user_location": {"name": "Arkansas, U.S.", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great Dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r429885778-m11068-Vetro_1925-Fayetteville_Arkansas.html#review429885778", "text": "A large group of us came here on a football weekend and had a great dinner. The service was great as they accommodated a party of 16 and never missed a beat. They great appetizers and I tried the elk as my entree and it was awesome.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-19T18:46:24-0400", "location_id": "2436132", "id": "429885778", "user": {"username": "SouthMS_Traveller", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Wedding Reception Dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r429874398-m11068-Vetro_1925-Fayetteville_Arkansas.html#review429874398", "text": "This is our most favorite and cherished restaurant in not only Fayetteville, but around the world. We love it so much that we had our wedding reception dinner here.  \n\nMy husband and I can't say enough about how amazing Laurie and the Vetro team made this experience. They personalized everything to make it so special for us. \nOur evening started out with a cocktail hour of Bellinis and Beer for our guests. Then, guests sat down to beautiful set tables for imported Italian cheeses and bruschetta followed by salad.  We chose a menu created by Chef Alan and team of filet, handmade bow tie pasta w chicken and lobster ravioli.  Our dessert of chocolate cake with Nutella frosting was made by their expert pastry chef. \n\nGuests took away handmade candies as well that I still hear raving reviews about today. \n\nOur night was one to remember forever, and we were beyond impressed with everything that was done for us. Our guests commented for week of how friendly and welcoming the staff was.  It was a stress free experience, and we can't wait to have another event there. \n\nWhether you are having an event or just simply wanting an amazing dinner out, Vetro is the place to be!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-19T17:11:50-0400", "location_id": "2436132", "id": "429874398", "user": {"username": "jennifergartschultz", "user_location": {"name": "Fayetteville, Arkansas", "id": "31589"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Almost better than Italy!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r419569362-m11068-Vetro_1925-Fayetteville_Arkansas.html#review419569362", "text": "We've been to Italy and this restaurant took us back again.  Fresh vegetables, homemade pastas, great cheeses and I could go on.  We made a special trip to Fayetteville to eat here as we loved the menu.  They did not disappoint and we will be back.  Our service was excellent and Brian was just the best.  Food came out hot and just at the right time.  I'm still thinking of my Burrata appetizer!  Add this to your list!  See you all again soon.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-17T12:37:13-0400", "location_id": "2436132", "id": "419569362", "user": {"username": "Jasmine59", "user_location": {"name": "Fort Myers Florida", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Excellent Bar & Bistro", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r416851790-m11068-Vetro_1925-Fayetteville_Arkansas.html#review416851790", "text": "We were walking by after lunch and a gentlemen came out saying it's one of the best restaurants he's eaten at in his life. We had to try it and were not disappointed. Cocktails were delicious. As for the meals, we could taste the freshness of the ingredients. The ambiance was pleasing. But it's the quality of the food that would make us returning patrons.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-09-10T10:29:48-0400", "location_id": "2436132", "id": "416851790", "user": {"username": "NKeesee", "user_location": {"name": "Maumelle, Arkansas", "id": "31767"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r415169009-m11068-Vetro_1925-Fayetteville_Arkansas.html#review415169009", "text": "I always like this place and wonder why more don't know about it. \n\nService excellent and food and wine choices excellent.  Setting is fun \n\nHope they stick around. Go there and you'll be happy.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-09-05T18:39:35-0400", "location_id": "2436132", "id": "415169009", "user": {"username": "Shemp5", "user_location": {"name": "Little Rock, Arkansas", "id": "60766"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Just Okay", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r414070919-m11068-Vetro_1925-Fayetteville_Arkansas.html#review414070919", "text": "My husband and I picked this restaurant wanting a nice date night out, to do something a little different than usual and to explore the Fayetteville restaurant scene a bit. In short, we did enjoy our evening at Vetro -- we shared a delicious cocktail, the bread was surprisingly yummy, and my entree was pretty good. However, my husband's pasta dish with chicken literally tasted like a Lean Cuisine. We were so disappointed because it was actually what stood out to both of us as sounding the best on the entire menu, but not wanting to both order the same thing, I chose something different. Thank goodness! Like I said, my entree was actually quite enjoyable but my husband's was so void of flavor. We concluded that we probably won't go back, although we weren't upset that we tried Vetro.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-02T19:12:34-0400", "location_id": "2436132", "id": "414070919", "user": {"username": "KristenRich", "user_location": {"name": "Louisville, Kentucky", "id": "39604"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "In Vetro veritas", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r412388658-m11068-Vetro_1925-Fayetteville_Arkansas.html#review412388658", "text": "I really wanted to love Vetro, to be proud of probably our nicest, trendiest restaurant.  And we were off to a great start with the calamari appetizer.  Inspired!  Came to the table piping hot, excellent texture, freshness, even the complement of a tomato sauce.  But the entrees left something to be desired, in fact, they were inexplicably not so good.  Agnolotti (see the pasta section of the menu) were dry and bitter instead of moist and subtle. The char on the cauliflower had gone to burned, and the pasta and its filling were so lackluster that it shouldn't have made the cut!  So we sighed and ate it.  \nMy house-made semolina pasta (see pasta menu) was macaroni and cheese and peas.  Sorry! \nOur friend, though, to whom we wanted to show that our town could offer a culinary night out, had the bunny, er, rabbit and he said it was just great!  So there you go:  great potential out of the gate, but a sorry finish.\nDessert was solid, not out of this world (easy to do after drinks) but up there.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-29T10:44:44-0400", "location_id": "2436132", "id": "412388658", "user": {"username": "bermane", "user_location": {"name": "Fayetteville, Arkansas", "id": "31589"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Rehearsal dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r411665116-m11068-Vetro_1925-Fayetteville_Arkansas.html#review411665116", "text": "Living out-of-state I needed a venue for the rehearsal dinner for my son and his bride for their August wedding this year (2016). I searched online at several options in the northwest Arkansas area and eventually chose Vetro1925, one reason being how appealing their food looked, and another for the enthusiasm conveyed in our initial phone conversations.\n \nI had not seen their Wine Room other than a few pictures sent me. Seeing it in person for the first time that Friday afternoon was wonderfully affirming of having chosen Vetro: the room was elegant, one long wall with wood cubby-holes filled with wine bottles. Mini lights hung from the ceiling provided a soft but festive glow, the tables decorated with place settings beautifully appointed. The ambiance was everything I was hoping to have for the dinner.\n\nVetro's staff was very accommodating as I wanted to handle the dinner in a very specific way, including a unique table arrangement. With 45 attendees we worked out the details long distance, and they went the extra mile to assure it being a successful event.\n\nMany, many people commented to me afterward about how much they enjoyed the dinner: the fresh and delightful salad, the bread and olive oil wonderfully tasty, the entrees and vegetables very flavorful, and a wonderful tiramisu for desert. All nicely presented. The quality of the meal was excellent.\n\nThe servers were very professional and sensitive, unobtrusive yet paying attention, quietly serving the individual courses, keeping water and wine glasses filled and individual requests for beverages supplied. The entire meal came off smoothly, it being obvious that much planning and coordination had been done by staff. At the end of dessert I stood and said let's give the servers and staff a big thank you for the meal and for taking such good care of us; the loud vocal response and clapping from the attendees conveyed their hearty agreement. \n\nThe evening was a wonderful success, in large part due to the excellence of Vetro's staff.\n\nI would choose Vetro again in a heartbeat!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-27T22:40:31-0400", "location_id": "2436132", "id": "411665116", "user": {"username": "t523cooke", "user_location": {"name": "Tucson, Arizona", "id": "60950"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Date Night", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r404047530-m11068-Vetro_1925-Fayetteville_Arkansas.html#review404047530", "text": "On our Date Night out, we dined at Vetro's ! It was so elegant, very upscale, but warm and friendly too. The wait staff were very professional, the food was yummy and looked as good as it tasted. It is a little pricy to eat there every week but a wonderful place for special times. We usually eat early so  we had the place to ourselves but about half way through our meal the restaurant started to fill. The portion size was large enough that we were able to enjoy a second meal again the next day.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-11T04:49:42-0400", "location_id": "2436132", "id": "404047530", "user": {"username": "lhayes40", "user_location": {"name": "Fayetteville, Arkansas", "id": "31589"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Had a wonderful dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r401405877-m11068-Vetro_1925-Fayetteville_Arkansas.html#review401405877", "text": "Four orders of spaghetti, three bolognese, one carbanara:  all delicious.  One agnolotti and one lobster ravioli were also very good.  House salad was fresh and tasty.  Caesar salad was fresh and good too, as well as the bread.  Wait staff was very patient with my father in law,  who had to have things explained to him even we had already told him what bolognese meant.\n\nWe arrived at 5, opening time, and they were ready to go.  White wine was cold and delicious.  They didn't have my husbands choice on red, but he got something he liked. I had Pinot Grigio.\n\nWill certainly return!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-04T10:53:01-0400", "location_id": "2436132", "id": "401405877", "user": {"username": "Linnette G", "user_location": {"name": "Laguna Niguel, California", "id": "32590"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Best meal I've ever had hands down ", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r400628665-m11068-Vetro_1925-Fayetteville_Arkansas.html#review400628665", "text": "Truly everything from the atmosphere to the service and of course the wine and food was wonderful. We decided to go with the five course meal with wine pairings. We didn't regret this choice at all. If you can this is the way to go. You will get the best of the best selections...food and wine. I like this because honestly I love good food and wine but I wouldn't know what to pick. This way we were able to try everything that was top notch on the menu. Fabio was our waiter and he did a wonderful job of explaining each course and the wine pairings that he selected for them. Each course was perfect. Seriously the best meal I've ever had. In the five courses we had lamb, shrimp, pasta, fish, steak and dessert as well and wine with each. It was a lot of food and I was definitely full at the end but felt good. They can also alter the menu to your tastes depending on what you do and don't like. I was glad we went with the chef's selections though. All in all a beautiful, perfect meal. Definitely the best upscale restaurant in the area. If you are thinking of going, GO!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-02T18:51:40-0400", "location_id": "2436132", "id": "400628665", "user": {"username": "Michelle M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-01", "title": "Delicious", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r382941206-m11068-Vetro_1925-Fayetteville_Arkansas.html#review382941206", "text": "The waiter gave me ideas on what he thought was best and after taking him up on the pork belly I was not disappointed. Exquisite meal.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-15T14:34:06-0400", "location_id": "2436132", "id": "382941206", "user": {"username": "Tiffany S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Amazing!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r377678234-m11068-Vetro_1925-Fayetteville_Arkansas.html#review377678234", "text": "Best steak I have ever had. Everything from appraisers to desert is amazing. Best wine selection in town.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-29T11:08:18-0400", "location_id": "2436132", "id": "377678234", "user": {"username": "Chris D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Chic, delicious, upscale", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r376512550-m11068-Vetro_1925-Fayetteville_Arkansas.html#review376512550", "text": "Superb food, very professional wait-staff. Clean, edgy surroundings. A modern upscale restaurant with excellent food and useful bar.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-05-25T11:33:57-0400", "location_id": "2436132", "id": "376512550", "user": {"username": "william S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "Good dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r372785005-m11068-Vetro_1925-Fayetteville_Arkansas.html#review372785005", "text": "I met some friends there for a drink and dinner. The bar was a great place to start. Nice guy with a very good selection of bourbon. We set at the table and had mussels and some bread as an appetizer. Both were very good. For dinner I had the Caesar salad with shrimp added. It was good but not great. I didn't particularly enjoy the head attached shrimp for a salad. It was a very good ding experience overall. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-05-14T03:34:01-0400", "location_id": "2436132", "id": "372785005", "user": {"username": "Callitlikeyouseeit", "user_location": {"name": "Little Rock, Arkansas", "id": "60766"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "\"Date Night...\"", "url": "https://www.tripadvisor.com/ShowUserReviews-g31589-d2436132-r372411856-m11068-Vetro_1925-Fayetteville_Arkansas.html#review372411856", "text": "Where would you like to go for your birthday dinner?\n\nVetro 1925...I'll make reservations! \n\nThey're having a charity event😔\n\n...another time?\n\n(3 months later)\nHow about Vetro 1925 Wednesday night?\n\n😍\n\nTammy was our waitress...she is so charming and approachable. We felt special for being with her last night. Amazing must visit gem of NWA😍", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-12T11:13:51-0400", "location_id": "2436132", "id": "372411856", "user": {"username": "hogcatch", "user_location": {"name": "Arkansas", "id": "28925"}}}]}