{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2015-06", "title": "Great introductory tour of the Grand Canyon", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r282518445-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review282518445", "text": "We had a great time seeing the Grand Canyon up close and personal, our guide Matt was an impeccable boatman, professional, and knowledgeable. He was extremely attentive and went above and beyond with his customer service. We also had a boatman in training Erickson who assisted us during the journey who was also knowledgeable and very entertaining. \n\nI’d recommend this tour for anyone wanting an introduction to the Grand Canyon. You don’t need any experience in hiking or rafting as the hike up to the Travertine Falls is well trodden and there are many local knowledgeable Hualapai ready to help you up. The rafting is done entirely by the boatman; you just need to hold on tight. \n\nThe only point I feel the need to warn people about is the ride back up. After being on the river for at least 5 hours and then a 5-minute helicopter ride up (hopefully they can fly that day) its another 2 hours simply to get back to Peach Springs on the reservation. If you happen to be staying there that’s great, but Flagstaff is another 2 hours away. This trip has a lot of sitting on bumpy things. However, because of the great customer service throughout the trip I would still give the overall experience 4/5 stars.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-06-23T21:05:28-0400", "location_id": "1548055", "id": "282518445", "user": {"username": "CristinaSea", "user_location": {"name": "Seattle, Washington", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-10", "title": "Inner Canyon Jeep Tour", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r240858133-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review240858133", "text": "This was an excellent choice.  The tour was all it said to be.  We journeyed to the bottom of the Grand Canyon in a custom vehicle.  The guide was fantastic.  He know the area and answered all of our questions.  The lunch was very good.  We had time to explore the area and stopped several times for pictures.  I would recommend to anyone interested in going to the bottom of the canyon who is unable to walk or unwilling to take a helicopter.  They met us on the Indian Reservation.  Great Trip!", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2014-11-21T08:48:25-0500", "location_id": "1548055", "id": "240858133", "user": {"username": "wantitall2014", "user_location": {"name": "Lafayette, Louisiana", "id": "40261"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-06", "title": "Awful, awful, awful!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r209490632-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review209490632", "text": "First they lied to me when I booked.  We were supposed to be in a jeep taking us to the bottom of the Grand Canyon for white water rafting.  This jeep ride was supposed to be 2-2 1/2 hours.  Instead we spent close to four hours in a shuttle bus...miserable.  Rafting trip was freezing cold.  Lunch was awful. Helicopter up was ok but then they left us sitting there for close to three hours in the hot sun with no ride back.  For this pleasure we paid $500 each.  Seriously????", "helpful_votes": "9", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2014-06-08T19:55:35-0400", "location_id": "1548055", "id": "209490632", "user": {"username": "Benloco29", "user_location": {"name": "Carlsbad, California", "id": "32171"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-04", "title": "Northern Arizona and the Grand Canyon...book your tour HERE", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r207720200-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review207720200", "text": "This is a primo company with their own custom vehicles, awesome guides, and a fantastic narration.  We journeyed to the \"Center of the Earth\" as the owner put it, right into the bedrock of the Grand Canyon, and the value is far better than a simple helicopter ride.  For just a few dollars more, we got a full day with lunch, narration, and the kind of personalized care you'd expect from a first rate company.  This day to the bottom was a real \"bucket list\" item for us.  Thanks!!", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-05-28T15:19:06-0400", "location_id": "1548055", "id": "207720200", "user": {"username": "Tom M", "user_location": {"name": "Williams", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-05", "title": "Life long memories!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r204881827-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review204881827", "text": "We made life long memories on our Grand Canyon Tour from Grand Canyon Tour Store.  We had very little time for me and my hubby to plan our trip and at first I was worried at how family oriented this would be (as we have a 7 and 12 year old).  It was utterly AMAZING. I only wished we had a better battery in our camera. Bring extra batteries because you are going to need them! We thought dessert and cactus, this was BEAUTIFUL forrest and evergreen and the wildlife was spectacular. Well planned, great friendly guide, knowledgeable, and the best part for my husband is he didn't have to drive! (or get lost =) he he", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-05-09T15:59:50-0400", "location_id": "1548055", "id": "204881827", "user": {"username": "MrsKLaJolla", "user_location": {"name": "La Jolla, California", "id": "32578"}}}, {"lang": "en", "rating": 2, "travel_date": "2014-04", "title": "Save your money", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r201407423-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review201407423", "text": "We booked the tour to see the canyon from the bottom- but there are several problems with this. Pros: our guide Dave was knowledgeable, pleasant and a great guide.  We learned a lot about the geology and the flora and fauna on our ride into the canyon.  I would give Dave 5 stars.\nCons: you don't really get the sense that you are in the Grand Canyon- it could be any canyon and not as awesome as say Zion.  You can only see partially up the canyon because of the spot we stopped in.  The area around the river where we stopped really did not have much hiking area for the 1 1/2 hours we spent down there.\nThe company did not mention that in addition to the 1 1/2 hour ride into the canyon, the 1 1/2 hours at the bottom of the canyon, and the 1 1/2 hour ride back up there was the ride from Williams to the Hualapi reservation which was over an hour each way, lunch at the Hualapai hotel which was another hour- so our expected 4 1/2 hour day was over 8 hours, most of it in the van!  Unless you are very interested in geology I would suggest you save your money.\nAnother problem was the owner, Brad (or Bart- he never bothered introducing himself, left the tour at the first stop without saying anything) needs some people skills.  I booked directly with the Grand Canyon Store, and whomever I spoke to was polite and enthusiastic- but left out crucial parts of the tour.  I never would have booked that much time in a van for such a short time in a canyon.  \nThere were four of us- two mature couples, and we all felt it was the most wasted day of our entire 12 day vacation in National Parks.  Spend your time in the park- and save your money.", "helpful_votes": "6", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-04-16T06:50:50-0400", "location_id": "1548055", "id": "201407423", "user": {"username": "MTPoughkeepsie", "user_location": {"name": "Poughkeepsie, New York", "id": "48443"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-10", "title": "Inner Canyon Bus Tour", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r181292141-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review181292141", "text": "Our family of five adults signed up for Inner Canyon tour during the government shutdown.  We were told that each bus holds thirteen people.  This was an all-day program, and I chickened out and decided not to go (I tend to be claustrophobic and have problems with people's perfumes in closed spaces), but the rest of my family went.  \n\nEach of my family members reported that the first half of the trip was really sad with extremely poor lunch which was included, but that the second half of the trip more than made up for it. Everybody was very happy when they got back.  So my advice to the people who are considering this program is to pack some food and don't be disappointed before you see the second half.\n\nAnother thing that I am very impressed with was that the company refunded my portion.  I didn't ask for it because we signed up at the last minute (the evening before the trip day) and didn't have a chance to cancel the reservation properly.  The people who helped us sign up were straightforward answering all of our questions, and the company proved itself to be honorable as well.  If we have another chance to go to Grand Canyon, we will definitely look for this company.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-10-16T11:52:03-0400", "location_id": "1548055", "id": "181292141", "user": {"username": "Soleilleux", "user_location": {"name": "Portales, New Mexico", "id": "47160"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-09", "title": "Glad we did the Inner Canyon Tour!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r179111231-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review179111231", "text": "My wife and I and another couple took this trip from Williams and loved it!  Our guide, John, was awesome and provided great explanations as well as having a good sense of humor.  Given we we not going to hike the Grand Canyon or take a mule, this tour was the best option to get to the bottom and stick our feet in the Colorado River.  In addition, rode Rt. 66 and got to visit a couple of neat towns.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-09-29T13:20:21-0400", "location_id": "1548055", "id": "179111231", "user": {"username": "kdlake", "user_location": {"name": "West Boylston, Massachusetts", "id": "41898"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-08", "title": "Best Guided Tour Ever by The Grand Canyon Store!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r177795115-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review177795115", "text": "On August 4, 2013, my husband and I, with our two teenagers, embarked on one of the best times we have ever had.  We chose to take a bus tour to the bottom of the Grand Canyon.  Our tour guide's name is Jerry Bricker, and I would request him, specifically.  He is tremendous.  \nJerry picked us up right on time at our hotel in a new van built specifically for this tour.  It was clean, very comfortable, and allowed everyone an excellent view.\nJerry's enthusiasm, professionalism, and in-depth knowledge of American history, the State of Arizona, and all that is the Grand Canyon made this a great experience!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-09-19T08:42:45-0400", "location_id": "1548055", "id": "177795115", "user": {"username": "KristinV5", "user_location": {"name": "Frisco, Texas", "id": "55870"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-08", "title": "Don't Miss It-Grand Canyon Tour with Helicopter flight", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r175036706-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review175036706", "text": "Aug 29, 2013 Ultimate Package..We booked this tour online before we arrived. The van was almost new and very comfy seats with big clean windows. We were picked up promptly at The Wyndham Rec Center and immediately greeted by tour guide, David.  So personable, knowledgeable and exhibited genuine interest in our day being the best day we could have under his watch.We went to some great areas to view the canyon and took some great pictures. We chose to do the helicopter flight which was scheduled for afternoon, but switched to morning. I recommend a morning flight-best weather conditions. Our pilot was very experienced and personable. You will miss out on a phenominal view of the canyon that can only be fully experienced from the air.  Lunch was provided and let me just say it was more than expected!  A trip we will remember forever, thanks to our guide, David, who helped us get the most of the day from extraordinary view points.   Be sure to get David if you can.\n\nless", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-08-31T18:29:40-0400", "location_id": "1548055", "id": "175036706", "user": {"username": "BetLittle", "user_location": {"name": "Orlando, Florida", "id": "34515"}}}, {"lang": "en", "rating": 3, "travel_date": "2013-08", "title": "Enjoyed the rapids!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r174592026-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review174592026", "text": "We booked the one day white water rafting trip here.  I have to say that it was a thrill and absolutely enjoyed our excursion down the Colorado River!  Not for the feint of heart though, be sure that you're up for getting soaked and a thrilling rough water ride.\n\nI do wish that the tour company would warn people that they WILL lose glasses, hats, etc.  One of our fellow guests from the UK lost their prescription eyeglasses (this WILL happen).  You also will definitely need a full change of clothes as you will be soaked to the skin (it was a LOT of fun, though).\n\nStarting our day, we came out of Flagstaff (awesome bus driver!), had to transfer to another bus in Peach Springs, then down into the Canyon.  Total morning transit time was about  3-1/2 hours.  We were picked up at 5:30am in Flagstaff and met our rafts close to 9:30am.\n\nRafts departed by about 10:00am.  Most of the trip was peaceful, but there were a few rough rapids we had to pass through.  Those only lasted the first couple of hours on the trip, then after lunch it was time to get the cameras out and take in the scenery.  Very nice!\n\nFortunately, the weather was good enough that day that we were taken back to the top of the rim via helicopter.  This was a little disappointing as we had to wait 1-1/2 hours (many other tours meet here and this is much like a taxi service).  It was about a 5 minute flight back.\n\nThe only REAL disappointing part of the tour was the trip back after rafting.  We started around 10:00am and were off the rafts just before 2:00pm (their advertising states it's a 6 hour raft tour, but we were happy with the amount of time).  So from a 2:00pm finish, we did not arrive back at our hotel in Flagstaff until 9:00pm.  The bus was FREEZING and we were not advised on how long of a trip we were in for.  I was completely MISERABLE (just ask my poor husband) but my mood instantly changed once I warmed up - LOL!\n\nAll in all, I would have booked this trip knowing what I know now.  Just be prepared to get SOAKED, HANG ON, SECURE your eyewear and expect that the trip home is longer than the trip there.  This was a bucket list item for us, it was great!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-08-28T19:20:22-0400", "location_id": "1548055", "id": "174592026", "user": {"username": "Laura E", "user_location": {"name": "Woodstock, Canada", "id": "262783"}}}, {"lang": "en", "rating": 3, "travel_date": "2013-07", "title": "Smooth water raft float", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r168911183-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review168911183", "text": "The smooth water raft float was awesome. It could not have been any better. This part of the trip was provided by Colorado River  Discovery. \n\nHad we known this was not a Grand Canyon Store tour we would have booked direct with CRD. This would have saved hours of transportation time and would have cost less than half what we paid to Grand Canyon Store.\n\nApparently the Grand Canyon Store is an overpriced middle man. We paid 229.00 per person for a 96.00 per person excursion. The big difference is so we could wake up extra early and drive an extra 1 1/2 each way picking up and dropping off others. although, our driver Fernando was a great driver.\n\nWhen they sell you these tours, they represent them as theirs. I think that is highly misleading.\n\n5 star Colorado River Discovery. 1 star Grand Canyon Store. 5 stars Fernando.\n\nGet a better experience and go direct. I would have if only I knew.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": {"lang": "en", "author": "hOrselvr29226, Manager at Grand Canyon Store, responded to this review", "text": "Dear Darren B,\r\nI am sorry to hear that you were disappointed with our company although it sounds like you had an awesome time. The reason I feel we need to respond to you is that you made accusations that really are misleading to readers. Let me begin with the Smooth water that you actually did take with our company. Let me make you aware of some things that you missed while doing your due diligence. It is true that anyone can book a smooth water float trip with Colorado River Discovery, and they are an excellent company to use, which is why we are contracted with them. Our company as an alternative offers a full day, one price, no hassle package which picks people up at their hotel, then offers a tour through the painted desert, Marble Canyon, and Cameron. These areas are rich with history that the average person would never learn about, making the complete package enjoyable and effortless, as you mentioned. Here are the facts that you are unaware of. The rafting tour you did is not available to the public! This is a special package available to us for our guests which is an extended version and includes lunch on the river. To take a rafting tour directly with the Rafting company from Cameron, Flagstaff, or Williams you would need to drive an additional one hour and 45 minutes each way to a different location, and choose from either a early AM or later PM tour, and it would not include lunch.  As far as other tours we do, let me use our Ultimate Grand Canyon as an example. We offer a full day tour to Grand Canyon visiting all the key sites. This tour also is inclusive of entrance fee's, transportation, and lunch. On this tour we have contracts with the helicopter company to fly our guests across the canyon and back at an reduced rate. This enhances the tour giving our guests as the name suggests, an Ultimate Grand Canyon experience. But would you want our driver / guide to hop in the helicopter and fly you across the canyon ?? I hope not ! We leave that to the pro's. To close, my advice to any reader would be to check things out directly with the company you are considering, and never take anyone's word good or bad when it comes to what  might make you happy.", "title": "Owner Response", "published_date": "2013-07-26T12:49:16-0400", "id": "169197106"}, "trip_type": null, "published_date": "2013-07-24T14:44:48-0400", "location_id": "1548055", "id": "168911183", "user": {"username": "Darren B", "user_location": {"name": "Spotsylvania, Virginia", "id": "58198"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-06", "title": "Grand Canyon Tour with Helicopter flight.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r164907978-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review164907978", "text": "We booked this tour online before we arrived. The bus was small which was nice and very comfy seats with big windows. We were picked up in Williams and straight away Jerry the tour guide was jolly and very helpful. Throughout Jerry was knowledgeable, personable, helpful and a great guy. We went to some great areas to view the canyon and took some great pictures. We chose to do the helicopter flight also which i highly recommend as its the best way to see the canyon and was one of the best parts of the day. A trip we will remember forever, one which was made all the better with the help of our guide Jerry. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2013-06-23T08:21:52-0400", "location_id": "1548055", "id": "164907978", "user": {"username": "Cooney1", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2013-05", "title": "Something for everyone!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r162226151-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review162226151", "text": "Great selection of souviners. Something for everyone. Puzzles. magnets, shirts hats, posters, mugs, calendars..ect.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-05-28T17:50:53-0400", "location_id": "1548055", "id": "162226151", "user": {"username": "David T", "user_location": {"name": "Mesa", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2013-04", "title": "Awesome Time with our tour guide David", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r159025273-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review159025273", "text": "My girlfriends and I from New York and Florida, respectively, enjoyed a lovely day with David our tour guide.  He was knowledgeable and patient (with all the pictures we stopped to take).  The tour started before we even moved from our resort where he picked us up!  Not only did we get a lesson about the Grand Canyon, but David knew the history of Arizona and beyond.  He was great!  I highly recommend this tour company and tour guide, David!\n\nThank you, Tameka, Melanie, Syrrea, Tarsha and Vanessa!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-04-28T06:06:40-0400", "location_id": "1548055", "id": "159025273", "user": {"username": "TForman", "user_location": {"name": "Fort Lauderdale, Florida", "id": "34227"}}}, {"lang": "en", "rating": 3, "travel_date": "2013-04", "title": "Cool trip to the bottom.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r158226087-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review158226087", "text": "We booked this trip as a JEEP tour to the bottom of the Grand Canyon. That's what they advertise and that's what is on their web site video. We went to the Williams AZ store and were told that they upgraded and no longer have jeeps and we would have a nice comfortable ride in their new cruiser coach. Well we got an old van. We politely complained but we got what we got. 20 miles in and 20 miles back in a van with no good shocks. We loved the bottom, the lunch, the stops in Seligman and several on the way down. Our guide Clay was knowledgeable and friendly and appreciated that we appreciated the Canyon and all that was there. On the bright side we did obtain a partial refund for the van ride. They are all friendly and helpful.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-04-19T11:51:09-0400", "location_id": "1548055", "id": "158226087", "user": {"username": "DLC622", "user_location": {"name": "Minneapolis, Minnesota", "id": "43323"}}}, {"lang": "en", "rating": 3, "travel_date": "2013-04", "title": "Early Season Tour, Beware", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r158209572-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review158209572", "text": "Just returned from a week long trip to Santa Fe, Sedona and Grand Canyon. We tried to book a Grand Canyon tour with a Sedona outfit but for whatever reasons they could not charge to our credit card, even though it was the same card we used the entire week.  Ended up booking with Grand Canyon Store out of Flagstaff and was initially quoted a price of $89, which changed to $114, was told there was price change, even though when we arrived at the office there was a placard advertising $89, I should have asked but did not. We took the Grand Canyon tour and were told on the phone that the trip included an IMAX show, lunch (choice of Pizza hut personal pizza, or oriental  dish (not very good) and drink, anything else was extra), two stops on the canyon and “we would have the chance to add on a 30 minute helicopter ride if we wanted”. We were picked up at our hotel and went to the local office to transfer to the van. It was 12 passenger van, with 8 customers.  Once in the van we were told we were picking up 4 more along the way at 2 different locations. We ended up going to Williams (20 miles W of Flagstaff) for first couple and then 15 miles later with a second couple (that was not ready on time).  After leaving Williams we were told that in the “Early Season” Grand Canyon Store combines their regular Grand Canyon tour (no helicopter ride) with the Grand Canyon tour with a helicopter ride ---MEANING that if you choose NOT to do a ride, you “get” to spend at least an hour at the Grand Canyon airport lobby!  The tour folks said it would only be 45 min, but the reality is that the ride requires customers to watch a video, then get their communication equip, then get a picture on the ramp, then load and take their ride.  At BEST, it takes an hour from the time you park till you load up. \n\nThe problem for my wife and I (and at least one other couple) was that we were not told that at the end of our tour we would have to wait at least an hour while one or more (for us there 4 out of 12) take the “30 minute ride”.  By the time we arrived at the airport we had already been on the road for about 7 hours and had at least 2 more hours before getting back to Flagstaff. \n\nWhen I questioned the tour owners (after returning to Flagstaff) about NOT being told about this delay, they responded that we were told “we would have the chance to add a helicopter ride”, I said yes, BUT that is a bit different than being told “if you choose not to take the ride, you will be at the airport for about an hour”, no real response from the tour folks. Upon return I mentioned my dissatisfaction to the owner (wife) and mentioned that I would likely submit a review.\n\nFast forward to about 8:30pm that evening, I was surprised to get a call from the owner  (husband) and he said that he had been told I was going to write a “bad” review  of the tour.  I replied that  I never indicated that I was going to write a “bad” review, I said a review, with emphasis on the way this tour was marketed to me.  Both my wife and I enjoyed this tour, especially Jerry (our driver/guide), except the extended delay that we did not know about until about 30 minutes out of Flagstaff (too late to attempt to make any change).  The IMAX movie was a pleasant surprise, the meal was marginal, but OK.  With Jerry leading (most of the time) at the stops it was very informative, he covered many topics from the trees, to local geology, to animals, and even the history of the helicopter rides – all very informative!!\n\nWould I recommend this tour – yes the regular (non helicopter ride} version.  The helicopter is about $190 on top of the tour cost.  I probably would have still take this tour, but I would have appreciated knowing about the 1 hour diversion, for anyone choosing to take the helicopter ride. \n\nSuggested questions for tours:\n\nHow long is the total tour?\n\nWhat are the specific stops on this tour?\n\nAre there any other customer pick-ups along the way?\n\nIf a meal is included, what is it?\n\nIf the tour folks seem to be evasive in their responses, take that into consideration.  If you are marketing tours you should know your product. If there are potential negative aspects (food, time, etc.) responses will likely be less specific.  This should be a flag.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": {"lang": "en", "author": "hOrselvr29226, Owner at Grand Canyon Store, responded to this review", "text": "Dear M.S. from Denver Colorado,\r\n\r\nI would like you to know that although you had a good experience overall I am sorry you were displeased with the helicopter option. The tour was designed to extend the helicopter to guest to further enhance their Grand Canyon experience. For many people after seeing the Imax and standing on the rim looking into the vastness of the Canyon it was a nice option. I am a retired helicopter pilot and have flown tens of thousands of people on the tour that you were offered. I know from all of my experiences that had you taken advantage of the discounted rates offered and you too had taken the flight you would have a different outlook. I also realize that a flight over Grand Canyon is not for everyone and for those not flying would be able to see the operation and learn of its history pertaining to Grand Canyon. It is truly fascinating to me how this all came to be. And is unwritten. You would only learn this from my company. None the less for a person who may have no interest in this part of the aviation history of Grand Canyon I can understand you may have felt left out. You may be happy to learn that I have decided to offer this Grand Canyon tour all inclusive with the helicopter as an additional tour and no longer combine the option to add on to the Grand Canyon Tour. As for the Grand Canyon Tour being priced at $89.00, this is available to guests who visit our original website at GrandCanyonStore.com and reserve with us directly.", "title": "Owner Response", "published_date": "2013-07-26T14:09:49-0400", "id": "169206741"}, "trip_type": "Couples", "published_date": "2013-04-19T08:52:27-0400", "location_id": "1548055", "id": "158209572", "user": {"username": "M S", "user_location": {"name": "Denver, Colorado", "id": "33388"}}}, {"lang": "en", "rating": 1, "travel_date": "2013-03", "title": "We felt stranded, betrayed and lied to", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r156615041-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review156615041", "text": "We felt stranded, betrayed and lied to.\n\nRead on to learn how this company:\n1. Grossly misrepresented what was included in the tour\n2. Failed to pre-arrange for part of the tour (local Navajo guide never contacted)\n3. Is nothing more than a booking service - They are not the tour operator.\n4. Charges you at least $120 to $140 per person more than you would spend if you booked it yourself.\n\n1. GROSS MISREPRESENTATION\na. We were told that we would leave Williams, AZ at 6:30 am and return to Williams, AZ at 5:30 pm.  This is not true. The earliest we could have expected to get back (we learned later) to Williams was 7:00 pm but for us we did not get back until 8:30 pm because they forgot to book part two of the tour with the local tour guide. More on that later.\n\nb. We were told that it was \"a couple hours'\" drive to the marina where we would start our tour.  This was wrong. It was almost four hours drive each way.\n\nc. We were told that the boat tour portion would include a ride through marble canyon. Not true. We did get a boat tour but it barely left the marina and it only took us through Antelope Canyon, which was pretty in its own right but was not the same stunning beauty as was represented in the photo we were shown of Marble Canyon.\n\nd. We were told that we would be having lunch in the world's largest floating restaurant. Not true.  We were given a box lunch that consisted of a sandwich on white bread, an apple and a bag of chips.\n\n2. FAILED TO PRE-ARRANGE PART OF THE TOUR\na. We were told that the second part of our tour would be led by a local Navajo Indian guide. The agent told us how great this guide is and that he would be playing his pan flute for us as part of that section of the tour.  Apparently The Grand Canyon Store forgot to book the time with the Navajo guide and so when we all got off the boat and up the ramp to meet the guide, he was no where to be found.\n\nb. After an hour of sitting around and waiting, our bus driver announced that he was going to cancel part two and take us back to Flagstaff.   We all piled into the van and started the drive back. Twenty minutes in to the drive, someone from the Grand Canyon Store called our driver and told him to turn around. They had apparently managed to secure a different guide for the walk through Antelope Slot Canyon. No flute playing though.\n\n3. BOOKING SERVICE - NOT A TOUR OPERATOR\na. The boat tour is not operated by The Grand Canyon Store.  We got off the van and boarded a vessel wholly operated by a separate company.  The ten or so people that rode in our van were joined by other tourists who drove to the marina on their own and who booked passage on the boat tour separately.\n\nb. The walking tour through Antelope Slot Canyon is not operated by The Grand Canyon Store. This tour and access to this canyon is wholly operated by local Navajo and Sazi tribes. \n\n4. SAVE AT LEAST  $120 OR MORE PER PERSON - BOOK IT YOURSELF\na. The savings you can achieve increase with more people because you will share in total gasoline expenses.  Also, access fees to the marina and to the Slot Canyon location are \"per vehicle\" so the more people you have in your car the less you spend per person. \n\nb. The Grand Canyon Store charges $229 + tax per person for this combo tour to Antelope Canyon on the water and Antelope Slot Canyon on land (these two sites are roughly ten minutes apart by car).  The cost to do the boat tour alone is $49. The cost to do the Antelope Slot Canyon walking tour is $30. So, for roughly $80 each you get both the experiences but you would need to drive yourself.  OK factor in $40 to $80 in gas depending on what you drive and an additional $40 in access fees per vehicle.  For us, we figured if we drove ourselves and booked these mini tours by ourselves, we could have done it for $120 each including fees and gasoline for a total of $240 for two.  We paid The Grand Canyon Store $480 including taxes for two and the experience was not what was promised. \n\nFINAL THOUGHTS: Had we known then what we know now we would never have booked this trip with The Grand Canyon Store.  Especially now since despite ALL these problems the company has refused to refund any portion of what we paid. We will never do business with them again and we hope you rely on this review to make an informed decision about whether you want to do business with The Grand Canyon Store when traveling and exploring Flagstaff, Williams, Sedona or The Grand Canyon.\n\nHere is the link to the boat tour we were taken on. It appears as though if you book online, the cost is only $41.77 each (the pricing on the sign inside the office was $49.95)\nhttp://www.lakepowell.com/play/tours/boat-tours/antelope-canyon-.aspx\n\nHere is the link to the Antelope Slot Canyon walking tour we went on. The price is varies from $36 each to $50 each depending on how long you want your tour to last and what time of day you go. http://www.antelopeslotcanyon.com/tours/antelope.html", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": {"lang": "en", "author": "hOrselvr29226, Owner at Grand Canyon Store, responded to this review", "text": "The Antelope Canyon tour was an awesome full day package to include Antelope Slot Canyon with a Navajo guide, and a boat tour into Antelope Canyon from Lake Powell. This tour doe's visit the worlds largest floating restaurant and doe's include a lunch. The lunch includes a deli sandwich with all the dressings , chips, fruit, and a desert snack, along with drinks. It is served as a box lunch to allow guests to later take it onto the boat if they choose.  For reasons still unclear to us this guest became very loud and unruly causing a disturbance to the other 10 guests which included young children, all prior to even arriving to Antelope point. After arriving and taking the boat tour portion of Antelope Canyon it worsened with profanity that could be heard by other guests. This was when I received a call on a Saturday afternoon from our guide telling me the guest was demanding to be brought back. I am sorry this guest had a terrible day and felt he was held hostage. The other guests were interviewed and found to have an awesome day. This tour has been discontinued due to the collapse of hwy 89 until further notice.", "title": "Owner Response", "published_date": "2013-07-26T13:33:10-0400", "id": "169202664"}, "trip_type": "Couples", "published_date": "2013-04-04T10:46:18-0400", "location_id": "1548055", "id": "156615041", "user": {"username": "Daryl M", "user_location": {"name": "Phoenix, Arizona", "id": "31310"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-03", "title": "Great learning experience with an amazing guide!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r155940541-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review155940541", "text": "We went on the inner grand canyon tour and it was a great experience! Our tour guide was David and he was very knowledgable and friendly. The sites were beautiful and we were able to get out and explore near the Colorado River. There was also some beautiful wildlife to see like a great basin snake and big horn sheep. it gets pretty warm down there though so go in the spring time. Definitely worth while!!!! theresa and mike", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-03-28T19:48:52-0400", "location_id": "1548055", "id": "155940541", "user": {"username": "theresa h", "user_location": {"name": "Chicago, Illinois", "id": "35805"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-03", "title": "History, Geology and Nature", "url": "https://www.tripadvisor.com/ShowUserReviews-g60971-d1548055-r155112096-m11068-Grand_Canyon_Store-Flagstaff_Arizona.html#review155112096", "text": "A great tour by our guide Clif! The trip started out with stops along the old Route 66, with stops and points of interest and history of the old railways. The first stop in the reservation was at the Hualapai Lodge for lunch, the Hualapai taco was very good. The trip down to the bottom of the Grand Canyon takes about an hour and a half and our guide was extremely knowledgeable of the geological history of the canyon, and the history of the Hualapai Tribe. The actual bottom of the Canyon where we stopped is a little beach used for the whitewater rafting groups. It's a nice little area, has a couple of picnic tables with shading available. We spent about an hour and a half at the bottom. There are plenty of photograph opportunities along the ride.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2013-03-19T16:39:46-0400", "location_id": "1548055", "id": "155112096", "user": {"username": "slider1632", "user_location": {"name": "Oregon, Ohio", "id": "50805"}}}]}