{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Lovely Boutique Hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r437388338-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review437388338", "text": "We stayed here one night on recommendation of a waitress and a chef in Everglades City and we were not disappointed. The hotel is very well appointed and in a great position for exploring the surrounding area.\n  The valet parking was a bonus which we took advantage of as we were tired after our drive.\n   The room was lovely, clean with good quality furnishings. Check in was efficient and the receptionist gave us good recommendations for eating and drinking in the area.\n   We enjoyed a couple of drinks at the roof top bar with views over the city. We didn't use the roof top pool as it was a breezy day.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-15T02:47:07-0500", "location_id": "1026528", "id": "437388338", "user": {"username": "jackiem", "user_location": {"name": "world", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-11", "title": "Appalled by the lack of customer service...starting with the \"end of the rainbow\"", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r435397089-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review435397089", "text": "I must say that being a local resident and having referred so many people to Hotel Indigo based on it's location and appearance, I am beyond disappointed by the lack of professionalism displayed primarily by the General Manager, Ms. Catheryn O. I stayed at Hotel Indigo for two nights. The first night was a pleasant experience. The second night not so much. I arrived in the room to find the A.C. making a loud screeching sound. It was late in the evening. I called down to customer service and was told that they were unable to accommodate me in a comparable room as they were sold out. However, they offered to have the maint. worker take a look at it. After a significant amount of time, the maint. worker came up to the room (with a strong odor of alcohol) and a not so pleasant demeanor and said he wasn't able to help as it would take hours to replace the A.C. Thereafter, I was moved to another room with a roll a way bed. Unfortunately, this room was also experiencing A.C. issues. However, due to our level of exhaustion and the time of night, we decided to stick it out. I felt it was very important to discuss this matter with management further. I called Sunday morning, after checking out, and I quickly realized what a \"treat\" I was in for. Ms. O was very abrupt and did not listen or validate my concerns regarding my 2nd night at the Indigo Hotel. In fact, she became argumentative and manipulated the conversation. Further, she advised that she was \"the end of the rainbow\" and that I was unable to deal with anyone else regarding my concerns. Being that I paid a decent rate for what I believed to be a high quality hotel, I am extremely dissatisfied with no recourse at all. In fact, I think had she been understanding or simply listened to my frustrations, I would have been accepting of the situation. That was not the case at all. I think it's important to make others aware of my experience and the fact that I will not refer another person to the Indigo Hotel. Respectfully, Liza M.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, Guest Relations Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for taking the time to write to us regarding your concerns.  Hotel Indigo always tries to address all concerns our guests have.  Please note that we called in our \"on call\" engineer after 11 p.m. to address your air conditioner concern. We also moved you to another room as we wanted you to enjoy your stay.  I apologize for any issues you may have experienced and we always try to do our very best in assisting guests with any issues.  We are a lovely boutique hotel and pride ourselves in our customer service.  Please note that we had no other rooms to move you to as we were sold out for the evening. We appreciate you taking the time to write to us and we will be sure to look into the noise level of our air conditioner in that room right away.", "title": "Owner Response", "published_date": "2016-11-10T04:35:07-0500", "id": "436125277"}, "trip_type": "Family", "published_date": "2016-11-07T09:11:27-0500", "location_id": "1026528", "id": "435397089", "user": {"username": "liza7042016", "user_location": {"name": "Cape Coral, Florida", "id": "34118"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Cute Boutique Hotel in River District of Downtown", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r433718693-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review433718693", "text": "The location was perfect for us. Convenient to everything downtown with a parking garage nearby, or the hotel offers valet parking. The bed was very comfortable and clean. There is a coffee maker in the room, and I found the hair dryer tucked in on a shelf below the sink. Also an iron and board in room. No in room bottled water and no mini fridge. We had a corner room with the building and roof view and a tiny sliver of the river visible to the north. We liked the modern update to the room and the way the floors felt on bare feet, but there are grooves in the floor that are hard to keep perfectly clean and my foot found a sliver of a glass shard that must have been missed when cleaning. Keep your shoes on. \nThe Standard restaurant (very good!) is at the base of the hotel as well as a Sushi place. Many other restaurants and entertainment are within easy walking distance. There are also a few bars within the hotel.\nThere is a little business center off the check in desk with two computers and one printer, but only one of the computers works with the printer.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for taking the time to write to us with details of your stay.  I am glad you had a nice time in charming downtown Fort Myers.  Everything surrounding our hotel is within walking distance which makes for a nice stay.  We apologize that you had difficulty with one of our business center computers.  On your next visit please ask our wonderful front desk staff for assistance and they will be able to resolve and address your concerns.  Thank you for staying with us and please join us again on your next trip to Fort Myers.", "title": "Owner Response", "published_date": "2016-11-03T07:09:11-0400", "id": "434294514"}, "trip_type": "Couples", "published_date": "2016-11-01T11:54:18-0400", "location_id": "1026528", "id": "433718693", "user": {"username": "OklahomaMomOf3", "user_location": {"name": "Oklahoma", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Very good Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r431925982-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review431925982", "text": "We booked this hotel for two nights thru Trip Advisor. Booking went smooth and we were satisfied with the booking process and will definitely use it again. Booking was for a Friday and Saturday night and we upgraded to a Deluxe King room and are glad that we did. We arrived several hours early and the room was not ready but the hotel gladly held our bags while we went out to eat. The room was ready by the time promised at 4 pm. Check in went very well and the staff was nice and pleasant and gave us directions to various places to eat. The room was large and had windows on two sides so there was plenty of light. We were on the second floor but the view consisted of the building next door and a rooftop. Maybe upper floors are better as far as a view. I was surprised that there was no refrigerator in the room. Also I was surprised that there was no bottled water in the room as has become standard practice in most all hotels nowadays. There was a coffee maker. The bed and pillows were very comfortable and we probably had the best nights sleep that we had in the last ten days. The air-conditioner was not overly noisy and the room was very quiet. The bath was nice and had a nice large shower. The hotel and room were clean and appeared well maintained tho the carpet in the hallway was showing some wear. The hotel is right at the River District which offers lots of things to do as well as restaurants. There is a bar at the hotel on the ground floor and another on the roof. An ice machine was located next to the elevators on our floor.\nOverall, a very good stay and we will be staying again on future trips to Ft. Meyers.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "We are so delighted that you enjoyed your stay at the lovely Hotel Indigo. We are centrally located which makes it most enjoyable for our guests.  Please know we value your business and welcome you back soon!", "title": "Owner Response", "published_date": "2016-11-03T07:10:59-0400", "id": "434294983"}, "trip_type": "Couples", "published_date": "2016-10-26T12:35:28-0400", "location_id": "1026528", "id": "431925982", "user": {"username": "LostintheCaribbean", "user_location": {"name": "United States", "id": "191"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-10", "title": "Charge to much for nothing!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r428018735-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review428018735", "text": "My boyfriend wanted to have a special going away night because he is leaving for work for a few weeks. I explained this to the hotel clerk prior to booking the room. I told him that we wanted a room overlooking the Caloosahatchee River for a romantic evening.  He told me that that he had one on the corner of the building and charged me $234 for a King Room. When we checked in the room it was bare bones bed and dresser with table and two chairs. The view consisted of a roof top of another building and a wall. There were no amenities what so ever. . No blow dryer,  no little refrigerator. And to top it all off I had bought a new swimsuit for the occasion and the rooftop pool was closed and the bar they have is nothing to be excited about. I asked for a refund within an hour after arrival and they would not give it to me, All they would give us was two drink vouchers for our troubles.This place was a big disappointment!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for taking the time to write us regarding your concerns.  I am surprised you didn't enjoy your corner king room with views of downtown Courthouse and the river. I did speak with our front desk and they informed me that the pool was closed at 8p.m. as our policy clearly states dawn to dusk.  Our pool is opened for our valued guests from 6 a.m. to 8 p.m. daily.  I would like to request that you call the hotel so I may address some of your other concerns.  We have blowdryers in everyroom in our open under the counter dresser in every bathroom.  I did go up and check your room and we do have a blowdryer in that room.   In the future, please just call down to the front desk and someone would be more than happy to come up and show you where all the amenities are located.  I hope you got a chance to enjoy our complimentary amenities tea, coffee and condiment kits, as well as our Aveda product line.  Hotel Indigo also has combs, shaving kits, toothbrushes, toothpaste, make up remover, just incase our valued guests forget something while travelling.  We hope you were able to enjoy our two lounges.  Please feel free to contact me with any other concerns or questions as I want all of our guests to be informed of all Hotel Indigo has to offer its valued guests.", "title": "Owner Response", "published_date": "2016-10-18T07:14:18-0400", "id": "429276978"}, "trip_type": "Couples", "published_date": "2016-10-14T16:59:13-0400", "location_id": "1026528", "id": "428018735", "user": {"username": "Thea W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Great location", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r425438885-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review425438885", "text": "We were pleasantly surprised with how nice the rooms were.  It was more like a small condo than a hotel type room.  We were in a corner room, so we had lots of windows.  We liked the location as it was within walking distance to nice restaurants.  The pool is nice and has a great view from the rooftop.  I would recommend this hotel and will stay there again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "I am delighted that you took the time to write our staff at Hotel Indigo and share your pleasant experience with us.  Our rooms are quite large and do live a lot larger than most Hotel rooms.  Our charming downtown area is vibrant and fun with many great restaurants just one block away.  Hotel Indigo is in a great location for all of our guests can easily walk around without having to drive.  We have great events downtown twice a month with Artwalk and Musicwalk.  Please come and join us again on your next visit to downtown Fort Myers.  Please know we value your business.", "title": "Owner Response", "published_date": "2016-10-18T07:19:21-0400", "id": "429279909"}, "trip_type": "Couples", "published_date": "2016-10-05T16:25:32-0400", "location_id": "1026528", "id": "425438885", "user": {"username": "shannonsnow1", "user_location": {"name": "Naples, Florida", "id": "34467"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "ADP Supported Employment Certification", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r416197754-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review416197754", "text": "A delightful experience! Very Clean, spacious room, free Wi-Fi, Ice machine nearby with nice downtown views. Kelsie at the Front Desk was very professional and also had the courtesy to extend my check out as much as her empowerment allow it. Thank you again Kelsie!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for taking the time to write to us at Hotel Indigo about your recent stay. I am delighted that Kelsie inspired you and assisted you.  We are very pleased that you enjoyed your stay with us and we welcome you back soon!\n\nThanks again!\n", "title": "Owner Response", "published_date": "2016-09-09T09:56:07-0400", "id": "416534284"}, "trip_type": "Business", "published_date": "2016-09-08T10:49:32-0400", "location_id": "1026528", "id": "416197754", "user": {"username": "checksetc", "user_location": {"name": "North Miami, Florida", "id": "34485"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Great location in downtown Fort Myers", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r415728633-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review415728633", "text": "My wife and I recently decided to have a one-night \"staycation\" away from the kids and so spent the night at the Hotel Indigo...our first stay here.  Very nice hotel and overall experience.  First and foremost, the hotel is located right downtown within walking distance of everything in the River District, so plenty of bars, restaurants, shopping, and other sights.  (can get into it from Broadway or First Street).  Trendy, throw-back feel to the entrance through a broad hallway featuring something like paved river stone flooring which I believe is quite old.  Check-in was simple and fast, with a very helpful woman behind the counter.\n\nOur room was very large, with laminated flooring, a large, comfortable bed, flat screen, Kuerig coffee bar, separate living area with sofa, etc...overall very \"throw-back modern\" with an eclectic feel...the room was twice as big as a standard hotel room, with an equally spacious two-sink vanity bathroom and an oversized walk-in closet.\n\nDidn't make it up to the rooftop pool...will make it a point to do so next time (the desk person told me the rooftop bar was not open so I didn't bother wandering up).\n\nOverall a very nice hotel with lots to offer and an excellent location...really aren't many hotel options near downtown, so this one is by far the best.  Didn't mention previously but it was reasonably priced for the accommodations.  Would stay here again and recommend to friends.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Just a quick thank you for writing to us at Hotel Indigo about your recent stay.  \"Staycations\" have become quite popular this season with a lot of our local valued guests just \"getting away\" for the weekends.  I am delighted that you enjoyed your stay, as we at Hotel Indigo strive for engaging our guests and making their stay most enjoyable.  Please come back and join us again soon and bring your friends!\n\nThanks again and please note that we value your business.\n\nBest\nCatherine O'Brien GM", "title": "Owner Response", "published_date": "2016-09-09T09:53:21-0400", "id": "416533474"}, "trip_type": "Couples", "published_date": "2016-09-07T07:51:16-0400", "location_id": "1026528", "id": "415728633", "user": {"username": "JFKazmin", "user_location": {"name": "North Fort Myers, Florida", "id": "34483"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Good stay, but a bit disappointed...", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r412955478-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review412955478", "text": "Found this chilling in my drawer! The front desk and service overall was good.  In general, I thought the room was clean when I checked in.  That's why I was a little disappointed when I found a torn condom wrapper in my night table drawer. I guess it is not a dirty condom. It just makes me wonder what else was not clean and overlooked.  So disappointed. ..it is really a nice hotel otherwise.  ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Dear Ketah, I first want to thank you for bringing up your concern and review on our Hotel Indigo.  I would like for you to please call the hotel and ask to speak to the General Manager regarding your concerns.  I welcome both negative and positive feedback as this improves our customer service.  We pride ourselves in \"best housekeeping\" practices and we want you to know this is not our normal standard.  We apologize and please call the hotel so we may address your concerns more clearly. I have a scheduled meeting with the department to review our inspection process as this has never occurred before as we win awards for our cleanliness and want to be sure our standards remain high.  Please know we value your business and please note our sincere apologies for your concern.", "title": "Owner Response", "published_date": "2016-09-01T06:07:38-0400", "id": "413510125"}, "trip_type": "Business", "published_date": "2016-08-30T19:49:38-0400", "location_id": "1026528", "id": "412955478", "user": {"username": "Ketah D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Anniversary stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r405300271-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review405300271", "text": "My wife and I recently visited Hotel Indigo for our anniversary and loved it. It's very quaint and charming with spacious rooms and proximity to a fun vibrant downtown. Upon check in we spent time at the hotel bar adjacent to the registration and had a great conversation with the bartender. The rooftop bar is unique and the pool is nice however small. But it fits perfect to the style of hotel. I would definitely stay here again! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Dear Valued Guest:\n\nThank you so much for taking the time to email us with your comments about your recent stay at our charming Hotel Indigo.  We are delighted that you enjoyed your stay with us and welcome you back on your next visit to downtown Fort Myers.  Happy Anniversary and please know we value your business.", "title": "Owner Response", "published_date": "2016-08-16T04:05:31-0400", "id": "406066927"}, "trip_type": "Couples", "published_date": "2016-08-14T08:37:05-0400", "location_id": "1026528", "id": "405300271", "user": {"username": "skoteach32", "user_location": {"name": "Cape Coral, Florida", "id": "34118"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "cozi", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r396997707-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review396997707", "text": "I had the opportunity to stay at the Ft Myers Indigo Hotel property this past weekend.  To those who do not know its location, it is located in the downtown area of Ft Myers.  The building was the former post office.  The Location is in the middle of the vibrant night district that is full of bars and food places next to the river.  An excellent location if you enjoy such life, or any life.  The property it self was good to very good, clean and no sign of issues.  They have slow elevators but they appear to be the original ones from the old postal days.  A very modern lobby and very friendly and helpful staff greats one where.  I had the impression they were selected to have a good attitude for the guest.  In todays hosting market, that is important.  There are two bars on the site.  One is in the lobby and the other is on the roof with an exercise center and a pool.  Both bars are smallish but full service.  There was no restaurant on property but several venders were about.  Closes was an Ichiban and a café called Standard.  Both are in the old postal lobby and feet away.  There was also a Starbucks close and a place that looked good for a burger if desired.  The within a few blocks was that vibrant down town area of Ft Myers.  They have on site valet parking but many prefer to use the public garage across the street.  I noticed even the parking staff were very helpful with any need.  I fell that what makes this property apart from many was the attitude and helpfulness of the staff.  One feels good staying here.  I will go back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you so much for taking the time to write a nice review of our charming Hotel Indigo.  We are pleased that our staff helped to make your stay comfortable and inspiring.  Please know we value your business and welcome you back in near future on your next visit.", "title": "Owner Response", "published_date": "2016-07-26T04:58:11-0400", "id": "397353055"}, "trip_type": "Family", "published_date": "2016-07-25T15:57:41-0400", "location_id": "1026528", "id": "396997707", "user": {"username": "FloridaGreenFlash", "user_location": {"name": "Thonotosassa, Florida", "id": "34688"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "A pleasant oasis", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r396454700-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review396454700", "text": "My family enjoyed the simple yet elegant room.  The room was spacious and well appointed.  The roof top swimming pool and fitness room were hits.  The downtown area surrounding the hotel offers different kinds of dining experiences (all good).", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "We are so delighted that you enjoyed your recent stay.  Our charming hotel is a little gem downtown with so much to offer our guests for a great walking city.  We have several great new restaurants and boutiques downtown for all our valued guests to enjoy.  Please join us again for a relaxing and inspiring vacation.", "title": "Owner Response", "published_date": "2016-07-26T04:59:46-0400", "id": "397354022"}, "trip_type": "Family", "published_date": "2016-07-24T21:27:20-0400", "location_id": "1026528", "id": "396454700", "user": {"username": "altosco4", "user_location": {"name": "Tampa, Florida", "id": "34678"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Great hotel within walking distance of many things!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r394812369-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review394812369", "text": "Hotel was very clean and comfortable. Room was spacious and bed was comfy. No complaints, I would gladly stay here again. Rooftop pool/lounge area was really nice as well as it had a great view. There are a lot of dinning and bar options very conveniently located nearby. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "We want to thank you for taking the time out of your busy day to write a review of our hotel.  We are glad you had a nice stay and welcome you back in the near future.", "title": "Owner Response", "published_date": "2016-07-26T05:00:35-0400", "id": "397354530"}, "trip_type": "Business", "published_date": "2016-07-20T12:15:05-0400", "location_id": "1026528", "id": "394812369", "user": {"username": "shughe19", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "Items left behind are missing :(", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r393526192-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review393526192", "text": "I travel often and rely on TripAdvisor reviews when booking my hotels, but have never left a review myself.  This is a first for me - and unfortunately it's not a good one!  I was happy to find this hotel for our recent travel to Ft. Myers.  My husband and I have to travel to Ft. Myers 4+ times in the coming months.   I love the hotel's location, so I was planning to stay there again.    The hotel was ok - definitely not up to other \"boutique\" hotel stays I had had in the past, but it was good enough.   A few minor issues, but nothing that we couldn't live with.  Until.... \n\nI made the mistake of leaving 4 hanging clothing items behind when we checked out.  While still in the car on the long ride home, I realized my error and my husband called the hotel.  My items could not be located in lost and found.  He was told that they would talk to the housekeeping manager the next morning and call us back.   No return call the next morning, so I called after lunch.  The front desk person I spoke to hadn't heard about my missing items so she looked in lost and found again and also checked the room.  They hadn't rented the room since we left, so I was hopeful they were overlooked when the room was cleaned - apparently not.    Her reply to me was \"I'm not sure what you could have done with your items, but they weren't left here\".  Huh????  Just because you DID NOT FIND my items in the room, doesn't mean they WEREN'T LEFT behind!  The lady was rudely \"polite\", but never once apologized, or seemed to care much about my missing items.   When I pressed her further, she reluctantly agreed to contact the housekeeping manager on her cell phone.  After contacting the housekeeping manager, she called me back and once again informed me that \"my items were NOT left behind\".  Argh... so frustrating... I don't have my clothes and I DID leave them there, so please stop telling me that I didn't!\n\nShe didn't seem to care much about my situation so I asked to speak to a manager.   Her reply was - \"I am the manager\".   Oh, great!  After I inquired further about speaking to someone above her, she reluctantly transferred me to the \"office manager\".  This lady was definitely much better than the first person I spoke to.  She actually apologized for \"not being able to locate\" my items and didn't make me feel as though I had done something wrong.....  Bottom line:  I don't expect to ever see my clothes again, but it was nice to at least hear that \"they will continue to look into it and will contact me if my items turn up in the future\".   Definitely won't be going back to Hotel Indigo Ft. Myers!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for alerting Hotel Indigo of your recent concerns with your stay.  I am glad that our Guest Service Manager spoke to you regarding your missing items.  I was informed by 3 of my managers who explained to me that when they received the call that you thought you left some items behind, the room inspectors immediately went to the room.  I apologize but no one has found anything to date.  We have an alert in our lost and found and have checked the room several times.  We have a lot of items in our lost and found and we will continue to try to find your items.  I again apologize for your missing items.  I hope you enjoyed your stay at the charming Hotel Indigo and hope you locate your items.  Thank you again for staying with us and please know we value your business.", "title": "Owner Response", "published_date": "2016-07-28T06:04:38-0400", "id": "398398347"}, "trip_type": "Family", "published_date": "2016-07-17T06:50:28-0400", "location_id": "1026528", "id": "393526192", "user": {"username": "Kari F", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Not bad", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r392336915-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review392336915", "text": "I just had to remake my bed, which has 2 sheets, a blanket, and a comforter, all askew in various ways and tucked in a couple of feet at the foot of the bed.  And the pillows are those tiny little squares the size of throw pillows.  Grr.\n\nI ordered room service from the restaurant downstairs but, it turns out, it is really just in room delivery, so I had to eat my steak with a plastic fork and knife out of a styrofoam container. \n\nI'm just grouchy today.  The room is nice enough.  Shower is lovely and I like the wood floors.  There are no convenient outlets near the bed.  The air conditioner is so loud.  I'm so grouchy.  I'll shut up now.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thanks for your concerns we take all positive and negative views and review them to ensure we make adjustments for all our valued guests.  Our 6 standard pillows each have a different firmness for several options.  I am sorry that you did not enjoy your in room service and will see if they can't bring stronger silverware.  Please feel free to call the front desk when having any concerns that we can address immediately.  Our outlets are on our desks as well as on both sides of our beds.  Please know we aim to please so on your next visit please call our front desk so we may address your concerns to ensure a comfortable and enjoyable stay.  Thank you again for your review.", "title": "Owner Response", "published_date": "2016-07-26T05:04:39-0400", "id": "397357648"}, "trip_type": "Business", "published_date": "2016-07-13T17:52:28-0400", "location_id": "1026528", "id": "392336915", "user": {"username": "nononothankyou", "user_location": {"name": "Saint Augustine, Florida", "id": "34599"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Great downtown location ", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r390256943-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review390256943", "text": "Stayed in a suite\nVery nice\nHuge bathroom and shower \nGreat bar up stairs\nSmall but nice pool\nGreat views\nNight desk gave us a great food recommendation \nWe were there for music walk which is great\nLots of cool places to eat and drink down town\nNew blues bar was fun\nFords garage is really good\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Wow thanks for writing such a nice review.  We are so delighted that you enjoyed our very large bathrooms and our great restaurants downtown.  Please know we value your business and hope you will come and stay with us again in the near future.", "title": "Owner Response", "published_date": "2016-07-26T05:10:48-0400", "id": "397363161"}, "trip_type": "Couples", "published_date": "2016-07-07T19:10:09-0400", "location_id": "1026528", "id": "390256943", "user": {"username": "packers1971", "user_location": {"name": "Fort Myers Beach, Florida", "id": "34231"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Great People, Awesome Location.", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r389432498-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review389432498", "text": "Stayed in Fort Myers just to get away and this was definitely the right place to do it! Staff was very helpful at the front desk. It was nice to have so many options locally. Spent a day on the beach, which was easy to get to from the downtown area then spent the night on the hotels rooftop bar. The bartender was awesome. I will be back here if I ever visit that area again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Just a quick response to thank you for taking the time to write such a great review.  I am delighted that you enjoyed your stay with us and glad you got to experience the beaches and the downtown area.  Our rooftop lounge does have beautiful views and is a great little spot for evening entertainment.  Please note that we value your business and welcome you back to charming Hotel Indigo on your next visit to Fort Myers Florida.", "title": "Owner Response", "published_date": "2016-07-08T05:35:57-0400", "id": "390377812"}, "trip_type": "Friends getaway", "published_date": "2016-07-05T08:51:51-0400", "location_id": "1026528", "id": "389432498", "user": {"username": "meglits", "user_location": {"name": "Ithaca, New York", "id": "47958"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Love it!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r386519676-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review386519676", "text": "I love this hotel and look forward to returning on future business trips!  Great quality and quirky style typical of the brand. Excellent location downtown and walkable to many great restaurants!\n\nOnly downside was the hotel restaurant closed 3 hours early on Sunday! I arrived at 7pm to be told the restaurant & room service was closed early. I was very disappointed as an on site restaurant was one of the reasons I booked this hotel. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for taking the time to write to us regarding your recent stay.  I do apologize that the restaurant in the Post Office Arcade closed early.  I hope you were able to experience some of our new restaurants downtown we now have 4 new ones!  I hope you come back again and experience all that our downtown and Hotel Indigo has to offer.  Please know we value our guests and welcome you back on your next visit to downtown Fort Myers.", "title": "Owner Response", "published_date": "2016-07-08T05:38:23-0400", "id": "390378508"}, "trip_type": "Business", "published_date": "2016-06-27T10:53:15-0400", "location_id": "1026528", "id": "386519676", "user": {"username": "Kristina02a", "user_location": {"name": "Jupiter, Florida", "id": "34335"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Great location but stay somewhere else ", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r380427028-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review380427028", "text": "This hotel sucks. I had high hopes based on the location and a recommendation from a colleague, but I was very disappointed. I checked in and got my key card, but when I got to my room it had not been cleaned yet. The receptionist got me a new room, but really? You don't keep track of which rooms are clean and which rooms are dirty? That being said, the room was decorated nicely and was roomy.\n\nWhen I got to my clean room, there was only one extra power outlet free aside from the outlet in the bathroom. There's not even  an unoccupied outlet at the desk where people plug in their computers. Again - really?\n\nThere was also no hotel info in the room to explain what's in the gym, where it is, etc. I was just generally disappointed. The hotel clerk didn't even know there was an ice cream shop right down the block! At the very least the employees should know the neighborhood where they work!\n\nPass on this place next time you are here.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Catherine O, General Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Thank you for your recent concern with your stay at Hotel Indigo.  We apologize if you were given the wrong room at check in and we hope that your second room met your expectations.  All of our rooms have several outliets.  I apologize if you had called downstairs someone could have come up and showed you where our outlets are.  Upon check-in we review all of the amenities at our hotel including our fitness center, rooftop lounge, and all of our great neighborhood restaurants.  I will be sure to ask why you were not informed and we apologize for this.  The ice cream shop is a closed Yogurt Shop that is now the temporary set up for Starbucks which is renovating, that might be why they didn't know about it because it doesn't exist.  We hope you try us again and we apologize that you were not informed of all Hotel Indigo and its neighborhood has to offer.  Please know we value your business and your concerns help us to improve.", "title": "Owner Response", "published_date": "2016-06-08T08:38:44-0400", "id": "380859678"}, "trip_type": "Business", "published_date": "2016-06-06T18:17:48-0400", "location_id": "1026528", "id": "380427028", "user": {"username": "hrs107", "user_location": {"name": "Washington, D.C.", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Hotel Manager Jessica AWFUL!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34230-d1026528-r380274471-m11068-Hotel_Indigo_Fort_Myers_River_District-Fort_Myers_Florida.html#review380274471", "text": "I am a frequent business traveler and typically a Hilton ( Gold status) or Marriott ( silver elite) as well. I gave the Indigo a try since it was close to the meeting, the night I was staying. The front staff was a nice gentleman when I checked in. I enjoyed my stay and the next day had this Jessica which had a rotten \" polite\" attitude. She should not be working in hospitality. Not flexible at all, a better than attitude. Should not be working there and should not interface with the public. I even gave her the benefit of calling prior posting this review and she would not budge in the after hour check out. I will never stay there again! I would not recommend the hotel to business travelers! ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "IHGService, Guest Relations Manager at Hotel Indigo Fort Myers River District, responded to this review", "text": "Dear Valued Guest,\nThank you for your most recent stay with us. It is regrettable that the staff service you have received prevented you from enjoying your stay. The feedback we receive from valued guests, like you, enables us to target areas that need improvement so we can achieve guest satisfaction. We sincerely hope to welcome you back and serve you better.\n\nRegards,\n\nTracy V.\nCase Manager\nIHGService", "title": "Owner Response", "published_date": "2016-06-27T02:54:44-0400", "id": "386352937"}, "trip_type": "Business", "published_date": "2016-06-06T07:46:26-0400", "location_id": "1026528", "id": "380274471", "user": {"username": "vtomor", "user_location": {"name": "Hollywood, Florida", "id": "34296"}}}]}