{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "A real man's Pedicure!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60903-d10435633-r428231513-m11068-Verbena_Day_Spa-Frederick_Maryland.html#review428231513", "text": "\nA secret destination located in the heart of Frederick, Maryland. If you are traveling about looking for the small city feel of Frederick and realize...... \n\nOMG! My man needs a serious Pedicure..\n\nThen located in the back of Verbena Day Spa... is a small and private destination that offers couple Pedicures. Ask for Boun who originates from the country of Laos. She is the one and only operator of a small, two chair room. \n\nI am a man.... I mean a real man's man and I would never go to a girly place...   so I am not admitting to anything. But let's just say Wow...  what I didn't do was Awesome! \n\nI got to relax, joke around, and even learned some great things to do to keep my feet feeling good. It was great as a couple and so relaxing with Boun. \n\nI would recommend taking your man here to break him in or at least let him know what the girls go through to keep looking pretty. Don't think guys.... just do it.\n\nI mean... I would never as a man... at least admit it during football season.\n\nEl Gato\n\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-15T12:50:16-0400", "location_id": "10435633", "id": "428231513", "user": {"username": "Ron G", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Incredible spa services!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60903-d10435633-r382745637-m11068-Verbena_Day_Spa-Frederick_Maryland.html#review382745637", "text": "My wonderful husband and I spent an amazing, relaxing afternoon at this day spa during a recent weekend away. We both had massages, facials and pedicures. Brianna gave me the absolute best massage I've ever had from a woman. The facials were wonderful and our technician for the pedicures was so charming, friendly and meticulous with her technique. If you would a first class spa experience, pay a visit, but call several weeks ahead.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-15T06:10:26-0400", "location_id": "10435633", "id": "382745637", "user": {"username": "Jill J", "user_location": {"name": null, "id": null}}}]}