{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2009-06", "title": "There isn't a better place to stay in the entire area", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d1209070-r42493812-m11068-The_Gaithersburg_Inn-Gaithersburg_Maryland.html#review42493812", "text": "I have stayed a couple of times on business and work for a federal agency a couple of towns further south. If I can, I prefer to stay in a B&B or Inn even on business. This place is a real find. Beautiful, tasteful, private, quite, peaceful, beautiful grounds, close to restaurants and access roads – just a lovely place and great place to stay for almost any reason. It is a large restored house with just a few rooms, so if you are interested in a quite place you can enjoy this is it!  In terms of value, just check out what hotels charge in the area…value is great. 5 star accommodations at 3 star rates. The last time I was there, the inn keepers had a couple of people over for dinner (I don’t think they actually live there all of the time) one night and I felt comfortable to go in the kitchen to grab a beer while they were all standing around a large butcher block drinking wine and having hors d'oeuvres. Within a few minutes we were all laughing so hard I hated to leave for my dinner appointment. \n\nFriendly, very accommodating, comfortable. I have traveled a couple of times a week for 20 years and trust me this place is great.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2009-09-17T13:06:21-0400", "location_id": "1209070", "id": "42493812", "user": {"username": "RAC22", "user_location": {"name": "Portland, Oregon", "id": "52024"}}}, {"lang": "en", "rating": 1, "travel_date": "2008-10", "title": "Disappointment", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d1209070-r22183662-m11068-The_Gaithersburg_Inn-Gaithersburg_Maryland.html#review22183662", "text": "These people tried to TRIPLE the price (no lie); were intermittently and sporadically rude and PROFANE to my guest (and me) and were simply unprofessional when all is said and done.\n\nBeware!!!  I choose to get married at The Gaithersburg Inn because it seemed like a pleasant and peaceful place to gather with friends and loved ones.  Also, the owners, Terry and Chris Kirtz, appeared so gracious during our first meeting.  They said they would do whatever they could to make our special day a success and seemed so easy going and accommodating.  I was offered a great rate to use the premises for the weekend.  I was paranoid about rain ruining our special day, so I discussed every rain contingency during this first meeting at the Inn.  I must admit that I was surprised and quite impressed by the incredible flexibility that they afforded us.  I was told we could marry inside the Inn or out, eat inside the Inn or out back under a big rented tent, we could dance inside the Inn (with our high heels and on their wood floors), or out under the tent.  Whatever we wanted.  And, while the event was for the most part a success, beware of Chris and Terry!!!  \n\nThe short of this message is that something is wrong with this couple.  Chris, the husband, in particular, has a Jekyll and Hyde personality that is probably diagnosable.  From the day before the wedding, all of a sudden and for no good reason, he snapped at me something terrible and proceeded to STARE ME DOWN, and then, a moment later, was smiling away and being helpful again.  I was shocked.  Then, after the wedding, the stories started rolling in.  Different family members and guests had brief and random encounters with Chris where he cursed at them, scolded them, was rude or just plain inappropriate.  He used vulgar profanity in reference to one of my friends as well.  \n\nThe day after the wedding, Chris and Terry sat me down and attempted to TRIPLE the price.  No lie!!!  They said that they worked during the event and that they were charging me for their labor.  Now, Terry indicated to me IN WRITING well in advance of the event that she would be helping with the food.  Yet, when all was said and done, she wanted an additional $600 for her “labor” and that of her husband, Chris.  They attempted to charge me for trash removal, electricity, you name it?  That is simply unprofessional, unethical and WRONG.  \n\nI NOT ONCE asked Chris or Terry to do anything for our wedding.  To be clear, this was a well organized and executed event.  I am a Harvard Law School graduate, and I organized this wedding down to a “T.”  We had a party of 87 attendants including the bride and groom.  I had family all show up the day before the wedding to do what needed to be done and all of our loved ones did what needed to be done throughout. We had two bartenders, a caterer, and all of the man power we needed.  We had a buffet for appetizers inside the Inn and then a buffet dinner under an outdoor tent during the reception with a wooden dance floor and DJ. \n\nSo, at the end of the day, because I am a lawyer [but beware, so is Chris], I did not agree to pay anything above the agreed upon rate.  But, that was after bursting into tears the day after my wedding with utter disbelief and frustration that people who seemed so reasonable could be so off.  Oh, but wait, they only tried to triple the price after helping themselves (without asking) to left over alcohol, supplies and party favors (I wish I was lying).", "helpful_votes": "10", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2008-11-25T11:59:54-0500", "location_id": "1209070", "id": "22183662", "user": {"username": "MdBride", "user_location": {"name": "MD", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2008-10", "title": "Stay away from the Gaithersburg Inn B&B", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d1209070-r21850635-m11068-The_Gaithersburg_Inn-Gaithersburg_Maryland.html#review21850635", "text": "My girlfriend recently rented the Gaithersburg Inn for her wedding and the owners of the Inn, Chris and Terry Kirtz, initially appeared to be nice and normal.  The day of the wedding, however, they displayed such nasty behavior that it made me think that they might be mentally ill.  Chris, in particular, used profanity on several occasions and called one of the guests names when she politely requested that her soup ladle be returned after the event was over.  Chris and Terry \"volunteered\" their assistance during the wedding without having been asked, and it would have been much appreciated despite the profanity and bizarre behavior, except that they then told my friend after her wedding that they expected to be paid for their assistance.  After my friend returned from her honeymoon, she emailed Chris and Terry to inquire when she could pick up some of her belongings that they had agreed she could leave behind, including some personal effects, and they have yet to respond to any of her emails. \n\nMy own personal experience with Chris Kirtz was so bizarre as to be frightening.  He was rude, profane and just plain weird, and then 10 minutes later was friendly and smiling again, cracking jokes and telling me how nice I looked.  \n\nI am grateful they were not able to ruin my friend's wedding but they managed to have the bride in tears the night of her wedding and the morning after.  It was truly awful and one of the strangest experiences I have ever had to suffer.  \n\nStay as far away from that place as you can.", "helpful_votes": "6", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2008-11-14T09:13:43-0500", "location_id": "1209070", "id": "21850635", "user": {"username": "nebadc", "user_location": {"name": "Washington, DC", "id": null}}}]}