{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Amazing Salad Bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r431890859-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review431890859", "text": "We decided to try this restaurant for dinner. We got there early (4:30) and we're the first ones there. That scared us a bit, but eventually, others began arriving. Early bird specials are quite reasonable and tasty and come with the salad bar, which contains more than 70 items. Service was very good. I would recommend this place, especially if you can get to dinner early.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-26T11:08:01-0400", "location_id": "539686", "id": "431890859", "user": {"username": "knowtrump", "user_location": {"name": "Reading, Pennsylvania", "id": "53518"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Barely Acceptable Food, Unacceptable Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r428984734-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review428984734", "text": "My wife and I ate dinner here on a Monday evening with another couple.  We arrived about 6:30 p.m, and were seated quickly.  Our server, Rebecca, arrived shortly with menus.  She also took our drink order.  She returned a few minutes later with our drinks. The \"fun\" began when we tried to place our orders.  Rebecca just couldnt seem to get our orders right.  We finally felt like she had gotten the orders right, and she left to place the order.  About 10 minutes later, she returned to verify our orders.  She had already gotten one of the orders wrong. We had to correct her.  \n\nThe best part of the Golden Bull was that we were able to go to the salad bar while waiting for the food to arrive.  The salad bar is pretty extensive but several items were not fresh.  Most noteable were the soggy croutons and the wilted lettuce.  Throughout the meal, there were never more than 15 customers in the restaurant.  It was about 10% full.  We soon figured out the reason for this; it had to be a combination of poor service and unexceptional food.\n\nAfter making 2 or 3 trips to the salad bar, we realized that it was more than an hour since our order was taken.  We also hadnt seen Rebecca in at least 30 minutes.  She finally arrived with a basket containing 3 small rolls for the 4 of us.  (We had no explanation for this.)  The rolls were warm and very good, but one of us had to split our roll with the fourth person.  \n\nOne hour and 15 minutes after we ordered, the food arrived.  During all this time, no one offered to refill our glasses.  \n\nAnyway, two people ordered barbecued ribs with a crabcake, one person ordered crab imperial, and I ordered a dish with seafood and pasta.  By the way, one couple ordered an appetizer, stuffed mushrooms.  The food was mostly at the right temperature, the portions were acceptable; not big but not small.  However, I did not get the dish that I ordered.  (What I got was close enough to what I ordered, that I decided not to make a big deal of it.  I did NOT want to have to wait another hour to get the correct dish.)  One person didnt like the stuffed mushrooms, One person thought her ribs were dry.  One person thought the crab imperial was not like crab imperial, and it was very dry.  When the person with the dry ribs asked for some barbecue sauce to moisten the ribs, she was told that there was no more sauce.  (Perhaps that explains why her ribs were dry to begin with.)  My seafood and pasta dish wasnt bad, except that the sauce tasted a bit burnt.\n\nThe place was fairly clean.  The ambience was decent, if a bit worn and outdated.  We finally left, each of us breathing a sign of relief.  Everyone of us agreed to NEVER go back there again.\n\nOne last note: we never saw anyone who looked like a manager throughout the entire meal.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-17T18:46:23-0400", "location_id": "539686", "id": "428984734", "user": {"username": "Charles G", "user_location": {"name": "Silver Spring", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Disappointing for the last time", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r422007446-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review422007446", "text": "The Golden Bull has been around for many, many years, so they must be doing something right, making some people happy - but the last two times I've been here (at the suggestion of others I was meeting) have been very disappointing.  The salad bar offers a lot of variety and I always enjoy that, but it cannot make up for the sloppy (if friendly) service and zero ambiance.  We were four people crowded at a table better suited for two, despite having larger tables available.  We had to keep flagging the waitress down to remove water glasses, bread and butter plates, etc. so  we had room for food and drink.  All this made for an uncomfortable dining experience and I'm just done with this place.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-09-25T04:16:46-0400", "location_id": "539686", "id": "422007446", "user": {"username": "GAIL T", "user_location": {"name": "Washington DC, District of Columbia", "id": "28970"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Best place to eat in Gaithersburg", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r411114614-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review411114614", "text": "Wonderful salad bar, great sandwiches and terrific service.  Their prices for lunch can't be beat.  This is the place to go!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-26T10:55:30-0400", "location_id": "539686", "id": "411114614", "user": {"username": "geniejean", "user_location": {"name": "Clarksburg, Maryland", "id": "41069"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Salad Bar!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r402461229-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review402461229", "text": "They have the best salad bar here; there are over 50 items and most items include it. They also have a really good special daily - I forget what time it ends, but it's very reasonable. You can have prime rib, crab cakes and chicken Parmesan. It includes salad bar, dessert and coffee or tea. I think this is around $15.00. They have excellent service as well and plenty of parking. It's great for special occasions, and they have private rooms.\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-07T09:13:33-0400", "location_id": "539686", "id": "402461229", "user": {"username": "MrPeteVirginiaBeach", "user_location": {"name": "Gaithersburg, Maryland", "id": "41154"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Best food ever!", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r379944528-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review379944528", "text": "Went with family and had a wonderful meal.  Their prime ribs and bbq ribs melt in your mouth. Best salad bar ever.  The service was excellent and food was very reasonably priced.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-05T07:51:08-0400", "location_id": "539686", "id": "379944528", "user": {"username": "Joan G", "user_location": {"name": "Liberty", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "Old school", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r377453978-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review377453978", "text": "We pulled up about 7:30 on Saturday evening to an empty parking lot thinking that we made the wrong choice....not sure why it isn't swamped.\nFood was great (although they had run out of filet mignon)\nWaitresses were awesome, getting everything right on an 8 person order.\nSalad bar was full, fresh and tasty.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-05-28T17:56:10-0400", "location_id": "539686", "id": "377453978", "user": {"username": "FLSTC08", "user_location": {"name": "Owatonna, Minnesota", "id": "43409"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-03", "title": "Horrible Buffet", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r361594050-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review361594050", "text": "I called to make reservation for dinner on Easter Sunday. They failed to tell me that there was buffet and limited menu. All I was told that they close at 7:00. I made a reservation for 5:30. When we got there we saw that the buffet was 29.95 and five entrees ranging up to $36.00. My entire party of five decided to get the buffet. We went into the room with the food and saw the most unappetizing food. The turkey looked like they took the final meat off the frame in strands and mixed it with turkey skin. The roast beef was cut in advance in small pieces. Both looked like remnants of the lunch buffet. The string beans were soaked in liquid and the mashed potatoes ice cold. There was also macaroni and cheese the color of Krafts. The Fried chicken tasted reheated and dry. The manager for the evening refused to look at the buffet when I asked her to look at what is being offered. I call the real manager the next day, he said he would look into it and call me back. It is over a week and no phone call. Three of us ordered off the menu because of the disgusting buffet. The food was expensive and mediocre. I asked for a bake potato but was told I would have to get my side dishes off the buffet. One of my party had a piece of cold dry fried chicken with cold mashed potatoes for $29.95. Please do not go here. I have included pictures that shows the turkey. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-04T13:04:58-0400", "location_id": "539686", "id": "361594050", "user": {"username": "Aoibhliad", "user_location": {"name": "Montgomery Village, Maryland", "id": "41273"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Very nice dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r357993913-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review357993913", "text": "I hadn't been to the Golden Bull for some time but since I found a 15% off coupon for it in this month's Clipper Magazine, I decided to go.  When I arrived, I was surprised that the parking lot was so empty and wondered if the restaurant was still open.  Another person arrived at about the same time and had the same reaction.  Fortunately, the restaurant was indeed open and there were several diners inside.  I did ask the waitress if it was always this uncrowded and she told me that the number of diners on weekday nights was highly variable--sometimes the restaurant was very busy; other times not.\n\nI was very happy that I went because I enjoyed a very nice dinner with a good glass of Cabernet Sauvignon at a reasonable price.  All dinners at the Golden Bull include the 75 item salad bar, which is outstanding.  I made two trips to it, one at the beginning of my meal for a traditional veggie salad and the second at the end of the meal to enjoy a variety of fruits.  I ordered the 8 ounce prime rib which came prepared exactly as I had requested (medium rare) and included a baked potato and rolls.  (There are other side choices such as the \"vegetable of the day\", french fries, etc.  \n\nThe prime rib was very tasty and I thoroughly enjoyed it.  The service was well paced so that I didn't feel rushed.\n\nI will definitely return to the Golden Bull sometime soon and suggest that you give it a try.  By the way, they also have very good crab cakes plus an extensive list of other entrees.  If you can get there early, before 5:30 PM, you will benefit from the early bird special which includes the 8 ounce prime rib that I had, plus a starter and dessert for approximately $15.95.  This is a terrific deal.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-03-23T16:44:46-0400", "location_id": "539686", "id": "357993913", "user": {"username": "EDC310", "user_location": {"name": "Gaithersburg, Maryland", "id": "41154"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-02", "title": "Ambience", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r348572039-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review348572039", "text": "One of the last restaurant that serves true prime ribs. It a cozy, quiet place away from noisy bars where you can actually hold a private or intimate conversation without having to yell at each other. Their 75 piece all you can eat salad bar is fresh. Its a bit pricey but if you catch their early bird dinner at $15.95 its well worth the price. It includes salad bar, for the main meal you have a choice between a large prime rib cooked to your specifications, chicken linguini or crab cakes served with rice pilaf, baked potato or mashed. The dessert is a choice between chocolate mousse or sherbet served with coffee or tea.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-02-17T10:03:28-0500", "location_id": "539686", "id": "348572039", "user": {"username": "Luis G", "user_location": {"name": "Gaithersburg, Maryland", "id": "41154"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-01", "title": "Funeral reception", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r343347605-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review343347605", "text": "STOP before considering using Golden Bull's banquet hall for your next event.  Their  technology to project pictures from DVRs or a thumb drive or a laptop is non-existent.\n \nOnly one young gentleman (he'll know who he is, because I gave him this feedback) was helpful, he looked for a remote for their TV so we could play the DVR on their DVD player for an hour without finding it.  The rest of their staff are useless and unhelpful. For the first half hour, only 1 person, the very busy bartender was around for the huge party.  \n\nThe Manager on duty yesterday is EXTREMELY rude.  After advising my brother-in-law a few days ago all was ready with the set up for the projection of pictures, this Manager said to one of his \"IT Managers\" (who knew nothing, I'm in IT) right in front of us \"why are you sorry, it was on them to bring a projector\".  One, we were not advised to do so.  Two, who has projectors?  Three, after the amount of money spent there, your guests have to buy outdated technology at $600 or rent one?  Where do you find those, 1999?\n\nThe food's good. However, having a funeral reception there yesterday with many guests, the parking lot still had much snow, the banquet room still had a Christmas tree and 2016 New Years' balloons and decorations. With missing and broken decorations.  Nice for a funeral?  I think not.\n\nI used to hold GHS football banquets there, have been there for a wedding, a funeral wake,\nand three recent work holiday parties.  Never in all this time was the place so mismanaged and unorganized.  I work for an international firm with a large presence in Gaithersburg,\nall the Admins will hear about this when asking my opinion on their planning of future corporate events, and I will suggest they spend a little more for a nearby hotel to get 10 times the service and the atmosphere. I volunteer for a nationwide organization, they too will hear about the Golden Bull banquet hall having gone down hill so fast. In all my 35 years of going there, I find it a crying shame for a Gaithersburg institution.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-01-28T08:13:49-0500", "location_id": "539686", "id": "343347605", "user": {"username": "Martha T", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-12", "title": "Retro is Great, But for Pete's Sale, Update!", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r336227216-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review336227216", "text": "Our office staff was taken to the Golden Bull for a holiday lunch. Prior to going, we read reviews on Trip Advisor so based on that, we weren't expecting much. And we weren't disappointed. \n\nThe atmosphere is dated, the restaurant has an \"old\" funny smell, the furnishings are definitely 70s and need some serious cleaning, and the service was adequate. \n\nLet's start with the atmosphere: At one point in time, the Golden Bull was \"the\" place to go. In the 70s. And nothing has changed. I can dig retro, but this place needs serious updating -- keep the 70s look, but for heaven's sake, spend some money and get an overhaul underway. It's desperately needed to freshen the place up and get back on the charts. The Golden Bull has potential, but it needs lots of TLC and care. No one can rest on their past laurels. We were placed in a small bar and the overall atmosphere in there was dim...\n\nFood: Adequate. I ordered the crab cake dinner. Received two small cakes that were smaller than my fist and overdone vegetables. I had heartburn throughout the balance of the day. Two of my colleagues ordered prime rib (ok) and crab cakes as well (they weren't impressed). We also ordered the sweet potato fries which the waitress forgot, and they came at the end of the lunch - over fried and dried. \n\nOh yes. The Famed Salad Bar. We were expecting something grand and expansive. Not so much. Same general fair that you would get at any salad bar at Ruby Tuesdays (actually Ruby Tuesday's Salad Bar is GREAT!) with lots of items repeated and placed in different spots on the bar spread. \n\nStaff: Our experience with the wait staff was odd. It took a long time to get refreshments. The water was super poor quality. We took one sip and some of us couldn't drink it. The food order took extremely long to get out, and there was definitely tension between our two wait staff. They literally began to bicker in front of us saying to each other, \"Did you get the other order like I asked?????\" \"SORRY, I didn't REALIZE I was supposed to do your job.\" Odd, right? \n\nThen a different waitress came to our table and started to rush us out, saying she was told we were on a tight time frame. (We weren't, but after everything we experienced, we WANTED to get out of there.) Her initial demeanor was snarky (I think she didn't mean to be, but just came across like that). Eventually she softened. Coffee and dessert came (pecan pie -- it was ok) and we left. \n\nAll that to say, it was the most dismal place to have a holiday luncheon and none of us would return. Ever.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2015-12-31T06:17:18-0500", "location_id": "539686", "id": "336227216", "user": {"username": "Zehndi", "user_location": {"name": "Baltimore, Maryland", "id": "60811"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-12", "title": "Past it's Prime", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r335569413-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review335569413", "text": "Once a great steakhouse of the past, this dated restaurant is past it's prime. We went for a family reunion, the facility itself is dated and on our visit not many patrons. The menu is primarily meat dishes, prime rib being the specialty. Each meal comes with a salad bar. This a fairly good variety of toppings, including some quite unusual offerings, such as chocolate chips and coconut? Good thing for the salad bar, as it took well over an hour for our meals to arrive. Surprisingly, as there was only one other party in the restaurant when we finally were served. The prime rib was very fatty. The large serving size was 1/3 fat. All in all, there are probably better steakhouses with better service and food for the price.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-12-28T16:59:40-0500", "location_id": "539686", "id": "335569413", "user": {"username": "christina T", "user_location": {"name": "Corvallis, Oregon", "id": "51817"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-12", "title": "Great food and amazing salad bar at the Golden Bull", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r334636930-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review334636930", "text": "We went to the Golden Bull on a Thursday in December for their crabcake and prime rib dinner.  The salad bar is very good with many choices.  I read that they had discontinued eggs and bacon bits, and this is true.  But there are many items to choose from on the salad bar and all were fresh, full and nicely displayed.  We did receive hot rolls at our table.  There were two parties of at least 20 people each in the middle of the dining room.  It appeared that there were only two servers on staff.  So service was a little slower than in the past, due to the large number of customers.  It is the holiday season, so I understand that wait times are a little bit longer than normal.\n\nOur meals were huge!  The crabcakes were fantastic, like always.  No filler, all backfin crabmeat with just the right seasonings.  We were so full after having the salad bar and the crabcake, we took most of our prime rib home for another meal.\n\nWe will definitely go back to the Golden Bull.  We saw many diners there getting the early bird specials, so we may try that next time.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-12-23T08:39:03-0500", "location_id": "539686", "id": "334636930", "user": {"username": "mindyroo", "user_location": {"name": "Maryland", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-11", "title": "Seems to have slipped a bit", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r333020301-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review333020301", "text": "We've been going here for the gigantic Thanksgiving feast for several years.  It's still pretty good, but no longer as good.  There are noticeably fewer items in the salad bar and a smaller selection of vegetables, they kept running out of dark turkey meat, the roast beef was OK but not great, the sauce on the salmon was uneven.  When my daughter asked for salmon without the sauce, since the sauce apparently contains gluten, the fish she got was pretty tasteless.  Still better than cooking -- and cleaning up! -- at home, though.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-12-15T08:01:18-0500", "location_id": "539686", "id": "333020301", "user": {"username": "Doug S", "user_location": {"name": "Annandale, Virginia, United States", "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-12", "title": "Cavernous facility, conspicuously empty", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r332861971-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review332861971", "text": "Arrived for a corporate holiday luncheon, and found only a handful of patrons there aside from the room we had scheduled.  The facility itself was tired, as though the owners had given up on anything more than emergency plunging of the toilets.  It's not that the place was dirty, so much as musty.  The servers had a tough time keeping up with the empty buffet trays, and our crowd wasn't that large.  The pitchers of soda and tea were warm, despite a large tray of ice nearby - poor recompense.  The person serving the prime rib didn't seem to have a clue on how to do so.  I'm sure if you're bringing a football team from the local high school, no one would much care about the ten thousand little things that seemed to have slipped; but for the rest in the dining majority, there are plenty of cheerier and attentive venues within just a few blocks.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2015-12-15T02:04:05-0500", "location_id": "539686", "id": "332861971", "user": {"username": "Mark G", "user_location": {"name": "Falls Church, Virginia", "id": "57722"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-11", "title": "Amazing Deal if you go for early bird", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r329072476-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review329072476", "text": "The early bird special from 4:30pm-5:30pm is definitely worth the trip. We went after the movie and it worked out just perfectly. The early bird prix fix menu is $15 which includes unlimited salad bar, prime rib or salmon and desert. If the timing works for you, this is the place to go for the succulent prime rib. We enjoyed the dinner very much and the service was great too", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-11-25T13:12:27-0500", "location_id": "539686", "id": "329072476", "user": {"username": "Nicole H", "user_location": {"name": "Washington DC, District of Columbia, USA", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "Outdated building and decorations but food is excellent", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r325381002-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review325381002", "text": "I've been here many times, glad have time to write a review. The famous salad bar is great but noticed bacon bits and eggs were missing. The prime rib and pork ribs are my favorites. Over the years, the salad bar did not keep it's original standard but still pretty good. The place is ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-11-08T18:43:11-0500", "location_id": "539686", "id": "325381002", "user": {"username": "adac1121", "user_location": {"name": "Oceanside, California", "id": "32815"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-10", "title": "Took a chance", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r322795749-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review322795749", "text": "A bit of a dissapointment, the service was somewhat slow, but ultimately the service staff was very friendly, the food was over spiced and the protein (chicken) was probably previously frozen. The salad bar which is the cornerstone of this establishment looked inviting and seemed plentiful but it had many duplicate items in different areas and had varieties of itself. Everything on the bar was fresh and tasty as was the warm bread served at the table. The prices were a bit high but considering the salad bar it was economical. The decor and ambiance gets a five star on its own.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-10-28T18:10:30-0400", "location_id": "539686", "id": "322795749", "user": {"username": "Fres T", "user_location": {"name": "Smithtown, New York", "id": "48628"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "I tend to forget about this place", "url": "https://www.tripadvisor.com/ShowUserReviews-g41154-d539686-r317449416-m11068-The_Golden_Bull-Gaithersburg_Maryland.html#review317449416", "text": "We had the stuffed mushrooms, onion soup, the pork chops and a burger. All were delicious. The huge salad bar is enough on its own.\nThis place does a lot of weddings and banquets due to its size.\nThe coupons and early bird specials appear to be a great deal. A flyer in our mail reminded us of this place and we are glad we came back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-10-09T22:50:49-0400", "location_id": "539686", "id": "317449416", "user": {"username": "ricflairnwa", "user_location": {"name": "Gaithersburg, Maryland", "id": "41154"}}}]}