{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Fantastic setting", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r437647731-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review437647731", "text": "The location, setting, movie screen, furniture, open kitchen – all looks very nice! Also staff is extremely friendly. The food is good, not great – I was not that impressed about angry lobster and the filet mignon (which was kind of dry) but the overall dinner experience was splendid, so still a 4* experience.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "SavertFamily\n   Enjoyed reviewing your visits around the world and we are grateful that you visited us at Webb Custom Kitchen. Your reviews are very strict and we are glad that we are rated among some of the highest in your world trips. We hope that when you join us again that we can earn that elusive 5th star.\n\nSafe Travels!\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-16T14:20:57-0500", "id": "437924675"}, "trip_type": "Business", "published_date": "2016-11-15T16:10:41-0500", "location_id": "9731636", "id": "437647731", "user": {"username": "SavertFamily", "user_location": {"name": "Zeist, The Netherlands", "id": "227923"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r437244040-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review437244040", "text": "Been here several times and food and service is always excellent.  Have referred several friends and they have enjoyed it as well.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "861crystalh\n  We thank you for supporting your neighborhood and helping us grow this City. We have a one of a kind atmosphere and a one of a kind staff. \nHope to see you soon.\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-15T10:11:17-0500", "id": "437567542"}, "trip_type": "Couples", "published_date": "2016-11-14T15:32:40-0500", "location_id": "9731636", "id": "437244040", "user": {"username": "861crystalh", "user_location": {"name": "Gastonia, North Carolina", "id": "49156"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great dinner. Try the angry lobster", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r437236599-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review437236599", "text": "Nice place nice setting great food. Try the angry lobster appetizer. Can't wait to get back and for them to open for lunch.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-14T14:56:59-0500", "location_id": "9731636", "id": "437236599", "user": {"username": "William D", "user_location": {"name": "Gastonia", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Superb in every way!", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r436595487-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review436595487", "text": "We had a 6:30 reservation with another couple. We arrived first. There is valet parking, we exited the car, the door was held open for us and we were greeted by several people. We were seated at our table and had drinks while we waited for the other half of our party. I had the High Society Martini (I highly recommend this tasty drink), my husband had beer and we looked over the amazing menu and admired the really funky interior of this place...so different than your average restaurant. The menu is really nice. There is a huge selection and you'll have difficulty choosing something because everything sounds amazing If you can't find something you like on this menu, there is no hope for you. We were waited on with superb professionalism and friendliness and not only our waitress but other wait staff would pop by on occasion to talk to us as well. As we waited for our appetizers; we split 2 of them...the mozzarella wrapped in romaine and the cheesy bread....both were little bites of heaven, we enjoyed our bar drinks and watched food being delivered to other tables around us and our eyes were popping out of our heads. Everything looked amazing...so well presented. The time between courses was absolutely perfect. We never felt rushed. My husband had the tuna. I opted for the crab stuffed trout which was served over fried green tomatoes. There was SO much lump crab in there, it tasted like heaven. I opted to upgrade my side to the Quinoa Salad and that was delicious. My entrée and salad were such a generous portion that I took almost half of it home. (It tasted great reheated!) We were so full, but the dessert selection sounded too good to walk away from, so the 4 of us split one...it was a pineapple upside down cake with cheesecake in the middle. Yeah...no words to even describe how good that was. If you are in the Charlotte area, do NOT miss this place. It's fabulous. I can't wait to go back!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Halos\n   Thank you for the outstanding review and the high accolades of this great city of Gastonia. This is truly a one of a kind gem and we are truly grateful for the associates that help to create the memorable experiences for our guests. We appreciate the short journey for Charlotte and hope we see you again soon.\n\nBest Wishes\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-15T09:49:16-0500", "id": "437560373"}, "trip_type": "Couples", "published_date": "2016-11-12T06:27:56-0500", "location_id": "9731636", "id": "436595487", "user": {"username": "Halos", "user_location": {"name": "Charlotte, North Carolina", "id": "49022"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Great all around!", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r436334833-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review436334833", "text": "I brought my husband for a birthday dinner.  Loved the atmosphere, service and food.  The filet medallions were especially yummy!  Our waiter Dillon was wonderful.  We are very lucky to have a restaurant like this in Gastonia.  It felt like a restaurant in Vegas, but much more reasonable in price.  We will be back with friends and family!  The Birthday card was a nice special touch!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Kathleen S\n   Tell your husband happy birthday from us. A unique point of interest in the card we gave you: It is a combined effort of three business in an attempt to offer our guests best wishes. Although the card was given to you at Webb Custom Kitchen, it was created by local hand made stationary store Hive on Main St. The paper puck cut in the shape of a honey comb is laced with Lemon Basil and Arugula seed from Fords Seeds on Main St.\nYour support of this local business also supports this great community.\n\nThank you again for helping us grow this City\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-15T10:01:59-0500", "id": "437564637"}, "trip_type": "Couples", "published_date": "2016-11-11T03:21:18-0500", "location_id": "9731636", "id": "436334833", "user": {"username": "Kathleen S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Weekend night dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r435886859-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review435886859", "text": "This is not a bad restaurant but not a great one either.  I think it could be great with some improvement.  My husband and I dined here and were seated upstairs  The view is great but where we were seated was horrible.  It was against the wall where the servers came to ring up orders, close out checks, etc.  It was constant the whole time we were there.  That really didn't leave a lot of quiet \"date night\" dining.  I would really recommend just taking this table out.  You are giving up room for two diners but it would be a great improvement.  This is an old theatre so there is a movie \"no volume\" which is constantly running on the big screen.  That is pretty neat.  My husband had a filet which was ok and I had crab cakes which were not really that great.  Not sure I am in a great hurry to go back here but if in the area, choices are pretty small. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Kecia W\n   There are many pieces that create a dining experience. Often when one does not meet ones expectations it can cast a shadow on the remainder of the dining experience. Seating is a very personal choice. If by chance you are seated in a location that  is not to your liking, please let us know. If an alternative location is available we would gladly move you.  \n   The same goes with your food. You chose two of our most popular and highly rated items that our guests prefer. Our beef is all C.A.B. (Certified Angus Beef) the top 30% of all choice beef aged over 30 days for tenderness and flavor. Our Crab cakes are 95% Crabmeat with little filler. That being said, let us know that you did not prefer our preparation and we will find a suitable substitution for you. \n\n   We have over 40 selections and usually two daily feature. We would rather do several items well than do a multitude of items mediocre. \n\n   This is your review and I welcome your comments. I could understand if a restaurant has several negative comments on ones dining experience the need to decry a comment of hesitation of coming back.  But I need to let you know what that means to a business. A critique on food and service is very informative and welcome. Would be a tough world if we made up our mind on just one experience But encouraging someone not to return does several things, it removes the life blood required to keep a business and the 45 staff members alive. It could potential end in a vacancy of that business. If you care about that business let the manager or owner know of your concerns. The caring business will listen and look to accommodate. The lesser businesses will continue their ways. Imagine how you would like to be treated if you were in business, you seem like the type of person that would like know.\n\nBest wishes and hopeful you will return.\nJim Morasso\nOwner/ Webb Custom Kitchen\n", "title": "Owner Response", "published_date": "2016-11-11T13:11:07-0500", "id": "436456559"}, "trip_type": null, "published_date": "2016-11-09T08:39:07-0500", "location_id": "9731636", "id": "435886859", "user": {"username": "Kecia W", "user_location": {"name": "Charlotte, North Carolina", "id": "49022"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Even if you don't live near Gastonia, it's worth the drive.", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r435216134-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review435216134", "text": "The restaurant is in the former, Webb Theater which opened in the 20's.  The building is fantastic.  High tin/wood ceilings with interesting details.  The kitchen sits where the stage was for the theater.  If you sit on the two levels of the balcony, you're looking right into the kitchen.\n\nThe restaurant has some of the same partners and executive chef as Epic Chophouse in Mooresville.  Great attention to detail on everything from the appetizers, to the entrees and even the side dishes.  All tasty and presented in an appetizing manner.\n\nThe servers are friendly and informative.  The pace of the meal was great.  My wife is a vegetarian and always raves about her meals here (we've been three times now).\n\nOne suggestion would be to upgrade/update the cocktail menu.  If you're going for \"Custom\", don't serve me a featured drink with Jack Daniels, Fris Vodka or Watermelon Pucker (Sex In The City is off the air!).  Come on, give me a taste of something truly, \"Custom\".", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Mark-in-NC\n   Thank you for visiting this and my other restaurants in North Carolina. I will take your Craft drink comment under consideration. We do change them with each reprinting. We really appreciate your support of this local restaurant and the great team that helps to \"Make it happen\".\n\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-08T11:41:39-0500", "id": "435685599"}, "trip_type": "Family", "published_date": "2016-11-06T18:27:43-0500", "location_id": "9731636", "id": "435216134", "user": {"username": "Mark-in-NC", "user_location": {"name": "Charlotte, NC area", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Halloween escape", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r433574472-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review433574472", "text": "We have been waiting for a 'special' occasion to try out the Webb Custom Kitchen.  And what better excuse to get out of the house than Halloween.  You can tell right away from the valet parking attendant until you're seated that this restaurant is classier than all the rest found in a ten mile radius.  \n\nService was excellent and both the assistant manager and manager stopped by our table to make sure everything was perfect.  Our server, Andrew, was very attentive and replenished anything that needed to be. \n\nWe started with dirty martinis with olives stuffed with blue cheese.  We chose the bar vodka not being too picky.  Perfect.  We were so pleased with the vodka we inquired what brand they used.  It was Fris. Will look for it at the ABC store.\n\nI ordered the queen cut prime rib with a baked potato.  The meat was absolutely delicious and tender enough to melt in your mouth.\n\nMy wife ordered the crab cakes and liked them very much.  Toward the last couple bites she said she wished there was a little more sauce on them, but by then it was too late.\n\nThey had a lot of interesting other items on the menu for our next visit, but that prime rib is going to be hard to pass up.\n\nThey weren't too busy, but the manager said it was probably due to Halloween.  He said on weekends there is a wait list.\n\nWe will be back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "RSpicer\n   Webb Custom Kitchen is very fortunate to be included in one of your 350 reviews. We couldn't ask for a better overview of your experience. We hope that you stop by again when you are in the area. \nBest Regards\nJim Morasso & Chef Jon Spencer\nOwners / Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-06T09:20:56-0500", "id": "435121855"}, "trip_type": "Couples", "published_date": "2016-11-01T06:06:30-0400", "location_id": "9731636", "id": "433574472", "user": {"username": "RSpicer", "user_location": {"name": "Gastonia", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Solid Experience at Bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r433296820-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review433296820", "text": "My friend and I ate and had a couple of drinks at the bar.  First - bar staff very friendly, appropriately attentive and had good information about drinks.  Good draft beer choices and wine-by-the-drink choices.  Super selection on the menu, with choices of various meats and entree's versus a couple of sandwiches.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Rick H\n   We have a wonderful team here at Webb Custom Kitchen. My bar team takes pleasure at crafting a great cocktail and making sure the dining experience is just as well executed at the bar as it is in the dining room. Looking forward to your return and the opportunity to earn that elusive 5th star.\n\nBest Regards\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-11-01T10:46:32-0400", "id": "433686504"}, "trip_type": null, "published_date": "2016-10-31T10:01:23-0400", "location_id": "9731636", "id": "433296820", "user": {"username": "Rick H", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "A Gem!", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r432373466-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review432373466", "text": "We returned to this old Webb Theater that was converted into a restaurant after it changed ownership. We were not disappointed at all. The food and service were both wonderful. We will be back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "mauten85\n   Thank you for the wonderful review. We also appreciate the way you support the local restaurants in the Gaston area with all of your helpful reviews. We are very grateful for your last sentence!\n\nBest Regards\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-29T13:43:13-0400", "id": "432759787"}, "trip_type": null, "published_date": "2016-10-28T04:44:01-0400", "location_id": "9731636", "id": "432373466", "user": {"username": "mauten85", "user_location": {"name": "Charlotte, NC", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "The Best Restaurant in Gastonia", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r431521278-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review431521278", "text": "Friends invited us to this converted movie theater and told us it was special. They were right. The place is beautiful, the staff was professional, attentive and pleasant, and the food excellent. Our server was a special young lady genuinely concerned that we have the best dinning experience possible. The bartender knows how to make a perfect Rob Roy (a rarity in the south). Everything on the menu from top to bottom is appealing, and what we ordered was superb. I could describe each dish our party tried, but this review would be too long. Summed up: if you want the best dinning experience between Charlotte and Shelby in NC, go to Webb Custom Kitchen.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "PGinNC\n   We are grateful to be included in your 598 TripAdvisor reviews. We have a great team that makes us successful here at Webb Custom Kitchen. We will certainly pass this review onto our staff during our daily lineup.\nOur best wishes\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-26T14:43:02-0400", "id": "431962569"}, "trip_type": null, "published_date": "2016-10-25T07:21:49-0400", "location_id": "9731636", "id": "431521278", "user": {"username": "PGinNC", "user_location": {"name": "Arden, North Carolina", "id": "29871"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Food and Service is Awesome but Host Lacks Professionalism", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r427428862-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review427428862", "text": "First of all let me say how awesome this place is and how much I love it!  I am not going to allow one person to give you all a bad name but as a local I hate to see what should be the face of your restaurant ruin it. I love the service we often get from the bar to the table. The food is also amazing but the one thing that has remained consistent when we have visited lately is the lack of professionalism by one particular host staff. As we sat close to the bar on Monday the same hostess stood at the bar for probably 20 minutes talking to a customer. She was laughing and touching the customer as well laughing hysterically while flipping her head over. This is not the first time we have witnessed her lack of professionalism. As a female I do not like to be referred to as \"you guys.\" With that said please keep up the good work with the bartenders and servers as they are awesome. I just hate for one person to ruin it!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "bej4274\n   Very grateful for the 5 star review and we are extremely grateful for your observation. There are so many touches to create an enjoyable experience. We shared your observations with my entire host staff. It was a good eye opener for the team and it was very well received.  As your previous experiences have shown you, we care deeply about our service for our guests and we will always strive to be the best.\n\nOur best wishes and hope we see you soon.\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-15T14:21:25-0400", "id": "428251840"}, "trip_type": "Business", "published_date": "2016-10-12T15:58:18-0400", "location_id": "9731636", "id": "427428862", "user": {"username": "bej4274", "user_location": {"name": "Gastonia, North Carolina", "id": "49156"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Really enjoyed", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r426500523-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review426500523", "text": "Ate here while overnighting in Gastonia on way to DC. Very good food! Service was ok except a couple of slip ups - got no water, got no bread (not sure they even serve bread), asked for baked potato with just butter got it with \"the works\" but did not want to wait for a correction. Rest of service and great food off set these minor slip ups. Great onion soup, great baby back ribs. Great dessert- upside down pineapple \nCake with cheese cake in middle! Decadent? Yes but delicious! Neat decor - old movie theater- show old movies but could not see from our seats. Highly recommend this place! (Unless you expect bread!)", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "rmgilliard\n   Thank you for the great review but also for the list of details we could do better with. The details about water and accuracy of your order are very much appreciated and we addressed them in our daily lineups. Bread service is available on our menu as an assorted artisanal selection for $2.95. With todays focus on gluten and just wasting food, we felt it would be better to offer a great assortment for those who would  enjoy bread (Like me), and rather than increasing the menu prices across the board, we would rather offer a minimal charge. We hope you pass this way again in your travels and visit us soon.\n\nBest Wishes\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-11T13:52:48-0400", "id": "427069534"}, "trip_type": "Couples", "published_date": "2016-10-09T16:23:40-0400", "location_id": "9731636", "id": "426500523", "user": {"username": "rmgilliard", "user_location": {"name": "Bainbridge, Georgia", "id": "34760"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Wcoleonhardt ", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r425963497-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review425963497", "text": "Great!! Service and food excellent!! Definitely will come back. Valet parking. Be sure to ask about the history of the restaurant. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "wcl63\n   We love that you are fascinated in this wonderful building as we are. The great food, beverage and service are certainly enhanced by the beauty of this vintage theater. \nSafe travels and we hope to see you again soon.\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-11T13:56:34-0400", "id": "427070222"}, "trip_type": null, "published_date": "2016-10-07T14:35:55-0400", "location_id": "9731636", "id": "425963497", "user": {"username": "wcl63", "user_location": {"name": "Greenville, North Carolina", "id": "49181"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Excellent ", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r425457262-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review425457262", "text": "Excellent good and service. Part of a business party. Welcomed and well served wait staff. \n\nFavorites include salmon and NY strip were served. Delicious. Good mix of beer and wine. \n\nPrices were competitive. \n\nHighly recommended!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Strowd1\n   It was a pleasure serving you group the other night. The team here is committed to taking care of our guests either in large groups or one guest. Grateful to have you spreading the word about this great Restaurant and this Great City.\n\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-06T13:01:53-0400", "id": "425680245"}, "trip_type": "Business", "published_date": "2016-10-05T19:13:48-0400", "location_id": "9731636", "id": "425457262", "user": {"username": "Strowd1", "user_location": {"name": "Kings Mountain", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Dinner with daughter", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r425150672-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review425150672", "text": "We made reservations for a party of five on a Saturday night. When we arrived we were greeting by everyone that works at the restaurant. We were seated right away at our table. The waiter came right away and took our order, The food and drinks were fantastic. It was one of the best meals I have had in a long time. I will definitely come back when in town.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "jordashdad\n   Webb Custom Kitchen was designed to enjoy great conversations, special occasions with the idea of Great memories. We are so grateful that we were able to be a part of your week end and we look forward to you visiting us again.\nBest Regards\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen ", "title": "Owner Response", "published_date": "2016-10-05T08:33:42-0400", "id": "425326434"}, "trip_type": "Family", "published_date": "2016-10-04T14:55:21-0400", "location_id": "9731636", "id": "425150672", "user": {"username": "jordashdad", "user_location": {"name": "Huntingtown, Maryland", "id": "41197"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Upscale and romantic", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r424246997-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review424246997", "text": "The ambience is fun. We ate on the balcony, and enjoyed the classic cinema backdrop and watching the chefs. Service was excellent. The steamed artichoke appetizers were lovely. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "AmandaGreen64\n   We always love it when someone from the neighborhood joins us for dinner. Thank you for supporting the Webb Custom Kitchen and this great city of Gastonia.\nHope we see you again soon\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-10-05T08:29:35-0400", "id": "425325380"}, "trip_type": "Couples", "published_date": "2016-10-01T18:58:27-0400", "location_id": "9731636", "id": "424246997", "user": {"username": "AmandaGreen64", "user_location": {"name": "Gastonia, NC", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Pork Chops", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r417974139-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review417974139", "text": "I haven't eaten much beef recently so I opted for the pork loin at Webb's and it was fabulous.....FABULOUS.....tender and so tasty.  The mixed drinks had juice in them and were worth the money; the wine (by the glass) was good as well.  There were 7 of us and everyone enjoyed their evening.  It was my first trip, but I am certain I will return.  Very good indeed, and a vast improvement over the previous restaurant.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "Mike S\n   You are dead on about our pork chop. One of our most popular dishes that leave you full and happy! We pour an 8oz pour (1/3 of a bottle) in our wines by the glass and pour a generous 2oz premium pour in our mixed drinks (who ever liked a 1 1/4 oz pour that most restaurants serve?) \nCome back and see us soon.\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-09-20T14:59:14-0400", "id": "420666799"}, "trip_type": "Business", "published_date": "2016-09-13T06:22:01-0400", "location_id": "9731636", "id": "417974139", "user": {"username": "Mike S", "user_location": {"name": "Gastonia, NC", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Do Not Let The Name Fool You", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r417857498-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review417857498", "text": "I feel like the name of this establishment does not do justice to this restaurant. This is a top notch place to eat. Our experience was nothing less than spectacular. We went there for our anniversary. The atmosphere was very romantic and the service was five stars.  The portions are huge and the food was delicious!!!!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "maryann207\n   We thought long and hard about the name and realize that it may take some time getting use to. The \"Webb\" comes from the last name of the pro golfer that opened this grand building as a movie theater in 1927. The word  \"Custom\"  speaks for the chef driven menu and the last part \"Kitchen\" harkens back to great memories from childhood to present that take place with friends and families in a kitchen. We are so glad that you got to dine with us the other night and we hope to see you again soon.\nBest Wishes\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen ", "title": "Owner Response", "published_date": "2016-09-20T14:55:15-0400", "id": "420666131"}, "trip_type": "Couples", "published_date": "2016-09-13T02:53:02-0400", "location_id": "9731636", "id": "417857498", "user": {"username": "maryann207", "user_location": {"name": "Charlotte, North Carolina", "id": "49022"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Birthday dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g49156-d9731636-r417739740-m11068-Webb_Custom_Kitchen-Gastonia_North_Carolina.html#review417739740", "text": "If you are looking for something different, quite  and delish then head on down to WCK.  It's worth the drive and the money.  We sat up in the balcony and had a great view of the whole restaurant. Dinner was fantastic and the cheese cake was the best.  Enjoy!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "JimM809, Owner at Webb Custom Kitchen, responded to this review", "text": "tall1\n   Two of the best investments you can make, \"Time & Money\". We are very grateful that you chose both when you enjoyed this locally owned business and we appreciate you supporting the great staff that makes this restaurant run. \nHope you pass this way again.\nJim Morasso & Chef Jon Spencer\nOwners/ Webb Custom Kitchen", "title": "Owner Response", "published_date": "2016-09-20T14:25:54-0400", "id": "420661189"}, "trip_type": "Couples", "published_date": "2016-09-12T19:06:20-0400", "location_id": "9731636", "id": "417739740", "user": {"username": "tall1", "user_location": {"name": "charlotte", "id": null}}}]}