{"paging": {"total_results": "4", "skipped": "0", "previous": null, "results": "4", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Great eats but too crowded", "url": "https://www.tripadvisor.com/ShowUserReviews-g32431-d11658443-r429429718-m11068-Shake_Shack-Glendale_California.html#review429429718", "text": "It doesn't seem to matter what time of day it is, there is always a line of customers out the door and, most of the time, around the corner. The burgers are as good as In 'n' Out but the crowded dining area and line hardly make it worth the wait.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-18T12:07:57-0400", "location_id": "11658443", "id": "429429718", "user": {"username": "Mark F", "user_location": {"name": "Cerritos, United States", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Had to try it", "url": "https://www.tripadvisor.com/ShowUserReviews-g32431-d11658443-r429073988-m11068-Shake_Shack-Glendale_California.html#review429073988", "text": "After seeing a line at the newly opened Shake Shack for the first ten days of being open, I convinced a couple of colleagues to go there for lunch. They agreed, just because we all wanted to experience a piece of Union Square Hospitality Group's hospitality. \nGot there 10 minutes before opening and were about 5th in line already. By the time doors opened there was a line of 20-25 patrons. Placed our order and were observing the staff and there interaction with customers. Friendly, but nothing over the top.\nFinally, the food was ready. Burgers are smaller than what you probably expect, unless you already know about it. Fries don't come with the burger and drinks ( lemonade or shake) aren't cheap. \nOverall, the size of the burger makes you crave for more ( great strategy)! Lemonade was good. Fries nothing special. Most likely will not wait in line in the near future to eat there again and overpay ( in my opinion) for what you get. \n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-10-18T01:37:08-0400", "location_id": "11658443", "id": "429073988", "user": {"username": "Rosie A", "user_location": {"name": "Los Angeles, California, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Quality food for premium price", "url": "https://www.tripadvisor.com/ShowUserReviews-g32431-d11658443-r428866149-m11068-Shake_Shack-Glendale_California.html#review428866149", "text": "Love it or hate it, Shake Shack is here to stay in Southern California. This is the second location in California for Shake Shack right in Glendale, with the first location being in West Hollywood. Located conveniently in the Glendale activity center by the Americana and the Glendale Galleria. \n\nParking\nShake Shack has a private parking lot behind the restaurant, but is too small to really give you a fighting chance at a space. No matter how you slice it you will need to pay for parking, whether you park at the Americana or at any parking structures. One trick I like to use is to park at the Glendale Galleria. This will involve much walking as you walk through the mall out to cross the street to get to the Americana and cross the street again to get to Shake Shack. You could also get lucky by parking on the street: for $1.50 you can park for 2 hours, but vacant street parking is few and far between. Another option is that you could park at a business/shopping plaza, but you risk getting your car towed if you are not a patron of said business/shopping plaza.\n\nFood\nEveryone loves to compare Shake Shack to In-n-Out being that the latter is King here is Socal. In-n-Out is definitely more affordable being that for $7 you get an entire meal of the burger, fries and drink. However, Shake Shack's menu comprises of all individual items so there are no combo items. A single cheeseburger is close to $6.50 with a double cheeseburger being close to as much as $9. Want a whole meal? Double cheeseburger with fries and drink you're already pushing to spend $13! Yikes. However, the food is high quality and delicious each time I visit. I recommend the Shake Shake burger, double; it's a classic take which includes cheese, lettuce, and tomatoes. \n\nAmbiance\nFast casual dine-in experience. Since this Shake Shack is brand spanking new, expect the line to wrap around the corner. On my visit on a Tuesday night around 8pm, my fiance and I waited 35 minutes in line, which is actually not bad for Shake Shake. Bottom line: expect to wait long when dining here so that you are not disappointed in the wait. Seating can be hit or miss: once you place your order you must find an open seat since this is fast food dining we're talking about. There's also patio seating outside. Worst case scenario if you cannot find a table is to take your meal to-go and eat at either the Americana or the mall. \n\nOverall\nWhen I want something familiar, fast, and affordable I'll choose In-n-Out any day of the week. But if I want a better quality meal, am willing to wait, and have a little extra dough in the wallet then I'll go to Shake Shack.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-17T12:32:49-0400", "location_id": "11658443", "id": "428866149", "user": {"username": "jon o", "user_location": {"name": "Fullerton, California", "id": "32416"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Just opened, long lines", "url": "https://www.tripadvisor.com/ShowUserReviews-g32431-d11658443-r426528513-m11068-Shake_Shack-Glendale_California.html#review426528513", "text": "The famous Shake Shack has come to Glendale as of two weeks ago. We went a few times to try and find the shortest line...it was always out the door and took about 15 minutes from the bend at the curb. I don't get all the hype. Burgers and fries and shakes (and chicken, etc, but basically a burger joint). Friendly, clean, and tasty, so if it's on your bucket list, don't let my lack of enthusiasm deter you.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-09T21:00:23-0400", "location_id": "11658443", "id": "426528513", "user": {"username": "Kauai-Biz-Traveler", "user_location": {"name": "Riverside, California", "id": "32978"}}}]}