{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2015-09", "title": "Easy to find", "url": "https://www.tripadvisor.com/ShowUserReviews-g55960-d5844500-r323469404-m11068-The_Point-Harlingen_Texas.html#review323469404", "text": "The refurb on this location is beautiful. Neat patio in front with TV's on the wall. Beautiful interior, nice high top tables.  Upstairs is a nice idea, in thought, but we're talking about deep South Texas. When the sun starts to set, holy cow, don't even think about being upstairs, unless you want to bake.  Once the sun is completely down, it's very comfortable, but if there is \"live music\" forget about having any type of normal conversation. You will have to scream into the ear of whoever you want to talk too. That may have been great when we were 20, but when I was 20 I didn't have as much money to spend like I do now.  I think the staff has a lot of their friends hanging out there regularly because they are always deeply involved in a conversation with the same people.  Too bad, I would really like to have this as a place to hang with on a regular basis, convenient location for sure. But I don't need to be screaming over loud music (nor do I want to).", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-10-31T11:55:42-0400", "location_id": "5844500", "id": "323469404", "user": {"username": "bettina763", "user_location": {"name": "Harlingen, Texas", "id": "55960"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-07", "title": "poor service", "url": "https://www.tripadvisor.com/ShowUserReviews-g55960-d5844500-r322023686-m11068-The_Point-Harlingen_Texas.html#review322023686", "text": "Im sorry to say this but it was one of the worst experiences. We went there and had a hard time getting service. The waitresses were to busy flirting with their friends instead of taking care of customers. The bartenders  were just as bad. They were also busy trying to carry their personal conversations with their friends. We ended up leaving. Its a very immature place. Would not recommend this to anyone. And that was on a slow night, no excuse for the poor service.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-10-26T09:49:35-0400", "location_id": "5844500", "id": "322023686", "user": {"username": "juan b", "user_location": {"name": "Harlingen, Texas", "id": "55960"}}}]}