{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2013-03", "title": "Sorry to see it go down", "url": "https://www.tripadvisor.com/ShowUserReviews-g32515-d3930318-r153659218-m11068-J_Mendoza_Bakery-Huntington_Park_California.html#review153659218", "text": "Initially, I had only good things to say regarding J. Mendoza Bakery. The fact that the bakery did peruvian pastries added to my excitement. I tried them about a year ago, and our overall impression was above average. With this in mind I thought it was only fair to include this bakery in Trip Advisor, for I truly respect and believe the consumers deserve the best of the best.\nThree days ago I purchased from the bakery, the things I purchased were the items I had bought before, when they tasted really good.\nI thought that the baker's attention to detail and quality was never going to waver off. I was sadly mistaken. This last purchase it was the exact opposite in taste and quality. \nI do not understand why some food operations disregard quality, specially when at one time they seemed to have it. Not anymore. J. Mendoza Bakery is now defunct, or better still, obsolete. I have absolutely zero respect for bad food, whatever that food is, or whoever sells it. \nI do not think I need to get into the details, for when a place is good most of what they sell is good, and this is no longer the case. I do apologize for making Trip Advisor list this bakery at my suggestion. I will not compromise when it comes to great food, and this place is no longer relevant. 2 Stars.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2013-03-03T21:15:39-0500", "location_id": "3930318", "id": "153659218", "user": {"username": "Luke17", "user_location": {"name": "Western Hemisphere", "id": null}}}]}