{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Both General and Trans-Mississippi Civil War Books", "url": "https://www.tripadvisor.com/ShowUserReviews-g60849-d10520634-r389776891-m11068-Blue_Grey_Book_Shoppe-Independence_Missouri.html#review389776891", "text": "Warning: open only on Saturdays (I would have put this in caps, if allowed).\n\nThe Civil War covered a lot of the US, but what happened in Missouri and Kansas, specifically, often gets overlooked.  This store stocks books on the Civil war in general, on specific battles, on specific leaders, and biographies.  A small section on guerrillas, also.  A lot of the books I saw there were ones I had seen or read before.\n\nThe store has more than just books on the Civil War, but does have a good section on the CW.\n\nHowever, my specific reason in going was to see what they had about wars in the Trans-Mississippi, specifically the Missouri-Kansas border wars, and even more specifically, the second battle of Independence (which is where the store is located).  I figured if anyone would have a good book on that, this would be the place.\n\nThe woman working at the store thought she had something, and disappeared upstairs for a short while.  Unfortunately, there were two battles in Independence.  The book she had was on the wrong one.  To be honest, I haven't seen one yet focused on the second Battle of Independence, so I might be looking for a book that doesn't exist.\n\nStill, the woman was helpful, and pleasant.  A little too talkative for my tastes, but then I'm fairly quiet.\n\nI ended up walking out with a book of diaries and excerpts from (auto?) biographies of people from the Trans-Mississippi.  A book I hadn't seen elsewhere, and will be reading soon.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-07-06T08:53:39-0400", "location_id": "10520634", "id": "389776891", "user": {"username": "re34646", "user_location": {"name": "Cedar Falls, IA", "id": null}}}]}