{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Haunted Westfield underground railroad", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r433188841-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review433188841", "text": "I took this tour this past weekend. I didn't know of the history of Westfield quite interesting thoroughly enjoyed it ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-10-31T04:19:39-0400", "location_id": "1575666", "id": "433188841", "user": {"username": "madmax1965", "user_location": {"name": "Carmel, Indiana", "id": "36990"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-07", "title": "Mostly History, not much action", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r409723646-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review409723646", "text": "Well, the history behind the tour was very neat! Great stories behind the haunts. However, most of the tour was just that: history. You never go into any of the rooms where the haunts occur, and so most of the stories are left to your imagination. The people are very nice, however, and I was just happy to be going on a ghost tour. Been on much better though.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Hello Cody,\n\nThanks for saying we are nice, but we would have preferred you would have been totally satisfied with the walk! I know we can't satisfy everyone all the time, but we try! :)\n\nWhich of our ghost walks did you go to? Yes, most walks we do not go inside any of our buildings. During our Chatham Arch Lockerbie ghost walks we are normally able to go into one building and sometimes into a haunted room or two, but for some reason we weren't able to get permission from business owners to walk through their business with 35-40 people during their main business days Fridays/Saturdays during their main business hours. Not surprising really! During our Westfield/Noblesville walks we go onto the grounds of historic cemeteries, so that is very popular too.\n\nWe try to balance it between ghost stories and history since about 25-50% of the folks attending our walks are there less for the paranormal and enjoy the history more. Some stops are more ghosts, some are more history. Just depends what happened. We don't make stuff up so we can't do a perfect 35%/65% ratio or what ever would be best - it depends on the person.\n\nIf you want to go INTO rooms that are haunted and actually investigate, join us for one of our paranormal overnight investigations, which are fundraisers for the building owners/non for profits. One in Noblesville in September and one in November in Indy (Athenaeum).\n\nThanks for your feedback and maybe you give us another chance :)", "title": "Owner Response", "published_date": "2016-08-25T07:23:57-0400", "id": "410599011"}, "trip_type": "Couples", "published_date": "2016-08-23T14:35:58-0400", "location_id": "1575666", "id": "409723646", "user": {"username": "Cody E", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-10", "title": "A bit disappointing", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r323768541-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review323768541", "text": "First and foremost to anyone taking ANY ghost tour/walk...DO NOT EXPECT TO SEE A GHOST. The paranormal simply doesn't work that way. Maybe you will encounter something, but if you're expecting a ghost to manifest in front of you and say hi? It's not going to happen.\n\nThat being said, I have taken several ghost tours/walks. I definitely appreciated the historical aspect of this tour. Being from out of state, I was not aware of the history and found it to be interesting. The claims of the paranormal, while I don't necessarily believe all of them, given some events at the locations, it is definitely conceivable that hauntings could take place.\n\nAs for the presentation of the material, I found it to be a bit dry. There were times I did find myself tuning out. There is a lot of \"dead air.\" (No pun intended.) By that I mean, you hike around the area quite a bit since the locations are not very close together. So there's a lot of quiet time with not much going on. That's was a bit of a turn off. Since I'm not familiar with the area, I don't know if there is a way where it can be rerouted to not seem so all over the place. Maybe on the way to the next location, a little history about something else could be given. Something to keep people interested and engaged because truthfully, by the time we got to the final stop, I almost didn't care what happened. I was exhausted from walking and having to wait too long to get any kind of information.\n\nI would definitely consider one of the other tours they offer, but I don't think I would take this one again.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-11-01T17:26:05-0500", "location_id": "1575666", "id": "323768541", "user": {"username": "mzdov", "user_location": {"name": "Chicago", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Unseen Press Anderson ghost tour", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r296453148-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review296453148", "text": "This is a great ghost tour that gives you the opportunity to take a walk downtown with a group of people and listen to the ghost stories that you might never have been aware of. Tour guides Michael and Nicole put their heart and soul into the tour and you feel their genuine love for history and good old ghost stories. It's not an investigation but rather a walk down the darkened streets as the latern lights the way and the stories give you a great visual image. I love to go on these tours and think its a great way to share history with others. Remember people...this is not an investigation of the paranormal but rather a nice walk about the ghost stories that haunt these places. I went on the Westfield and Anderson trips and enjoyed them both.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Thank you so much for your kind review. When we started these ghost walks not many people were expecting an investigation, but since other cities have so called \"ghost walks\" that tout to be investigations (with people having dowsing rods or EMF detectors \"investigating\" on public streets or parking lots or buildings they aren't familiar with) people do sometimes get the wrong idea.\r\n\r\nOur ghost walks are about ghosts and the stories that made them. There is history, yup. We love history and when we want to hear about a haunting we want to know why it is haunted and what happened there and what the story of the building is. So we do what we enjoy. Some love it, some don't. I am glad you did like them! :)", "title": "Owner Response", "published_date": "2015-08-09T17:37:52-0400", "id": "297362418"}, "trip_type": "Friends getaway", "published_date": "2015-08-06T15:27:17-0400", "location_id": "1575666", "id": "296453148", "user": {"username": "Rod F", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-07", "title": "So boring!!!!!!!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r292302331-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review292302331", "text": "I was expecting something more exciting and ghost related. This is not about ghosts at all. I could have read about the history of the different buildings downtown online and saved me $18. It was a waste of my money. This tour should be called History Lesson and not ghost walk.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Erika,\r\n\r\nSorry you don't enjoy our ghost walk. How did you find our ghost walks? Our website and Facebook page says \"Historic Indiana Ghost Walks and Tours\". Yes, we do talk about history at each spot. Sometimes a lot, sometimes just a little bit. Sometimes the history relates to the ghosts we believe is haunting the spot, sometimes its background information to know the story of the building or people that were in the area that contributes to the haunting.\r\n\r\nOur ghost walks are about ghosts and the stories that made them. There is history, yup. We love history and when we want to hear about a haunting we want to know why it is haunted and what happened there and what the story of the building is and what possibly contribute to the place being haunted. \r\n\r\nWhen we started these ghost walks not many people were expecting an investigation, but since other cities have so called \"ghost walks\" that tout to be investigations (with people having dowsing rods or EMF detectors \"investigating\" on public streets or parking lots or buildings they aren't familiar with) people do sometimes get the wrong idea. Is that what you were expecting?\r\n\r\nThanks", "title": "Owner Response", "published_date": "2015-08-09T17:57:21-0400", "id": "297365281"}, "trip_type": "Family", "published_date": "2015-07-25T05:42:27-0400", "location_id": "1575666", "id": "292302331", "user": {"username": "Erika V", "user_location": {"name": "Indianapolis, Indiana", "id": "37209"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-05", "title": "Haunted Indiana Ghost Tours", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r287775286-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review287775286", "text": "I have been on a variety of ghosts walks in many different states.  The ones given by Unseenpress have been the best.  The tour guides know their history and the ghost stories.  They've always done a great job on ever tour I've been on with them .                                                                  I have taken friends on some of their walks and they always had a good time. I would highly recommend going on one of their tours if you are in the area.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-07-10T19:37:44-0400", "location_id": "1575666", "id": "287775286", "user": {"username": "Loveghostwalks", "user_location": {"name": "Columbus, Ohio", "id": "50226"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-06", "title": "Informational, but not at all scary.", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r284591002-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review284591002", "text": "The person giving the tour guide was very sweet! But the tour included more stories about people's lives or hear-say of boring stories that were so typical they sounded made-up and not at all scary. It lasted way too long as well. I could've delivered the same stories in less time and made them more interesting. I was sort of bummed. :-( I guess this is Indiana and no New Orleans or Georgia, but I had higher expectations. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Sorry you didn't enjoy the ghost walk. We don't make stories up, we research history and paranormal experiences and report on them. Some of our own experiences (Athenaeum) some others told us about. Lots of people find the stories quite scary as well as informational. Its in the mix. Some want just straight scary, some want more history. It varies between walks and expectations. Not too many Voodoo ghosts (New Orleans) or Medieval ghosts (Europe) here. \r\n\r\nThe particular ghost walk you went on lasted about 20-25 minutes longer than normal because we made accommodations for three sight handicapped people that wanted to join us. We even hired a helper to make sure it goes as smoothly as possible, but it did last quite a bit longer than usual.", "title": "Owner Response", "published_date": "2015-07-10T04:41:51-0400", "id": "287568028"}, "trip_type": "Friends getaway", "published_date": "2015-06-30T20:19:23-0400", "location_id": "1575666", "id": "284591002", "user": {"username": "msabaylor", "user_location": {"name": "Indianapolis, Indiana", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-06", "title": "Fascinating local history lesson but \" chilling\" and \" ghosts\"?....eh.....", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r283608279-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review283608279", "text": "We took the Chatham Arch Lockerbie Ghost Tour that was wrongly labeled as \" chilling.\" Although Michael ( our tour leader and co-owner of the tour company with his wife Nicole ) presented some fascinating local history on the the evolution of the downtown areas we walked, it was certainly not a \" chilling\" experience and the ghost tales were stories that mostly had just been shared with him. Very few were paranormal experiences either he or Nicole had experienced. In fact, he described himself as just a \" little sensitive\". It was an enjoyable experience but I expected more stories to have been of his own experiences . We attended a Cemetary ghost tour while in Savannah last year and it was outstanding so this was definitely a let down.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Steph,\r\n\r\nSorry you didn't enjoy the ghost walk as much as we would have liked you to. We tell the stories how they are. Sometimes its our own experiences, sometimes experiences from other people. If you go on a ghost walk and with 7-9 stops and at every single one the tour guide has its own experiences - well, good for them, but I would be skeptical.\r\n\r\nOur ghost walks aren't all about our experiences. I think that would be kind of boring to be waxing on about ME ME ME the whole time. There were more of our own experiences I didn't tell just because of that reason. We like it better if we hear stories from different people personally, but tastes are of course different and thats fine.\r\n\r\nIf you feel like giving us another chance, let us know and maybe we can do a deal for you. We have a few more personal experiences we normally tell on our Noblesville Ghost Walk and Westfield as well.\r\n\r\nThanks", "title": "Owner Response", "published_date": "2015-06-30T08:59:20-0400", "id": "284277818"}, "trip_type": "Couples", "published_date": "2015-06-28T08:23:50-0400", "location_id": "1575666", "id": "283608279", "user": {"username": "2011lovinitsteph", "user_location": {"name": "Indianapolis, Indiana", "id": "37209"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-05", "title": "Love the historic side of the tour!", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r269908435-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review269908435", "text": "We took the Chatham Arch Lockerbie Ghost Walk, which began at the Athenaeum. This was our first tour with this company and it was really fun! I loved learning about the history in the area. We went through the Athenaeum, walked down Mass Ave, into Lockerbie Square, etc. The paranormal side isn't our cup of tea, but I felt like the guide, Michael, did a great job balancing the ghost stories with real historical accounts of things that had happened throughout Indianapolis. I also loved begin able to explore some different parts of Indy on foot. The tour is about 2 hours long, so wear comfortable shoes and take a bathroom break before the tour begins.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Hello Melissa,\r\n\r\nThank you so much for your kind words about our ghost walk! We do love history a lot and are really glad that you enjoyed yourself even if the paranormal part isn't really what you came for!\r\n\r\nWe do try to balance the history with the paranormal, sometimes it works really well, sometimes we don't have as much history and more ghosts, depending on the facts :)\r\n\r\nDefinitely check out our walks in Westfield and also Noblesville besides the other Indianapolis one they have a lot of history as well!\r\n\r\nThanks again!", "title": "Owner Response", "published_date": "2015-05-29T06:00:10-0400", "id": "275510264"}, "trip_type": "Couples", "published_date": "2015-05-04T05:42:35-0400", "location_id": "1575666", "id": "269908435", "user": {"username": "Melissa H", "user_location": {"name": "Indianapolis, Indiana", "id": "37209"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-10", "title": "Enjoyable Evening", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r221312758-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review221312758", "text": "The Historical Ghost Walks given by Michael and his wife Nicole always make for an enjoyable evening.  I've lived in Indianapolis my whole life and did not know some of the historical facts that I learned on the walk.  I have been on both of the downtown Indianapolis walks as well as the Noblesville walk.  If you like history with a dark side, you'll enjoy these walks.  It's great fun to make new friends, get some fresh air, and see parts of the cities you may have just drove by before and never knew they were there.  Every walk I've been on, not only did Michael talk about the site we were at, but also added his own personal stories which led to others sharing their own paranormal stories.  We always walk away having enjoyed the evening.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-08-12T05:01:48-0400", "location_id": "1575666", "id": "221312758", "user": {"username": "Cory S", "user_location": {"name": "Greenwood, Indiana, United States", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": null, "title": "Ghost walk", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r219330758-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review219330758", "text": "This was without a doubt the worst ghost walk I have been on. So and so died and then someone saw them. really? By the time we got to the second stop we were considering going back to the Rathskeller for beer. By the time the tour was over, we looked at each other and said \"god that was lame\" luckily we were both equally disappointed.", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": {"lang": "en", "author": "mkobrowski, Owner at Haunted Indianapolis Ghost Walk, responded to this review", "text": "Hello Joseph,\r\n\r\nSorry you had such a bad experience with our ghost walk. What exactly where you missing from our ghost walk that you experienced on other ones?\r\n\r\nAccording to the applause from the audience at least some seemed to have enjoyed that walk, even though we had a bit of a delayed start due to the bicycle race in town.\r\n\r\nHistory and Ghost stories (real ones, paranormal experiences people had, some we interviewed, some of our own, some from our ghost walks) is what we are all about. I hope you weren't expecting a \"Haunted House\" or a \"paranormal investigation\"?", "title": "Owner Response", "published_date": "2014-08-05T10:09:09-0400", "id": "219798809"}, "trip_type": null, "published_date": "2014-08-03T14:23:45-0400", "location_id": "1575666", "id": "219330758", "user": {"username": "Joseph H", "user_location": {"name": "Lafayette, Indiana", "id": "37242"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-10", "title": "Unseenpress.com", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r199992009-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review199992009", "text": "We have been on several tours with Michael. Each tour has been so very interesting and entertaining, and the personal investment that Michael and his wife Nici have in the history of this city definitely shows. You can easily tell that there is a joy in sharing the story, even if it's the hundredth time Michael has been through it you would never know because he always seems happy and excited to be telling it again. These tours are so enjoyable- it doesn't matter if you are a skeptic or a believer, you will have a great time!", "helpful_votes": "7", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-04-05T09:11:46-0400", "location_id": "1575666", "id": "199992009", "user": {"username": "Melissa K", "user_location": {"name": "Avon, Indiana", "id": "29328"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Excellent Tour", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r198445792-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review198445792", "text": "I had a really fun time, great presenters, easy to understand, great stories, I really liked the Noblesville tour, it was my first and I plan to try others. Thank you.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2014-03-23T15:45:07-0400", "location_id": "1575666", "id": "198445792", "user": {"username": "Larry F", "user_location": {"name": "Mooresville, Indiana", "id": "37345"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Historic Indianapolis Ghost Walk", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r198173854-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review198173854", "text": "This was a very interesting and fun tour.  Michael was very knowledgeable regarding the history of the area and funny too!  I would definitely recommend this tour to anyone visiting the Indianapolis area.  A great time!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2014-03-21T08:02:28-0400", "location_id": "1575666", "id": "198173854", "user": {"username": "Mary L", "user_location": {"name": "Grand Forks, North Dakota", "id": "49816"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-06", "title": "Awesome tour!", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r177964481-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review177964481", "text": "I have gone on not only this tour but all of them that are offered. They are all great ghost tours and not the cheesy boring ones that I have been on in other states lol. These are fun and I really enjoyed them. Worth every penny! Not only are the tours fantastic but Michael and Nicole are great at giving them. They know their stuff and I love hearing them tell the history and the \"ghost\" part of the stories. They are very knowledgeable about the history of each tour they give.  Very nice people too and I am glad I have made a friendship with them over the past few years. I always tell my friends and family about them and the tours and everyone I have told has at least gone on one or if not more tours too. Never has had a bad review either. Great for the family or even a date night too :).I highly recommend!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-09-20T19:47:45-0400", "location_id": "1575666", "id": "177964481", "user": {"username": "Amers281", "user_location": {"name": "Indianapolis, Indiana", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2012-11", "title": "Always a great time!", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r177797383-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review177797383", "text": "We have gone on a few of the Ghost walks and really hav eenjoyed them. Michael and Nicole are very knowledgeable and make the history piece fascinating. not to mention they are just great people to hang out with. We highly recommend a ghost tour with them wherever the location. They will not disappoint!\n\nMandi", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-09-19T09:01:53-0400", "location_id": "1575666", "id": "177797383", "user": {"username": "mandilin2", "user_location": {"name": "New Palestine, Indiana", "id": "37375"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-08", "title": "Fun for the whole family!", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r177400279-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review177400279", "text": "I've been on several of their Ghost Walks and I've NEVER went home disappointed! This is fun for the whole family! My 9 & 11 year olds both loved it....even walking through a cemetary at night with a flashlight :) I definitely recommend going!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-09-16T08:41:36-0400", "location_id": "1575666", "id": "177400279", "user": {"username": "Heather K", "user_location": {"name": "Coatesville, Indiana, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2012-10", "title": "History and Ghosts", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r144071507-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review144071507", "text": "We enjoyed the Lockerbie Ghost Walk.  It was a blend of local history, ghost stories and walking that was perfect.  The tour guide was knowledgeable and interesting.  Our group had some young girls and the guide made sure they were not too scared.  I've been on ghost walks in Greenfield and St. Augustine and prefer these types of historical/paranormal tours.", "helpful_votes": "7", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2012-10-30T07:05:02-0400", "location_id": "1575666", "id": "144071507", "user": {"username": "Otis45", "user_location": {"name": "Gainesville, Florida", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2012-06", "title": "Haunted Underground Railroad Walking Tour in Westfield, IN", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r131817271-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review131817271", "text": "My daughter and I took this tour on June 9. Not only did we get a history lesson of the city we live in, but we got to experience some interesting events. If you're a paranormal believer or a skeptic or completely ambivalent, their variety of tours are fun, educational, entertaining, and completely worth it. We will definitely be attending more! My one word of advice....bring extra batteries for your camera :)", "helpful_votes": "9", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2012-06-12T04:42:03-0400", "location_id": "1575666", "id": "131817271", "user": {"username": "Leona P", "user_location": {"name": "Westfield, IN", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2011-10", "title": "Historical Ghost Walk", "url": "https://www.tripadvisor.com/ShowUserReviews-g37209-d1575666-r119182472-m11068-Haunted_Indianapolis_Ghost_Walk-Indianapolis_Indiana.html#review119182472", "text": "I really enjoyed all the history of the area. For a family outing the ghost story's were just enough. They made children shiver but wasn't scary. The walk might have been too long for someone not in good physical shape. If you want to be scared out of your wits and have things jump out of you go to one of the commercial haunted houses. If you want a family outing try this.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2011-10-11T05:28:48-0400", "location_id": "1575666", "id": "119182472", "user": {"username": "Nancy J", "user_location": {"name": "Indianapolis", "id": null}}}]}