{"paging": {"total_results": "9", "skipped": "0", "previous": null, "results": "9", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-02", "title": "Great place to eat a delicious lunch!", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r301539544-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review301539544", "text": "The salad bar is filled with delicious items, and comes with rolls and two different soups.  The tomato bisque soup is supreme!  You can easily fill up on the salad bar alone, but Glory House also offers two hot entrees and sides for a small additional charge, and can take it To Go if you prefer.  \n\nI have mostly eaten at the Bistro during individual business lunches, and free wi-fi is available.  They are also flexible if you need to stay a little longer to finish your meeting.  As another reviewer noted, you will see many local residents enjoying the selections of the day.  You can check their website for the selections of the day, or it's always posted on Twitter and Facebook as well.  \n\nEverything I've ever eaten there is delicious!!  Highly recommended!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2015-08-20T09:41:02-0400", "location_id": "2090488", "id": "301539544", "user": {"username": "Kerri M", "user_location": {"name": "Irving, Texas", "id": "56032"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-04", "title": "Very Tasty Gem in Irving", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r267375447-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review267375447", "text": "Tucked away in 'downtown' Irving is Glory House Catering. It's only open during weekdays from 11 am - 2 pm during which they offer a buffet 'hot' meal of the day. There was a complete salad bar and a choice of two entrees with hot sides. We stopped in to sample because we're considering GH for catering. Am so glad I did! The vegetable &, parmesan potatoes were so flavor-filled and fresh! Entre of Bourbon Sausage and the Chicken Florentine were each delicious. The venue itself is obviously focused on the catering business, but for $9.95 the main meals are a terrific value. Joann and her crew certainly know how to 'chef.' Worth the trip.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-04-22T10:28:30-0400", "location_id": "2090488", "id": "267375447", "user": {"username": "MSLovell", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-03", "title": "Love the atmosphere and food!", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r260193475-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review260193475", "text": "I love the linen tablecloths and napkins and the food is great.  You serve yourself at the salad and soup bar and for a couple of dollars extra-you can have the full meal.  The soups were excellent- I recommend the corn chowder and the salad bar was top notch including a freshly made pimento cheese. The entrees change each day with a choice of two or you can have both along with three side dishes.  Today was beef stroganoff and it was very good.  Lots of local people eating there and everyone is very friendly. I want to go back when they have their pot roast-heard it is great.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-03-17T14:21:58-0400", "location_id": "2090488", "id": "260193475", "user": {"username": "Wagadu", "user_location": {"name": "Mineola, Texas", "id": "56298"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-08", "title": "Great Place for a Reception", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r173418992-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review173418992", "text": "I recently attended an assisted with an informal anniversary party on Sunday afternoon at The Glory House for approximately 45 people.  What an awesome job from the staff. The food was excellent the service was superior.  The menu was light since it was a reception from 2 - 5 p.m. finger sandwiches, hot artichoke dip, potato salad, pasta salad, fruit and cheese tray etc.  The quality of food was outstanding and all the items were refilled promptly.  The atmosphere was perfect for our reception, spacious and well maintained.  Jo Ann, the owner, was wonderful to work with.  She and Lisa were absolutely terrific.  Jo Ann made some great suggestions for the menu and worked very patiently with me as I tried to make decisions. I was concerned that the venue might be a little large for our group but it was set up in such a way that it was incredibly cozy and functional.  The space is lovely and the ambiance was just what we wanted.  Lisa could not have been more gracious.  She was very attentive to our needs.  All bases were covered - everything was just perfect.  The servers were very efficient.  The buffet table looked wonderful and the food was delicious.  It definitely made our event even more special to work with such great people.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2013-08-21T16:16:57-0400", "location_id": "2090488", "id": "173418992", "user": {"username": "buckranger", "user_location": {"name": "Houston, Texas", "id": "56003"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-08", "title": "Noon Lunch", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r173271083-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review173271083", "text": "This place has an awesome lunch buffet for the price.  The food was Great. Very friendly wait staff.  They kept or tea glasses full.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-08-20T18:56:05-0400", "location_id": "2090488", "id": "173271083", "user": {"username": "Susie C", "user_location": {"name": "Wichita Falls, Texas", "id": "56891"}}}, {"lang": "en", "rating": 3, "travel_date": "2013-06", "title": "Come for Kraig Parker not for the food or service", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r166192877-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review166192877", "text": "We have been to Glory House twice, once for a Gospel brunch  with Kraig Parker and for the Hawaiian luau performance with Kraig Parker. I cannot comment on the lunch since I have never eaten there other than these two times.\n\nFrom my perspective, the price of the event is a good value as Kraig Parker is an amazing performer. We saw him once at Bass Hall and twice at the Glory House. He puts on  a great show and worth the price of the event.   However, we found the Glory House food and staff lacking and would not go for just the meal.\n\nFor the Gospel brunch:\nWe got there a few minutes after the start time only to discover virtually every seat taken and the buffet steam trays nearly empty.  the doors open before the start time.   Kraig Parker has a devoted fan base, find out when the doors open and go at that time and do not wait until the start time and certainly do not come late.   We did have dessert and it was very good.  Just a note, desserts are not included in the price of the buffet and are extra charge.\n\nFor the Hawaiian luau:.\nWe were smarter this time and asked what time the doors open, 6:45 for a 7PM start time. When we arrived, 6:30 there were already people waiting on the side walk. We walked in and found several of the tables were reserved. There were two tables we found that seated four,  one had a great view of the right side of the stage but was against the wall in the front section of the venue and the other was a great view of the center stage in the back portion of the venue in a center space.  We opted for the table in the back because we did not want to sit against the wall. This turned out to be a very bad decision.. more on that later. \n\nOne pet peeve of mine is that food is not labeled at the Glory House so one has to guess what the food is.  I have food allergies and it irritates me when I have to pass on food because there is no way to determine if the dish may have something I am allergic to. In addition, it just helps to decide what to eat if you have some idea what is being offered.   The buffet is not a wide selection but adequate for all tastes.   There was a single garden salad.  There was a mysterious brown gravy like liquid  by the salad in a bowl next to the ranch dressing (only these two dressings were available).    We assumed some  type of dressing, but what kind?  It had an unappetizing brownish pink color and a thickish viscosity; having no idea what the mystery substance was  all of us passed  except one member of our party who declared it was a good dressing,  What was it? She thought maybe a raspberry vinegarette?  We have no idea.  There were meatballs, what kind, I do not know but they were good.  There were chicken kabobs with pepper that were okay bit dry but no surprise for buffet/steam table.  No pork.  The green beans ranged from thoroughly cooked and hot to  cold and undercooked.   A member of our party also selected the rice dish with something in it, she said it was good.   Our party rated food overall average.\n\nThe buffet includes tea and coffee.  Any dessert is an extra cost.  We declined dessert.\n\nOn returning from the buffet we discovered the wait staff busy mopping the floor, taking  off the tablecloth, and moving our table. Apparently a glass of water had been spiiled on our table.     A sweater that was on the back of a chair has  a sleeve that wet which no one discovered until the owner put it on and had a bit of a shock. The offending glass of water was never replaced, someone got up and snagged a glass from a tray.  No one apologized for the inconvenience while we stood there with plate in hand watching in stunned horror as the table was now moved... against the back wall... with a view of... a post.  \n\nThe manager was not there, a substitute manager was on duty. At intermission she came over and asked one of our party if he was unhappy up against the wall with a view of the post? We were stunned at her question.  The individual she asked said he was fine when it was clear from his body language for the entire show he was not fine.  None of us were fine.  We were all rather irritated.  While I appreciate the effort she made of asking, my opinion is, she shouldn't have had to ASK.  I believe it should obvious no one wants to pay $40 per person to view a post.    I feel  she should have determined a spot to  move us with some view of the stage and just moved us with an apology before the show rather than asking after half the show was over.  \n\nThe event advertised a bar.  And there was a bartender.  The problem was, the bartender could only mix simple drinks.  My husband asked for a martini, bartender did not know how to make  a martini. She did tell my husband if he could tell her the ingredients, she would try,  We settled on drinking beer and wine.\n\nMy recommendation is to go and see Kraig Parker, he's amazing performer.  We saw him at Bass Hall a few years ago ,and twice at the Glory House,  Keep your expectations low about the food and unless you get moved behind a post, you will have a great experience.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2013-07-03T11:04:58-0400", "location_id": "2090488", "id": "166192877", "user": {"username": "dagmara56", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-06", "title": "Kraig Parker was performing there.", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r165982763-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review165982763", "text": "The Glory House had Kraig Parker there doing one of his shows.  The food was good but the show was awesome.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-07-01T18:47:19-0400", "location_id": "2090488", "id": "165982763", "user": {"username": "Susie C", "user_location": {"name": "Wichita Falls, Texas", "id": "56891"}}}, {"lang": "en", "rating": 4, "travel_date": "2012-08", "title": "Glory House Catering, Downtown Irving", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r142525858-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review142525858", "text": "Hidden in Downtown Irving is the 2012 Blue Ribbon Business that feeds cater quality food to patrons for a nominal price $$.  Very, very good!  Their fajitas, ham, roast, seseme chicken, King Ranch Chicken and etc. entrees are priced with salad or soup as you chose to purchase (for a $1 more).  The linen table clothes over glass tables makes you think that you are in a restaurant that is a high dollar eatery.  Their menu changes daily for lunch Sunday through Fridays, with some surprise visits from Elvis.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2012-10-10T20:11:45-0400", "location_id": "2090488", "id": "142525858", "user": {"username": "Larry P", "user_location": {"name": "Irving, Texas, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2012-01", "title": "Amazing!  I am sad to be leaving Irving!", "url": "https://www.tripadvisor.com/ShowUserReviews-g56032-d2090488-r122901551-m11068-Glory_House_Catering_Receptions_Bistro-Irving_Texas.html#review122901551", "text": "Today, their lunch buffet had roast and chicken.  I had the roast (so tender, no knife needed), savory rice, and fresh salad.  Their tomato basil soup was excellent too.  Good job, chef(s) - I'm getting hungry again for your cooking!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2012-01-10T17:47:34-0500", "location_id": "2090488", "id": "122901551", "user": {"username": "Lookingforcleanroom", "user_location": {"name": "Texas", "id": null}}}]}