{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2015-08", "title": "Bed and breakfast?", "url": "https://www.tripadvisor.com/ShowUserReviews-g38815-d7849498-r303033548-m11068-Barnett_Bed_and_Breakfast-Kansas_City_Kansas.html#review303033548", "text": "When I arrived towards evening I was concerned about the neighborhood. Google directed to the correct address but I was sure there was a mistake. The neighborhood was obviously economically distressed and there was no sign outside identifying it as a bed and breakfast. I was concerned I was in a bad neighborhood where I would not be welcome. Once on the porch, there was a sign taped onto the opened storm door that identified it. I tried all phone numbers and knocked on the side ( office) door and got no answer . Then I heard someone stirring inside and a kind gentleman, just awakened from a nap, informed me, in broken English, that I was at the right place. Like other reviewers I found clean, minimal accommodations; no night stands, one towel, no hand towels, no wash cloths, community soap. The shower worked with ok pressure and water temp. Vents on first floor rooms for air conditioning. Though I jokingly referred to it as my \"ghetto bed and breakfast\" I developed a fondness for the owner and place. Didn't even ask about breakfast. Does have water bottles available but they didn't get replenished. Close to historic district. Not far from West Bottoms. Convenient. Do not recommend walking or jogging alone in the neighborhood. For $45.00 what can you expect. You save a lot of money. Spend it on breakfast somewhere else.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-24T13:52:04-0400", "location_id": "7849498", "id": "303033548", "user": {"username": "Rebecca A", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-06", "title": "You Get What You May For", "url": "https://www.tripadvisor.com/ShowUserReviews-g38815-d7849498-r280953331-m11068-Barnett_Bed_and_Breakfast-Kansas_City_Kansas.html#review280953331", "text": "We arrived at 1pm (check-in time) and the front door was opened 2 inches but no one was home.  We called the 3 phone numbers listed on the door and finally talked to the owner who spoke very little English.  We left to sightsee and then several hours later called the owner again and he was thankfully home.  The house is rundown on the outside. Our bed was very comfortable and sheets were clean.  The shower was extremely small with lukewarm water and poor water pressure.  The bathroom had only one washcloth so we had to ask for towels.  Our room came with a fan which was helpful since the room was stuffy.  The owner's relative was smoking a hooka in the next room which did make our clothing smell and gave me a headache.  After the overall shock of the safety concern (unlocked house) and the house's condition, it wasn't too bad of a stay.  There is free Wi-Fi but no tv or refrigerator.  Breakfast was $5/person per day and the menu consisted of cereal, juice, fruit and coffee. It's not free like the website stated.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-06-17T11:57:26-0400", "location_id": "7849498", "id": "280953331", "user": {"username": "lk84", "user_location": {"name": "Saint Louis, Missouri", "id": "44881"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-05", "title": "Not A Good Place To Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g38815-d7849498-r275115370-m11068-Barnett_Bed_and_Breakfast-Kansas_City_Kansas.html#review275115370", "text": "For $45/night, you get a bed. House has thermostat, but no vents to the room we were in, which means no A/C. It was very warm in the room with just a ceiling fan. The owner was nice, but took nearly 20 minutes to get to the B&B to give us our keys when we called the day before stating our arrival time. He showed us the room and left us to our own devices. There was no TV, at least not in the areas we had access to. There is free Wi-Fi, and it does work. Water pressure was crap, and our toilet ran continuously. There was only 1 towel and 1 roll of toilet paper for 3 nights and 2 people. Breakfast was $5/person per day, plus tax. The menu? Cereal, juice, fruit and coffee. Really? We got more for our money elsewhere. The only perks of this place is you don't have to be 21 to check in (which is a miracle in KC), and the room was clean. Overall, I'd rate this place 2 stars at best, and to be honest, I would have to be desperate to return here.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-05-27T12:15:12-0400", "location_id": "7849498", "id": "275115370", "user": {"username": "B B", "user_location": {"name": "Jonesboro, Arkansas", "id": "31706"}}}]}