{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Fantastic Food, But...", "url": "https://www.tripadvisor.com/ShowUserReviews-g40247-d4256649-r355283407-m11068-La_Azteca-Kenner_Louisiana.html#review355283407", "text": "We were staying down the road from this place and the food sounded interesting. When we arrived, no one greeted us, but it's a small, seat yourself type resteraunt, so that's okay.\n\nUnfortunately, this place seems to serve primarily as a bar scene and not necessarily a restaurant. They were playing music which was much too loud. It was difficult to communicate with our server over it. Our server tried to tell the man controlling the radio to turn it down, which he did, but barely enough to notice a difference.\n\nService is a little slow, but the waitress attempted to be as attentative as she could be while still serving at the bar.\n\nNow for the good things - the food is absolutely delicious. With their primary customers being Latino and the family who owns the place being Latino as well, they serve very authentic meals. There menus are in Spanish, but if you ask, they do have an English menu for those that don't speak Spanish.\n\nMy significant other ordered the Tbone and I ordered the Meat Pie. \n\nThe Tbone was cooked thoroughly, was well seasoned, and came with rice, pinto beans, a salad and tortillas - which were all equally as good.\n\nThe Meat Pie comes in two baked shells, with ground beef inside that was seasoned and juicy. They throw a mix of cabbage and greens on top with a cream sauce, salsa and tomatoes. That comes with rice and a side of refried beans which were amazing. \n\nAs for the staff, the girl that served us was sweet and took good care of us. One of the pies that I had was overcooked - the meat inside ended up burnt. When I told the waitress, she apologized and told her boss, who not only gave us a free desert (it was a flan) which was delicious, they also took the charge off for my food.\n\nI highly recommend this restaurant. Even if the atmosphere doesn't seem that great and the music is loud, their food is delicious and I really feel like if they would just turn down the music, they could be as popular as any large restaurant around.\n\nIf you want AUTHENTIC food, this is the place to go.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-14T06:47:17-0400", "location_id": "4256649", "id": "355283407", "user": {"username": "Ashlea J", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-11", "title": "Would not return", "url": "https://www.tripadvisor.com/ShowUserReviews-g40247-d4256649-r328689995-m11068-La_Azteca-Kenner_Louisiana.html#review328689995", "text": "The server was very nice but the service was really slow.  My food did not come out hot and the flavor was average at best. Worst salsa ever.\n\nIf you do try it, just be aware the whole menu is in Spanish.  If you don't speak the language, it may be difficult for you to order some things.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-11-23T14:18:49-0500", "location_id": "4256649", "id": "328689995", "user": {"username": "ladynole27", "user_location": {"name": "Pace, Florida", "id": "34524"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Great food!", "url": "https://www.tripadvisor.com/ShowUserReviews-g40247-d4256649-r200863551-m11068-La_Azteca-Kenner_Louisiana.html#review200863551", "text": "I was staying down the road and felt like having some Mexican food. I came here and really enjoyed it. If you want the real thing, try it!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2014-04-12T15:22:03-0400", "location_id": "4256649", "id": "200863551", "user": {"username": "Don224", "user_location": {"name": "Lafayette, Louisiana", "id": null}}}]}