{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2014-09", "title": "Horrible service", "url": "https://www.tripadvisor.com/ShowUserReviews-g29092-d4539399-r230116817-m11068-Pizza_Man-Anaheim_California.html#review230116817", "text": "I work for a \"big box\" company and we had ordered some food from this place. We only get an hour lunch, so we decided to order our food around 5:45pm, when I placed the order the chick at the counter said it would take about 35-45 minutes, so we said it was ok'd being that we were planning on going to lunch at around 6:45-7pm. It was 7:35 and the pizza and the rest of the food hadn't arrived. I called the place and the lady said the driver was outside, I told her I was outside and that there was nobody there. Finally after almost 2hrs of waiting for the food, the driver shows up and says that he was lost because he was new!!!!! We signed for the food and he dares asks for a tip. Here's a tip I said, learn the streets first and then maybe you can get a tip. To my disappointment, the food was obviously cold, under cooked, greasy, and nasty!!!! They charged me for a deluxe salad ($8.99) and all it was was salad from a bag with \"toppings\". I asked for ranch dressing for the salad, wings and pizza and what we got was some nasty Caesar salad dressing that tasted like blue cheese... The pizza was so greasy that since the driver took for ever to get it to us the box started to fall apart from the middle, I could seriously feel the little white plastic thing they put in the middle of the pizza coming thru the box. Ugh so disappointed, I really don't think that I would ever go back to this place. Then the lady, of course, after calling her 7 times, tells me I will give you a discount for next time, I said no, you are giving me a discount today because I am pretty sure there won't be a next time, trust me. Then she says, \"it's not really my responsibility to baby sit the driver\". Balls she has, balls!!!!! So my friends please, don't you guys ever get food from this nasty place... Oh yeah our bill was $61.00, what joke right?!?!?!?!?!? Never trust this place or anybody telling you that this place is amazing.... ALL LIES!!!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2014-09-21T08:16:24-0400", "location_id": "4539399", "id": "230116817", "user": {"username": "olvj0508", "user_location": {"name": "Fullerton, California", "id": "32416"}}}]}