{"paging": {"total_results": "8", "skipped": "0", "previous": null, "results": "8", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2016-03", "title": "WORST MOTEL EXPERIENCE EVER", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r357165027-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review357165027", "text": "I went here to rent a room last night sat. Msrch 19. since it was close to my daughters apt. It was me and my 3 young kids. I went inside to inquire and a oriental attended me. Told me it was 60.00 plus 5 dls for room key. He have me registration form to fill. He didnt asked how many people or if i wanted non smoking or not. He said there was just 1 last room with 2 beds. Felt lucky, so i thought.\nThe place looked beat up from outside but i wanted to give it a try.never judge a book by its cover its been said. Boy! Was i wrong!!!\nWent to our room..# 108 which is located a bit rear. Saw lots of people smoking.\nOpened door and it smelled just like someone smoked there. Room has grafitti on walls, very dirty carpet. Mini freezer not working, remote neither, bathroom very dirty and shower curtain was cut from bottom..dirty and stained toilet which made me scared to sit. Room was hot also, AC cover was removed and was on floor. One chair only and was all torn up.\nWithing half hr someone knocked on my door.. A meth head was knocking and said...wrong toom! Made me scared.\nThen one person started smoking outside and the smell penetrated through the AC.\nThrew the blankets on the floor scared they would have all sorts of fluids and with the feeling they havent been washed in a long time.\nThe air inside the room was umbreathable and full of chemicals that I gathered my belongings and kids and left. Slept in my car for the night. Felt relieved and safer ad was breathing  nice clean air again.\nI totally disencourage anyone from going there unless you use drugs and dont care for your overall health. Will be complaining so the city can do something about this place and stop robbing people because that place is a total dump.\nI didnt eve  complained with managememt   because i knew i wasnt gonna get my money back. BEWARE PEOPLE. you have been warned!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-03-20T17:12:40-0400", "location_id": "271328", "id": "357165027", "user": {"username": "Maria E V", "user_location": {"name": "Yuba City, California", "id": "33302"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-08", "title": "Nice Motel/ Hot Springs", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r322020517-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review322020517", "text": "We live in town and wanted to try the hot springs pools here. This quaint little motel is outdated but kept up. The price for 1 day is kind of outrageous but it is well worth it because of the pools. The chlorine was pretty strong but has to be added for health department requirements. Other than that, I would definitely recommend this little motel especially if you are local, because we should always shop locally to keep these small business owners up and running.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-10-26T09:44:21-0400", "location_id": "271328", "id": "322020517", "user": {"username": "jeajeapip", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-06", "title": "I WILL ASK DEPARTMENT OF HEALTH FOR A THOROUGH INSPECTION AND CLOSURE", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r282219907-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review282219907", "text": "My girlfriend and I stayed in your motel on Saturday night in room 104. We had a little baby with us.\n\nFew items to address:\n\n1. The person who worked the desk on Sat night and Sunday afternoon was extremely rude and loud. He has no understanding of elementary customer service.\n\n2. The room was very dirty and smelly. Microwave was dirty, There was a lot of dirt and ants, and trash under the beds. I saw all of it when I was looking for my glasses.One mattress in the room smelled like pie, In check under sheet, the was another sheet to cover pee damage in the mattress. Someone smoked in the room earlier the carpet smelled. Later I asked to change the room because we have a 2-month old girl with us, he refused and said there are no rooms available. The attendant said that \"I am too picky\" That was a lie because many rooms were empty and parking lot was almost empty as well. The mattresses were like they are about to fall apart, walls were dirty. Floor and walls crawling with biting ants, cockroaches, and mosquitoes.  The windows are filthy and the screens have holes in them from being so worn down over the years.\n\n3. The attendant started screaming at me when I bought 1 gallon of water and poured a little of cold water from glass near the microwave. He said \"why are you drinking this water if you just purchased one\". Apparently he didn't care about the issue of dehydration, I only had a little bit of water in small styrofoam cup.\n\nThe place overall, especially motel is a health hazard for kids and adults.\n\nI requested a full refund for your motel, because we couldn't even fall asleep in this dirt.\nIf they will not refund, I will make sure that Department of Health will have a thorough sanitary inspection of this property very soon.\n\nAs to your customer service, I don't expect to see a happy face, but he cannot scream, cuss, and talk dirty to me.  This will be addressed to the appropriate department as well....\n\nSo I am waiting for the refund of $87 within 48 hours.\nI have been to THIS place many times, and have been a loyal customer, but after this, I will never come back to this place again and hope it will be closed soon.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-06-22T14:49:27-0400", "location_id": "271328", "id": "282219907", "user": {"username": "Dennis B", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-07", "title": "Horrible hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r217899603-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review217899603", "text": "Do not come to this hotel. I found six needles woven through the grooves in the whool of the carpet. This mean drug addicts were using needles to shoot dope. I swear off my child would have stepped on one of those needles I would have went bananas. The maid told me that she couldn't clean my room today because it was too busy. There's gang writing all over the walls. The toilets are black. The Spanish maid Ledea won't even vacuum the carpet. The woman doesn't speak English!! She doesn't clean the sinks or the toilets or nothing!! All she does out is changes the sheets and empties the trash! Please iff you do not want you or your child to get stuck by heroin needles do not come to this hotel.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2014-07-27T20:45:28-0400", "location_id": "271328", "id": "217899603", "user": {"username": "Antonia M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2012-09", "title": "Most Disgusting place i have ever seen !!!!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r139961068-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review139961068", "text": "We only there 15 mins and saw dozens of roaches!!! The room looked like something out of a 70s horror film. It was so dirty and disgusting there was noway we could have stayed there. I was with my family and would have felt more safe sleeping in our car on the side of the road. STAY AWAY FOR THIS DUMP!!!!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2012-09-10T21:24:27-0400", "location_id": "271328", "id": "139961068", "user": {"username": "jason g", "user_location": {"name": "Livermore, California", "id": "32635"}}}, {"lang": "en", "rating": 5, "travel_date": "2011-08", "title": "Day Trip to LE Hot Springs", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r117369246-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review117369246", "text": "Can't say anything about the rooms since didn't stay overnight.  However, there were no meth heads (actually all of downtown LE is looking better), the grounds were clean, the pools inviting & the people pleasant.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2011-08-28T12:34:11-0400", "location_id": "271328", "id": "117369246", "user": {"username": "dlbevard", "user_location": {"name": "Sun City, California", "id": "33143"}}}, {"lang": "en", "rating": 1, "travel_date": "2007-10", "title": "Cockroaches and Meth Heads", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r14620740-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review14620740", "text": "I've stayed in this place before but it's gone horribly down-hill.  The Korean managers act very suspicious to anyone who is not Korean.  Yet they rent out some of the motel rooms to people with vouchers on a monthly basis and as a result I saw several broken windows in rooms.  In fact the bathroom in my room had a bolt on its door so that anyone climbing in through the bathroom window (which faced a dark parking area and had a sliced through screen) couldn't access the rest of the room.  A local police officer told me it was a bad place to stay because of the meth problem in the area and the people they rent to.  But, for me, the ultimate gross-out was the cockroaches in the room.  When I complained, the manager told me they have a weekly fumigation of all rooms and offered to bomb my room for me.  I opted for the roaches rather than the toxic fumes and had to open every single bag outside of my home when I left because I was terrified one may have crawled into my bags.  Really dirty, gross and unsafe. Don't leave anything in the room that you might be sorry to see disappear.", "helpful_votes": "7", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2008-03-28T19:33:45-0400", "location_id": "271328", "id": "14620740", "user": {"username": "IndigoBlue22", "user_location": {"name": "La La Land", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": null, "title": "Warning, don't stay here", "url": "https://www.tripadvisor.com/ShowUserReviews-g32595-d271328-r3632206-m11068-Lake_Elsinore_Hot_Springs_Motel-Lake_Elsinore_California.html#review3632206", "text": "We got booked with a group of soccer players in town for a tournament.  No other rooms available at any other hotel (in quantity).  This place was horrible.  Stay away from it.  Rooms were disgusting.  Tried to switch to other room but the other room offered was worse.  Walls were dirty, carpet was stained, furniture was sticky.  We were afraid to be here.  Booked for two nights, but moved to not great (but better) room at LakeView Inn the second night.  The room price for the \"Resort\" was 74.50, what a joke!  It ruined our whole weekend.\n", "helpful_votes": "54", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2005-07-02T20:00:00-0400", "location_id": "271328", "id": "3632206", "user": {"username": "bonzlb", "user_location": {"name": "Ventura, California", "id": "60769"}}}]}