{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "good for locals or visitors; great location", "url": "https://www.tripadvisor.com/ShowUserReviews-g45963-d11812702-r436466796-m11068-Evel_Pie-Las_Vegas_Nevada.html#review436466796", "text": "I visit East Fremont frequently, and I noticed that a new eatery opened up in a previously occupied space. Frankly, what got my attention was a sandwich board offering a slice of cheese pizza and pint of PBR for $5.00. (Not a bad deal:  per the menu board, a slice of cheese pizza is listed as $4.00, and a pint of domestic beer as $4.00.)\n\nEvel Pie looks like a combination of an old fashion NYC pizza joint (+) a neighborhood dive bar. The inside is comfortably worn, but clean. It’s decorated with eclectic kitsch—most paying tribute to Evel Knievel. There are small table games at the bar, and on the tables.\n\nThe bar has a good selection of beers on tap, and in bottles and can. They also serve cocktails.\n\nBut I’d like to focus on the pizza. (You can buy slices or whole pies.) What I liked best about the pizza was the crust. It was a really good NY style slice: the crust was not too thick, not to thin; it was nice and crisp, but not dry; and when you folded it, it had a really nice “crunch”. The topping was of good taste and quality, and sufficient quantity.\n\nIt wasn’t too crowded while I was there. (Maybe because it was midday, mid-week; maybe because this place had been open for less than a week.) But I can see this place as being a great place to hang out with friends for some “day drinking”.\n\nBottom line:  If you are a local, it a nice place to hang out. If you are visitor, it’s a nice place to get some good food and drink and a “non-tourist” prices.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-11-11T14:36:51-0500", "location_id": "11812702", "id": "436466796", "user": {"username": "pchnmain", "user_location": {"name": "LA/OC", "id": null}}}]}