{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Too busy to give great service- its good thing or a bad thing, depending on how you look at it.", "url": "https://www.tripadvisor.com/ShowUserReviews-g32635-d10770560-r433614145-m11068-Pura_Vida_Cocina_Latina_Sangria_Bar-Livermore_California.html#review433614145", "text": "This bar recently changed its image and is much busier than the old bar.  However- the place is busy and not enough staff.  We sat at the bar and watched as food was cooked and drinks made for others, as our drinks became empty and nobody noticing that we needed another drink.  The food was good and interesting.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-11-01T07:47:13-0400", "location_id": "10770560", "id": "433614145", "user": {"username": "LEPRICN", "user_location": {"name": "Livermore, California", "id": "32635"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Out of Paella already?", "url": "https://www.tripadvisor.com/ShowUserReviews-g32635-d10770560-r417625958-m11068-Pura_Vida_Cocina_Latina_Sangria_Bar-Livermore_California.html#review417625958", "text": "We visited Pura Vida on a Sunday arriving just before 5pm.  Pura Vida is located amongst a number of restaurants and other establishments in downtown Livermore.  Parking on the main street is available but there is plenty of side street parking and lots including a gravel lot behind Pura Vida with access to the back courtyard of the restaurant.  There is seating outside on First St as well as inside, though it is quite dark inside partly due to the design of the interior as well as the color scheme chosen.  As mentioned above there is outdoor seating in the back courtyard that can be comfy in the warm weather as the evening sun does not intrude due to the neighboring buildings.  Per the title we were very disappointed that they were out of Paella before 5pm on a Sunday.  I would say this is really not acceptable considering it is one of their signature dishes and that Paella is not found that frequently plus this is at a time before the dinner crowd hits.  Pura Vida presents a blend of mostly South American dishes and their menu is concise.  We ordered their El Salvadoran Pupusas and their special Beef Empanadas.  The Pupusa was one large one instead of several smaller ones.  Texture was good with stretchy cheese and some pork.  An easy dish to share.  Pupusas are not always flavor-popping but neither are they bland.  The entree came with a black bean salad in a shot glass and a slaw that had some heat to it.  The other dish we picked was a special of Beef and Mozzarella Empanadas, this is different than their regular Chilean steak empanadas that are smaller sized.  The B&M Empanadas was essentially ground beef with the mozzarella.  It was my error not questioning what the beef structure was.  The ingredients inside the empanada, overall, were not exciting.  The pastry aspect was alright but would have preferred more browning.  With this order we received 2 decent-sized empanadas.  Pura Vida is casual and our server carried this theme as well so the experience was relaxing.  Food we had was not something we would return for.  Still wondering how the Paella would have been.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-12T13:39:17-0400", "location_id": "10770560", "id": "417625958", "user": {"username": "flashncrash", "user_location": {"name": "Berkeley, California", "id": "32066"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Needs waiter training", "url": "https://www.tripadvisor.com/ShowUserReviews-g32635-d10770560-r415832977-m11068-Pura_Vida_Cocina_Latina_Sangria_Bar-Livermore_California.html#review415832977", "text": "I made a reservation for 6:30pm on Friday night.  Our table for 5 was ready and we ordered a pitcher of red Sangria and 4 dishes.   Surprisingly, they were already out of the Paella which I heard was delicious.  It's the start of the weekend on Friday night so that was just weird.  Acceptable until the rest happened.  Anyway, the waiter came over with 4 glasses filled with ice and some oranges for the 4 of us there and delivered our sangria which really was delicioius.  In the mean time our tuna tartare with plantatins appetizer came.  This looked pretty but the tuna was gritty and it was missing acidity for me, but my friends liked it.  The plantains weren't fresh.  I didn't care for them at all.  One friend came about 30 minutes late so we asked for a glass for her.  We hadn't seen the waiter so we had found the maitre d'.  He brought over an empty glass without the ice and fruit (sort of annoying but we just let it be.)  Then we realized the other 3 appetizers hadn't come plus our pitcher was empty.  The waiter still didn't come back.  We asked another waiter or server about the other food and she said they only have one oven since it gets so hot in there so things take some time.  We accepted that and waited for our waiter to get another pitcher.  Finally, we were hungry and wanted drinks so we went to the maitre d' this time and instead of helping us he searched for our waiter.  The waiter looked for our other food and came back saying we only ordered the one dish.  That was weird!  There was no way we ordered one dish.  There was absolutely no way to confuse our order.  Just so strange.  Then he said it would take 20 minutes unless we just got plantain chips.  We decided to leave and nobody came to apologize or make us feel better.  They just didn't care.  Here is your bill.  Just really bad customer service.  \n\nI would go for the red Sangria only.  It was really good but skip the food.  (I heard the white sangria was terrible from my friend but I think it's a personal preference.)", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-09-07T11:12:11-0400", "location_id": "10770560", "id": "415832977", "user": {"username": "tobshan", "user_location": {"name": "Livermore, California", "id": "32635"}}}]}