{"paging": {"total_results": "5", "skipped": "0", "previous": null, "results": "5", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2016-08", "title": "Not what we were expecting", "url": "https://www.tripadvisor.com/ShowUserReviews-g42412-d8415895-r413707232-m11068-The_GameShow_Presents_Room_Escape-Livonia_Michigan.html#review413707232", "text": "This was the third escape room that I have played. The other two were in different States. The escape experience in Oklahoma City, (a prison escape), was so much fun and the host ran the place very professionally. It was clear that he loved his job. The second escape was in Roswell, NM. Needless to say the escape was alien themed. It too was fun, difficult but exciting and there too the host was clearly enjoying the game. Both places watched us on a monitor and dispensed excellent brain teasing clues when we got off track or became totally lost.  I cannot say the same about GameShow Presents in Livonia, MI. The host seemed bored and would rather be somewhere else. They were not helpful or interested in anyway. When we had to ask for a clue they only said that they needed more information and a better question. That translates to they were not watching us as we put things together and got stumped. Plus they charged twice as much as the other two places. Not fun at all and would not recommend. They really need to scope out the other escape rooms and see how a well run escape experience is presented.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-09-01T16:50:46-0400", "location_id": "8415895", "id": "413707232", "user": {"username": "GeekyGranny", "user_location": {"name": "Carson City, Nevada", "id": "45926"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Terrible.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42412-d8415895-r335093211-m11068-The_GameShow_Presents_Room_Escape-Livonia_Michigan.html#review335093211", "text": "I have to start this by saying i have never written a one star review to my knowledge or memory.\nThis is not a review based on the actual room escape, as i will not be a customer at this location for the game.\n\nI saw a groupon for this event for $96 for 4 people to go to a 60 minute room escape game, and i have been to a couple already myself, not any costing much more than $25 or so. I was naturally curious about what kind of rates they usually have, bringing me to their website. on their website their advertised price is $24/person for one room and $54/person for the other room. \nThis caused me to wonder if perhaps one room was larger and required more time and people to complete, so i gave them call. \n\nThe gentleman on the phone told me that must have been a mistake and that none of their rooms cost $54/person and they are all one hour long. I was then told that someone else could call me right back and get me a \"special rate\"\nright away at this point i had a bad feeling.\n\n4 hours later he calls back, forgetting he had ever talked to me and asked me if i had any questions, when i told him i was waiting on someone to call me back for a rate, he said \"i promise someone will call you back in 4 or 5 minutes, no more than that\" and he said something about my rate being closer to $20.\na half hour later i get a call from someone (she was very unprofessional) asking me when i wanted to book my room escape game, i explained to her the scenario and she was terribly upset that i wasn't prepared to book the room at that moment, and when i asked her why one room cost more than double the other room she says \"i dont know, that's just what the owners charge\" and i asked if more people were required or if there was more time allowed to solve it if they are more intense, she says \"i dont know that-that's like asking why the mcchicken is 1.49 and the double cheeseburger is $1.99 at mcdonalds, what the owners charge is just what they charge\"\nI tried to return the conversation back to what my actual rate is, and she said \"oh yeah and he tells me you want to book and i call you back and you tell me oh no i don't want to book i just wanna know WHY WHY WHY\"\ni let her know that i would like to speak to a manager, and that i don't understand why i am getting the run-around, and i can't book without even knowing what they are charging me for, and she says they don't have a manager, and that she can ask someone to call me back.\n\nI absolutely love room escape games, and was very excited that there was one with 2 rooms so much closer (livonia vs. ann arbor or royal oak) but will unfortunately not get to try this location as they have undoubtedly lost my business for good.\n\nGood luck to all of you.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-12-26T11:40:42-0500", "location_id": "8415895", "id": "335093211", "user": {"username": "amylovesaruba", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "Bravo, Bravo!", "url": "https://www.tripadvisor.com/ShowUserReviews-g42412-d8415895-r315460834-m11068-The_GameShow_Presents_Room_Escape-Livonia_Michigan.html#review315460834", "text": "Lots and lots of fun. Much different than what I expected, very interactive and organized. It was 6 of us and we beat the clock with 6 minutes to go. If you want something entertaining I highly recommend!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-10-01T15:14:53-0400", "location_id": "8415895", "id": "315460834", "user": {"username": "StewartCritic", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-07", "title": "Horrible Escape room. Do yourself a favor and try another Escape/Breakout room", "url": "https://www.tripadvisor.com/ShowUserReviews-g42412-d8415895-r291296714-m11068-The_GameShow_Presents_Room_Escape-Livonia_Michigan.html#review291296714", "text": "Were a fun couple that travels the states trying different Escape/Breakout rooms. This was by far the worst. We saw it recently opened, so we were excited by the new  adventure. It just so happened I had 5 family members in town to try it with us. The rooms literally looked like they just setup a random game, in a random office and threw random things in the room to \"Theme it up\". The girl running the room sat in a chair in the corner of the room texting and taking selfies while we played the game in a room with her. Puzzles were very hard to connect and honestly just weren't fun. Overall, very unprofessional and oddly amateur setup.", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-07-21T19:21:32-0400", "location_id": "8415895", "id": "291296714", "user": {"username": "simplelux", "user_location": {"name": "Overland Park, Kansas", "id": "38969"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-07", "title": "Not much to see from the outside, but lots of fun once you enter", "url": "https://www.tripadvisor.com/ShowUserReviews-g42412-d8415895-r285041161-m11068-The_GameShow_Presents_Room_Escape-Livonia_Michigan.html#review285041161", "text": "This was my first time doing an escape room and I definitely wasn't disappointed. I found this place through a LivingSocial coupon. I brought my 14 year old daughter and 11 year old son. I called first to make sure it was age appropriate. The person who answered the phone was amazing. We hit it off right away. If the rest of the staff was like her, I knew I wouldn't be disappointed. I STRONGLY encourage you to call first in order to get the best price. They opened the place for us earlier than usual so my kids and I could explore the room as a trio instead of with another group. This level of customer service is unheard of. When we arrived, our greeter, Les, was fantastic. He was funny, kind, and gave us just the right type of hints when he realized that we may not get something. Going with a group of 3 is definitely harder than going with a group of ten. There were also some tricky puzzles to solve that might be easier for older kids. However, my kids and I were able to do everything. While we didn't escape the room in 60 minutes, Les did allow us to stay an additional 3 minutes in order to figure out the final puzzle. Therefore, we escaped in 63 minutes! It was the most fun we had in a long time. My kids instantly said that they wanted to come back with friends. Because I don't know if they change the room and the puzzles, we will probably wait a while. However, this is definitely a family-friendly event.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-07-02T08:05:43-0400", "location_id": "8415895", "id": "285041161", "user": {"username": "Family_Of_4_From_MA", "user_location": {"name": "Western MA", "id": null}}}]}