{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Fascinating Tour of LA Times headquarters, editorial and printing", "url": "https://www.tripadvisor.com/ShowUserReviews-g32655-d560858-r396679662-m11068-Los_Angeles_Times_Headquarters-Los_Angeles_California.html#review396679662", "text": "For travelers looking for an unusual activity in downtown Los Angeles, look no further than the LA Times. This is apparently the last major newspaper to offer free/public tours of both their editorial building as well as of their printing plant. While I must confess to reading my news digitally most of the time, I have always been fascinated by the process of creating and disseminating the news, so I was pleased to be able to find tours scheduled during my short visit to LA. Note that kids over 8 yrs old are welcome, but this may not appeal to all kids. \n\nIf you're interested, here are the basics: first, tours are scheduled and led by Darrell, a long time Times employee who does a great job describing the history of the paper while weaving in the history of LA too. Tours are not operated on a regular schedule, so you need to call or email him to arrange a tour. Note that Darrell is far more welcoming and engaging in person than he is on the phone, so don't be put off if you sense a lack of enthusiasm during your initial communications. \n\nTwo different tours are offered. One is the editorial tour, which includes the beautiful lobby of a really great Art Deco building. The tour is roughly an hour, and is filled with journalistic anecdotes, but is basically a walk through of the main editorial area which can occasionally include intros to staff members and a few other surprises. What you see may look like generic office space but Darrell brings it to life. \n\nThe second tour , also about an hour long, features the actual printing of the papers, at the LA Times Olympic plant, a few miles away from the headquarters. This was a completely different tour, more interesting visually, as it's fascinating to see how newspapers are printed these days. Our tour was in the evening, and the presses were running , so it was pretty loud but really educational. \n\nMaybe printed news will go the way of pay phones (check out the phone booth in the main lobby) pencils, microfilm/microfiche, and cassette tapes ( all of which were spotted on our tour and which the youngsters could not identify), so take the tours while the LA Times and Darrell are still willing to offer them. \n\nNote that we were visiting from Seattle and invited several local friends to join us, none of whom had heard about this tour. It should appeal to locals as much, if not more, than to tourists. Info on the tours is hard to find on the LA Times site, but a Google search of LA Times tours should get you the info you need to contact The Times and arrange a tour.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-25T08:31:45-0400", "location_id": "560858", "id": "396679662", "user": {"username": "jeniferb", "user_location": {"name": "Seattle, WA", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": null, "title": "Cool looking building", "url": "https://www.tripadvisor.com/ShowUserReviews-g32655-d560858-r250502136-m11068-Los_Angeles_Times_Headquarters-Los_Angeles_California.html#review250502136", "text": "Really nice building, in the midst of lots of places to walk by, this is definitely worth a minute to stop and check it out.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-01-22T06:37:51-0500", "location_id": "560858", "id": "250502136", "user": {"username": "Openfj0re", "user_location": {"name": null, "id": null}}}, {"lang": "fr", "rating": 4, "travel_date": "2014-06", "title": "rentrez !!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32655-d560858-r211586024-m11068-Los_Angeles_Times_Headquarters-Los_Angeles_California.html#review211586024", "text": "nous étions devant une entrée secondaire du batiment et voyant qu'on cherchait à prendre une photo de \"Los Angeles Time\" (comme à NY où le batiment du NY Times est très joli), qqun s'est approché et nous a conseillé de rentrer par l'entrée principale et de jeter un oeil.\n\nce n'est pas juste un batiment ; dans le hall d'entrée y est retracée l'histoire du Times. et les unes les plus marquantes sont exposées (assassinat kennedy, 11 sept, bug an 2000 ...), il y a aussi une ancienne presse.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-06-22T18:29:45-0400", "location_id": "560858", "id": "211586024", "user": {"username": "travelover75paris", "user_location": {"name": "Paris, France", "id": "187147"}}}]}