{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Pleasant and extremely helpful staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g60891-d6102713-r433776606-m11068-Thorndike_Factory_Outlet-Lowell_Massachusetts.html#review433776606", "text": "We had a great visit and although we didn't really find what we were looking for, there's no question that the staff here did all they could to help!  We'll probably be back in a month or so to finalize our decision-making.  Here's a good tip, bring cushions you want to match and plenty of photos on your phone in different types of light.  don't hesitate to ask for help.  The staff really knows what they are doing here!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-11-01T14:40:20-0400", "location_id": "6102713", "id": "433776606", "user": {"username": "Tim B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Fun to explore, but no bargains or customer service here", "url": "https://www.tripadvisor.com/ShowUserReviews-g60891-d6102713-r336380942-m11068-Thorndike_Factory_Outlet-Lowell_Massachusetts.html#review336380942", "text": "Now that I see that back in 2012 another reviewer said the the guy was about to sell the store and now it's 2016 and it's still there I'm thinking this is part of the whole scam.\n\nI was excited at first b/c few people love a bunch of old junk more than me.  Dusty, grimy piles of merchandise from decades gone by in a freezing cold warehouse is something I usually like, but when I see a place called \"Factory Outlet\" I expect some kind of discounted prices.\n\nNo doubt some of the stuff (like the Chippewa boots and jeans and other items) is of very good quality, but I can get this stuff online or at a flea market and certainly at yard sales for a whole lot less.  This place is full retail, actually higher than retail with a sale going on.\n\nI was interested in a fun box of vintage greeting cards (late 60s or 70s).  The guy tried to make it seem like he was giving me the deal of the century at $8.  Then my husband asked him if he was retiring (since he was telling some others about how he's being \"forced to sell\") and the guy got really mad at the implication that he is old (which he is).", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-01-01T03:48:49-0500", "location_id": "6102713", "id": "336380942", "user": {"username": "Annabella G", "user_location": {"name": "Newton, MA", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-01", "title": "Last of the great old factory outlet stores, I spent over two hours exploring", "url": "https://www.tripadvisor.com/ShowUserReviews-g60891-d6102713-r192029526-m11068-Thorndike_Factory_Outlet-Lowell_Massachusetts.html#review192029526", "text": "I deliver here and finally took the time to visit as a customer, I wound up spending like three hours here exploring the massive inventory. Its like a maze but its kinda cool. Its cool to see the mix of new stuff with old new stuff. I bought two pairs of Chippewa and one Wolverine and it cost $ 305.00. I bought long johns, socks, pair of jeans. The owner is a very honest guy, I wanted to buy an old new pair of boots but he told me not to bother with the old inventory. If you work any kind of industry or even a bus driver etc, you should totally check this place out. They have Carhart jackets and more.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-01-25T10:20:14-0500", "location_id": "6102713", "id": "192029526", "user": {"username": "Aircraft C", "user_location": {"name": "Saugus, Massachusetts", "id": "60961"}}}]}