{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2016-11", "title": "Very horrible experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r434367828-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review434367828", "text": "I understand this is an extended stay hotel, with folks who are here longer term than a few nights. But when I made my trip out to Minnesota, I wanted a kitchen, so I decided to risk it. \n\nI didn't even get to see the nightly prices because I booked as a package, but it seems to have come out to around $53/night. \n\nYou get what you pay for.\n\nThe only kitchen items they had were at the front desk. The only pots and pans they had were scratched teflon coated ones. Those are poisonous!! You are supposed to throw those out if they get scratched. No wonder cancer rates are so high.\n\nThe smell is like a diaper pail full of dirty diapers. In the hallway, in the rooms. I don't know if the smell is coming through the walls or the pipes, but it is really not pleasant.\n\nThe beds are uncomfortable.You only get 3 basic thin pillows on the bed, and a few hangers in the \"closet\" Of course that wasn't enough for me, but they didnt' have any more at the front desk.\n\nTheir \"continental breakfast\" -- Travelocity stated on their website (which is where I booked this trip through) that they had complimentary continental breakfast -- includes a granola bar and coffee!! Two things I do not put in my body! I wanted juice, that is all, because I to mix it with a greens drink powder that I brought with me. If I had known it was not going to be a continental breakfast, I could have stopped on the way to the hotel to pick something up. But my first morning staying there was a disaster.\n\nOther travelers are gross. I think this type of hotel caters to those who don't shower much or don't work??? They smoke, watch loud TV, don't go to bed at normal hours, etc. I am fine with that, I don't mean to judge, except when it affects others, then it is not ok. \n\nIt was not a pleasant experience at all. \n\nAnd it is my fault for not booking a nicer hotel. I just was thinking about the kitchen, haha what a joke. Oh, my faucet in the kitchen sink just turns and turns.... so you never know when it is going on or off (the hot water faucet).\n\nFor $50/night? Definitely not worth it... maybe for $25/night it would have been worth it, equivalent to a hostel. But I know better for next time I am in the Twin Cities for work. \n\nIt is not worth it! Please, be smart and go somewhere else!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-03T11:23:13-0400", "location_id": "95507", "id": "434367828", "user": {"username": "Purify_Your_Body", "user_location": {"name": "Minneapolis, MN", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Terry A", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r434309511-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review434309511", "text": "This was my first stay at an extended stay so I did not know what to expect.\nFirst thing I was visiting family in the area for only one night. So I knew I would just be sleeping in the room and leaving early in the morning.\nThe front desk gal was friendly and as I was a senior she gave me a terrific rate.\nMy room was clean and the bed was comfortable.  \nLooked for an ice maker no one to be found. I had ice cube trays in my refrigerator but I did not use them.\nThe continental breakfast was a granola bar, roll in a bag and individual coffee.\nI'm used to a real breakfast but usually twice the price.  Worked for me as I was going out to brunch later. \nAll in all it was okay and for the low rate it worked for me.  \n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-11-03T08:05:43-0400", "location_id": "95507", "id": "434309511", "user": {"username": "Terry A", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Friendly staff, but horrible housekeeping", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r418223107-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review418223107", "text": "The staff at this location was very friendly and accommodating. I was there Wednesday through Sunday and used priceline to book the room. When I first checked in I went to open the shades and a wasp was on the window inside the room. I then went to turn on the TV and nothing happened. I noticed the power cord was missing. I went to phone the front desk and noticed the phone was missing. When I checked in the girl had stated that the room had just been cleaned which I would think that housekeeping would've noticed all three things. The girl at the front desk was very nice and switched my rooms immediately. The 2nd room was better when it came to those three things, but toilet was a little dirty and there was hair on the shower wall that was not mine. I also found doritos and qtips on the floor. I didn't mentioned it to staff because I just didn't have the energy to changes rooms again. Even though staff was friendly I doubt I would stay at this location in the future.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-09-13T13:59:40-0400", "location_id": "95507", "id": "418223107", "user": {"username": "Tiia M", "user_location": {"name": "Fridley, Minnesota", "id": "43087"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "Room Smell", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r397319362-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review397319362", "text": "When I walked in the window was open even though it was 90 degrees outside with the air conditioner set at 60. The smell in the room made my eyes water. I ended up checking out because there was no way I could sleep there. They used cheap room freshener to try to mask the smoke smell.\nWill not be going back there.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-07-26T04:03:03-0400", "location_id": "95507", "id": "397319362", "user": {"username": "kcoleman2016", "user_location": {"name": "Hampshire, Illinois", "id": "36095"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "Worst hotel experience ever!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r395706741-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review395706741", "text": "Dirty hotel rooms. Customer service was bad. No room service! I called the front desk lady if I could request for a vanity mirror and she laughed at me historically saying that, \"we ain't got none of that here.\" Rude much! Everything was self serviced. Towels were dirty and I found a price of blonde hair on my towel. Found pieces of gums by the desk next to where I was sleeping. This room that we stayed at was not throughly checked and inspected before the next hotel stayers settle. Breakfast was .... No breakfast. I was really disappointed and never felt this disappointed about an hotel experience. For a large hotel, I honestly thought it'd could be better. My expectations for a bit too high for a decent place. If you want to stay in a motel like hotel, go for it. I wouldn't book at any extended stay. You'd be better off at Holiday Inn if you're looking for a decent place. I left the hotel saying to myself, \"never again!\"", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-23T01:14:59-0400", "location_id": "95507", "id": "395706741", "user": {"username": "mimiv8", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "No cash accepted", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r390737494-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review390737494", "text": "I called to make a reservation for my son who was traveling alone across country. They do not accept credit cards over the phone. I asked if the hotel accepted cash (he only had cash) and was told yes with $100 put down for incidentals and the money would be refunded on checkout. He arrived at the hotel late at night and was turned away because they do not accept cash. I called customer service to ensure my cc was not charged and was on hold over 15 minutes. I do not recommend this hotel chain - the reservation people do not know what the hotels accept and overall the entire experience was frustrating.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "I appreciate you bringing your experience to our attention.  Please accept our most sincere apologies for the misunderstanding and confusion with our policies.  This is something new that we have recently put into place, and although it does not help you out at this time, it is for the long term benefit of the hotel and our guests.     In response to your feedback, I have ensured that the reservation booked has not been charged.  The staff and I appreciate your comments, as it will only help us to improve.  If you have any additional feedback, we would like to hear it.  Please contact me, at MGV@extendedstay.com, so we can speak directly.  We hope that you will give us the opportunity to provide you with a better experience the next time you're in the area. ", "title": "Owner Response", "published_date": "2016-07-14T07:51:35-0400", "id": "392541754"}, "trip_type": "Solo travel", "published_date": "2016-07-09T08:52:19-0400", "location_id": "95507", "id": "390737494", "user": {"username": "Ellejaay", "user_location": {"name": "Billings", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Inaccurate Description", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r382343611-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review382343611", "text": "On going to the hotel, it is loaded with signage stating that it is a smoke free hotel and that smoking was not permitted within 100 feet of the building. However, there were several people right at the entrance smoking every time we entered or exited the building.  \n\nWhen we entered our room the smell of second/third hand smoke was intolerable.  They did not have any other double bed room, however, the clerk at the desk said they had a King and that would actually be cheaper.  When we got to the room it did smell better, however, their king rooms do not even have a couch/hide a bed.  Since we were counting on our 5 year old grandson sleeping in the other bed there was no place for him to sleep.  Consequently, we tried to sleep all in the King.  When that didn't work, sometime in the middle of the night, my wife tried to cuddle up on the Lazyboy (which did not fold down very far) and covered herself up with towels for blankets.\n\nThe next morning when we went down for our \"Free grab-and-go breakfast\" it turns out that this is basically vending machines that have coffee/cocoa and plastic wrapped breakfast bars.\n\nWhen we checked out, the checkout clerk told us that we owed an additional $5.24 for the King Room.  We flat out refused to pay this silly amount, especially with all the inconveniences we experienced.  She said we would have to take that up with the manager (that wasn't available).\n\nWe would never even think of using this hotel ever again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-13T19:03:19-0400", "location_id": "95507", "id": "382343611", "user": {"username": "Ken S", "user_location": {"name": "Hermantown, Minnesota", "id": "43157"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-04", "title": "One of the top 5 worst hotels I have visited in 50 years", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r364000843-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review364000843", "text": "1.\tThe facility is dated and not as clean as we would expect.\n\n2.\tThe registration clerk, Jasmine, was cordial and said if we need anything please ask. By the way, I, (Jasmine), can’t leave the front desk?? What if someone physically needed help with a room issue, non-working TV etc.?\n\n3.\tThe toilet seat was very loose and I wasn’t about to try to reach under to tighten the screws assuming it could be done.  Safety issue.\n\n4.\tIt was a handicapped room. Why, we didn’t ask for one?\n\n5.\tWhen we made our second trip to get the balance of our suitcases, brief case, etc. we asked if we could have 2 extra pillows (there were only 3 for two people). Jasmine said we don’t have ANY extra pillows and not allowed to take some from a different room!!!  When we returned from dinner we asked again and same answer, not one extra pillow anywhere re!!  We are full. I guess a lot of people walk to the hotel, as the parking lot was half full after 9PM.  Even if it was 100% occupied, a rare occasion, why no extra pillows for the entire facility!!\n\n6.\tThe refrigerator had leftover food, pizza, and other food items.  Was this room even cleaned?\n\n7.\tThere were no glasses, cups, plates, utensils, coffee pot or coffee, pots or pans, the cupboards were BARE!!  I have never been in a hotel that didn’t have at least Styrofoam or plastic cups.  Ridiculous. I have traveled my entire career over 40 years and this ranks in the top 5 of the worst hotels I’ve stayed.\n\n8.\tThat was the last straw; I went to the front desk and asked for the manager.  Jasmine gave me your business card and said your number was on it.  I called. You know the answer, it’s the main number with 4 messages the last says dial 4 for front desk, in other words a runaround and deflection.\n\n9.\tThe next morning I asked the new clerk on duty, didn’t get her name, that we were checking out and wanted confirmation of the refund. She said it had to come from the 3rd party, booking.com, and we would have to call them.  So, I did, and they said no, the credit had to come from Extended Stay and he put me on hold, talked with her and fixed it.  \n\n10.\tThe only thing that went well was getting our refund for the two nights we didn’t stay.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-13T14:39:27-0400", "location_id": "95507", "id": "364000843", "user": {"username": "Donald S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-03", "title": "nothing special", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r354442904-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review354442904", "text": "staff were very nice. room has a decent sized kitchenette. if you want to cook you have to get pots pans silverware dishes from the front desk. the hallway did smell bad, over all it was a place to sleep", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-10T15:06:20-0500", "location_id": "95507", "id": "354442904", "user": {"username": "sissypreston", "user_location": {"name": "Chisholm, Minnesota", "id": "42944"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-01", "title": "worst hotel stay ever", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r345108622-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review345108622", "text": "employees are thiefs the managment sucks , would never stay at that place again , stinks , keep good eye on your stuff weather it be in your own room , laundry or even outside horrible stay if i could close this place down i would", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-02-04T22:37:05-0500", "location_id": "95507", "id": "345108622", "user": {"username": "dustin k", "user_location": {"name": "Stillwater, Minnesota", "id": "43552"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "Patricia helped me", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r324123952-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review324123952", "text": "This place has excellent service and staff. They hire people that know how to take care of your needs in a professional and comforting manner. Just call and you will see for yourself. Thanks Patricia for being so great! -MR", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2015-11-03T05:03:38-0500", "location_id": "95507", "id": "324123952", "user": {"username": "Max R", "user_location": {"name": "McHenry, Illinois", "id": "36344"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-09", "title": "More of a faux-tel.", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r314921437-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review314921437", "text": "One look at the outside of the building is what you get;  They painted the window frames to match the exterior, and the window stripping is falling off.  When you walk onto a floor, it reeks of cigarettes.  If you have a chronic lung condition, DO NOT stay here!  To try to air out the room, I opened the windows, which didn't have screens due to renovations.  Unfortunately, there was a wasp nest somewhere nearby, so they started flying in the room.  After that I checked the bathroom, which had chunks missing out of the toilet seat.  I checked the bed sheets, and they had what appeared to be food spots on them (not dark enough to be blood).  I worked near a trailer park for a spell, and so I can honestly say that this is very similar.  I checked out early and opted to sleep in the backseat of my car, and I would advise you to do the same.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "I appreciate you taking the time to write a review of your experience with us.  Please accept our apologies for the cleanliness issues you experienced.  To uphold our company’s high standards, I will be reviewing our cleaning and room inspection procedures with our staff.  We continually work to improve our hotel, so I really appreciate you providing us with your feedback.  Please contact me, at mgv@extendedstay.com, if you would like to discuss this further.  We do hope you will choose to stay with us again so we can have the opportunity to provide you with a better experience.", "title": "Owner Response", "published_date": "2015-10-13T04:24:46-0400", "id": "318241226"}, "trip_type": "Business", "published_date": "2015-09-29T17:46:25-0400", "location_id": "95507", "id": "314921437", "user": {"username": "meatshield219", "user_location": {"name": "Moorhead, Minnesota", "id": "43335"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-09", "title": "Worst Hotel I've Stayed at in Five Years", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r310973921-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review310973921", "text": "I normally stay at the Marriott Northwest in Maple Grove- this Extended Stay was terrible- I should have checked reviews on TripAdvisor first.  With the construction expect significant detours in coming and going.  Also, the price I paid on Orbitz was about $20 more than the quoted rate on TripAdvisor.  This place is equivalent to a Motel6 or Super8.  It's dirty, the \"breakfast,\" is a joke, and my room had clearly been smoked in for a long time.  Avoid at all costs of you have kids or asthma.  Walls were yellowed, no fitness center, front desk staff didn't understand the address on my reservation was an Orbitz office in Chicago.  No wake up calls, bare minimum in terms of soap and shampoo.  I stayed there all of six hours and was awake every hour- I should have slept in my vehicle.  Pillows were nice and wall A/C unit did function but didn't remove the smell of cigarettes.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "Thank you for taking the time to write a review of your stay.  I sincerely apologize that our hotel did not meet your needs.  In response to your feedback, I am working with our staff to make sure that everything that you have listed is addressed and fixed in a timely manner.  Thank you very much for providing us with your feedback.  If you have any additional feedback, we would like to hear it.  Please contact me, at mgv@extendedstay.com, so we can speak directly.  We do hope you will choose to stay with us again so we can have the opportunity to provide you with a better experience.", "title": "Owner Response", "published_date": "2015-09-30T04:04:05-0400", "id": "315019027"}, "trip_type": "Business", "published_date": "2015-09-16T07:30:24-0400", "location_id": "95507", "id": "310973921", "user": {"username": "djs4552", "user_location": {"name": "Dickinson, North Dakota", "id": "49761"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-08", "title": "Customer Service Needs Training", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r296678741-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review296678741", "text": "I recently stayed at the Extended stay Maple Grove. The room was adequately clean. It could have defiantly had more deep cleaning but not worth any complaints. There was an issue with my Expedia reservation where the night I came into town I did not have a room. The front desk worked with me and got me a room for the night and told me the rest of my stay would be under the Expedia reservation. After I came back from my business of the day they informed me that my Expedia reservation was gone out of their system and I would have to pay again to stay. They would not help in figuring out why the reservation disappeared and told me to deal with it myself and I would need to speak with their manager the next day. I had to spend at least an hour on the phone with all parties to fix the problem and the front desk fixed the error but with an attitude that they made no error. I will definitely never stay at an extended stay again. If I would have read the other reviews of other guests I would have never booked.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "I appreciate you bringing your experience to our attention.  The situation you described is unacceptable, and I sincerely apologize for your experience.  I met with the staff, and we will train our staff on policies regarding Expedia reservations to ensure that your experience is not repeated.  Thank you very much for providing us with your feedback.  If you have any additional feedback, we would like to hear it.  Please contact me, at mgv @extendedstay.com, so we can speak directly.  We do hope you will choose to stay with us again so we can have the opportunity to provide you with a better experience.", "title": "Owner Response", "published_date": "2015-08-24T06:42:20-0400", "id": "302865924"}, "trip_type": "Business", "published_date": "2015-08-07T11:13:52-0400", "location_id": "95507", "id": "296678741", "user": {"username": "dodgeboy75", "user_location": {"name": "Wildomar, California", "id": "33270"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-07", "title": "Patricia saved the trip", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r294640171-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review294640171", "text": "Having booked a business trip in the Maple Grove area,  we had limited choices due to construction in the area.  The two of us checked in only to find out the room only had one bed for two business men.  The hotel was booked,  the first night one of us slept on the floor.  the next night shrev asking Patricia for extra blankets she asked why,  after we told her our story, she immediately opened up an emergency room for us.  Great five star service by Patricia at the front desk.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2015-08-01T03:59:37-0400", "location_id": "95507", "id": "294640171", "user": {"username": "David B", "user_location": {"name": "Fort Ripley", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-06", "title": "Disgusting!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r284024960-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review284024960", "text": "We booked our room through priceline  and were guaranteed the room rate was for two people. Upon check in with a very rude front desk employee, I told her we needed 2 beds. She told me I would have to pay an additional $10.00 fee even though we were guaranteed a room for 2 people. I reluctantly agreed, and was given my room keys. After entering the room, I turned on the bathroom light for my son. There was hair all over the toilet seat, and in the floor in the bathroom! Gross. I then looked around the rest of the room to see more filth. Crusty cup marks on the counter top, and a blood drop stained comforter on bed. We left the room and returned to the front desk with our belongings to request a new room. The clerk was definitely inconvenienced by us, and our request, but reluctantly obliged. Our \"new\" room wasn't much better. There were onion skin remnants in the fridge drawer, nasty comforters, and crinkled bed sheets which makes me believe the bedding was never laundered from the previous occupant. The bed was just remade. The smoke alarm was hanging from the ceiling by a cord, and the hairdryer in the bathroom was hanging half way down where the screws had stripped from the wall. The hallways were nasty, the glass doors and floors were filthy were filthy.  I will never return to this chain of hotels ever again, and wish I never paid money to stay in this nasty establishment. ", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "I appreciate you bringing your experience to our attention.  The cleanliness of the room you described is unacceptable, and I sincerely apologize for your experience.  To prevent this from happening again, our staff is going to review our policies and training standards.  I will personally work with our staff to ensure each room is cleaned to our company’s high standards.  Thank you for sharing your experience with us.  If you have any additional feedback, we would like to hear it.  Please contact me, at mgv@extendedstay.com, so we can speak directly.  Thank you for choosing Extended Stay Hotels.  We hope we have the opportunity to see you again in the future.", "title": "Owner Response", "published_date": "2015-07-15T06:28:19-0400", "id": "289163736"}, "trip_type": "Family", "published_date": "2015-06-29T16:26:24-0400", "location_id": "95507", "id": "284024960", "user": {"username": "Bobbi J", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-05", "title": "Only stay if you have no other options", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r273812804-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review273812804", "text": "Everything else was booked in the area since I decided to stay very last minute.  The hallways were dirty,  the shower didn't drain, and the room wasn't very clean. I tried to touch a minimal amount of things in the room.... It's not the worst place I've ever stayed,  but it's probably top 5 worst. ..", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "I received a copy of your review, and wanted to take a moment to personally respond.  I sincerely apologize for the cleanliness issues you experienced.  Your comments were reviewed by the staff, and we will work with our housekeeping and maintenance staff to make sure your experience is not repeated.  Your feedback is very important to us, so thank you for sharing.  I hope that you will contact me directly, at mgv@extendedstay.com, should you wish to discuss this further.  It would be our pleasure to have you stay with us again in the future to show you our positive strides taken to enhance your experience with us.", "title": "Owner Response", "published_date": "2015-05-28T04:06:34-0400", "id": "275255390"}, "trip_type": "Friends getaway", "published_date": "2015-05-22T07:37:30-0400", "location_id": "95507", "id": "273812804", "user": {"username": "Knjr", "user_location": {"name": "Whitefish, Montana", "id": "45402"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-03", "title": "Dirty and they are crooks", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r263050404-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review263050404", "text": "I've stayed at other Extended Stays and they weren't too bad, so I gave this one a shot.  Big mistake.  Place is dirty, smells awful, and you don't feel safe.  To top it off they decided they wanted a little spending money so they charged my card an additional $300.  Avoid this place at all costs", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "I received a copy of your review, and wanted to take a moment to personally respond.  Please know that we are sincerely sorry that you did not feel safe during your stay and that you had a negative experience.  In response to your feedback, I am available to discuss any charges that you feel were incorrectly charged to you.  Your feedback is very important to us, so thank you for sharing.  I would be happy to speak with you further.  If you would like, please contact me directly, at mgv@extendedstay.com.  We do hope you will choose to stay with us again so we can have the opportunity to provide you with a better experience.", "title": "Owner Response", "published_date": "2015-04-17T08:13:35-0400", "id": "266261265"}, "trip_type": "Friends getaway", "published_date": "2015-04-01T05:59:45-0400", "location_id": "95507", "id": "263050404", "user": {"username": "Crockin", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-03", "title": "Run down  !!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r262358733-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review262358733", "text": "After driving for 3 day's we finally get here, first off the price I was given at the time of Making our reservation wasn't what I was told at check in,  over  $100 difference, once I showed the front desk clerk my reservation confirmation she gave it to me for the price I was originally told, so anyways  this place is as getto as it can get, get up to our room and it smells like urine and maple syrup,  the bathroom smells like a 420 festival, lots of \"questionable \" people & activities going on here.  DO NOT STAY HERE unless you are a drug addict", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "Thank you for the feedback about your stay at our hotel.  I sincerely apologize that there was a discrepancy in your rate quote.  Your comments were reviewed by our staff, and we will make every effort to make sure your experience is not repeated.  The staff and I appreciate your comments, as it will only help us to improve.  If you would like to discuss this further, please do not hesitate to contact me at mgv@extendedstay.com.  We hope that you will give us the opportunity to provide you with a better stay the next time you're in the area.", "title": "Owner Response", "published_date": "2015-05-11T13:08:56-0400", "id": "271408302"}, "trip_type": "Business", "published_date": "2015-03-28T18:56:06-0400", "location_id": "95507", "id": "262358733", "user": {"username": "Shiloe J", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-03", "title": "They've given up!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43288-d95507-r260965880-m11068-Extended_Stay_America_Minneapolis_Maple_Grove-Maple_Grove_Minnesota.html#review260965880", "text": "One night here was one night too much. I have over one hundred reviews on here and this is close to one of the worst hotels that I've stayed in. It's old, in need of refurbishment and was not very clean. I.e. you can tell the attitude to cleaning when you walk in the elevator and see all the wash marks from where it has been supposedly cleaned (with dirty water it would appear). Stainless has to be polished, at least with a dry cloth. The carpet in the corridors was frayed and dirty. There was also a dirty, greasy smell filling these corridors. Supposed to be a self catering unit with a two burner hotplate but there were no utensils, plates, pans etc. Fridge was old as was the furniture in the room. My bathroom sink would only drain slowly and filled up with water. The towels were tiny and the roughest I've ever felt in a hotel. My wash cloth had yellow stains on it. And to cap it all off was the 'Grab and go breakfast'. This is a cheap marketing way of saying we don't supply breakfast. When you get up or leave (the latter is recommended), in the lobby you make yourself a Kuerig coffee (with powdered creamer), and are offered a granola bar and muffin. That's it. Plus there is nowhere to sit anyway. I certainly won't be looking at staying in this brand of hotel again. If they don't want to spend money here, then save the effort and just close it down. If not, at least make an effort.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Minneapolis - Maple Grove, responded to this review", "text": "The feedback provided in your review is much appreciated.  The situation you described regarding the quality of your accommodations is truly regrettable.  We are very sorry for your experience.  In response to your feedback, I am working with our maintenance engineer and housekeeping staff to better maintain our hallways and common areas.  I also apologize that our new dishware policy was not explained to you upon check-in.  We no longer keep dishes in guest rooms for sanitary purposes; however, these items are available upon request at the front desk.  I will be meeting with our front desk staff to make sure we are communicating hotel policies to our guests clearly.  The staff and I appreciate your comments, as it will only help us to improve.  To discuss further, or if you have any questions, please contact me at mgv@extendedstay.com.  It would be our pleasure to have you stay with us again in the future to show you our positive strides taken to enhance your experience with us.", "title": "Owner Response", "published_date": "2015-04-06T04:10:07-0400", "id": "263942469"}, "trip_type": "Business", "published_date": "2015-03-21T17:35:33-0400", "location_id": "95507", "id": "260965880", "user": {"username": "BlueHeeler777", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}]}