{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": null, "title": "It was good", "url": "https://www.tripadvisor.com/ShowUserReviews-g56255-d4509837-r220125156-m11068-Red_Sushi-McAllen_Texas.html#review220125156", "text": "Was on a business trip to McAllen and Red is right next to my hotel I stay at.  Walked in on a Tuesday night at 8:30 and a live band was playing but only a couple of tables were taken.  Ordered miso soup which was good and the spicy scallop sashimi.    It was very fresh but not so spicy.  Ordered the rainbow roll as an entree and was good as well.  I will be back next time I'm in McAllen and hungry for sushi.   ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2014-08-06T14:23:22-0400", "location_id": "4509837", "id": "220125156", "user": {"username": "Jamtexas99", "user_location": {"name": "San Antonio, Texas", "id": "60956"}}}, {"lang": "en", "rating": 1, "travel_date": "2013-07", "title": "Don't go here for sushi...you'll walk away with a bad taste.", "url": "https://www.tripadvisor.com/ShowUserReviews-g56255-d4509837-r167825498-m11068-Red_Sushi-McAllen_Texas.html#review167825498", "text": "I don't usually join websites and give ratings...but I'm going to do it this time.  I was passing by last Saturday when I saw this establishment (I love sushi), so I looked it up on my phone and called in a reservation for 9 pm.  I went home got all prettied up and dragged the husband out for what I thought would be a cool dinner night - wrong. There was no need for reservations, the place was dead at 9 pm(they highly recommend reservations because they get busy).  I still decided to stay, so we sat outside.  I asked the waitress for a large sapporo beer for my husband and a lychee martini (both staple drinks at a sushi restarant) - 5 minutes later the hostess (who was also our watiress) came back saying they don't have lychee martinis, only skinny girl martinis (whatever that is) and she also asked for the name of the beer again.  I told her he wanted a Sa-ppor-ro and then i requested a drink menu (since we weren’t given one).  She soon came back with his beer and a drink menu...told her I'll take the sangria...another 5 minutes later she came back saying there was none.  I FINALLY settled with a glass of moscato.  I then proceeded to ask some general questions about the menu…this was another no brainer, it was basic questions about the food, what is in it, what would you recommend etc. every question seemed like a dead end.  She either was not sure or did not know and the one role she did suggest, the “McAllen roll” completely and totally sucked.  Another thing was that when I went in to talk to the sushi chef – he didn’t seem like the brightest tool in the shed either.  He seemed like he was only there to make rolls and nothing else.  When I asked if he had any special rolls that were not on the menu he just replied with “I’ll make whatever you want”…well – I didn’t ask that!  As a sushi chef you should be creative, have your own idea, be willing to experiment with your kitchen.  That is what makes a great chef…not someone that just goes off the menu and gets weird when someone wants to talk to you about your food.  I soon gave up hope on him and ordered a squid salad (which was OK because its premade and comes in a frozen bad), had some miso soups (with regular spoons not the traditional spoons), a McAllen role (which was horrible) and another role for my husband which was also just as bad.  After we managed to eat some of the food, we were offered dessert.  I was still hungry and figured that a mochi ice cream would help me survive…THEY DIDN’T EVEN HAVE MOCHI!!  Better yet, the watiress/hostess didn’t even know what I was talking about.  They only had some banana crepe.  We were better off going to Kumori or Hyashi for dinner.  We were highly disappointed with this place.  If management for this place come across this rating – please visit a Kumori or Hyashi and see what they have to offer.  I say this because your establishment is NOT a sushi place, it’s merely a pretty building with people occupying it.  Your staff needs to be more educated on your menu, know what it is they are selling, have your bar better prepared, expand your drink menu, have your chefs start creating more options for rolls and just learn how to manage a restaurant!  I could of done better than this.  I don’t see this place lasting more than a few months.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2013-07-16T11:23:02-0400", "location_id": "4509837", "id": "167825498", "user": {"username": "kg8367", "user_location": {"name": "Edinburg, Texas", "id": "55786"}}}]}