{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "You will not get better pizza in Florida", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r432713685-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review432713685", "text": "This restaurant has 2 distinctly different pizza ovens. A wood fired and a traditional \"ny pizza\" oven. Ive had pizza cooked in both and while I slightly prefer ny over the wood fired they are both excellent. On my last visit Miguel the pizza chef convinced me to  try the Sicilian pizza and I was not disappointed.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-29T10:36:44-0400", "location_id": "8704774", "id": "432713685", "user": {"username": "larry c", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Unbeleievable Italian Food", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r432137448-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review432137448", "text": "We ate outside on a Saturday.  They had a jazz saxaphone player playing.  He was outstanding.  The srvice couldn't have been better.  They left you alone but kept a close eye on you.  The food was great.  It wasn't very crowded but a hurricaine was on the way.  It's on the pricey side, but worth it.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-27T06:50:05-0400", "location_id": "8704774", "id": "432137448", "user": {"username": "Daisyjack11", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Sad la vela is deteriorating", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r432015361-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review432015361", "text": "It was a great place the few times that I did go  there for lunch and dinner.  I had recommended this place to many of my friends. The vegetable lasagna, seasoned vegetables and pizza used to be fantastic. I don't know what has happened. I went there yesterday. We ordered pizza. It was not very palatable. The middle of the pizza was soggy. The pesto fettuccini was very mediocre. Truly a disappointing visit. Not sure I want to recommend it to anybody else now.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-26T21:21:25-0400", "location_id": "8704774", "id": "432015361", "user": {"username": "Pdesai03151960", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Don't bother", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r420557052-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review420557052", "text": "We made dinner reservations on Open Table & the menu presented to us on that site seemed good, so we decided to give it a try despite knowing about all the bad reviews it previously had gotten. We figured after about a year in business, they should have it together by now. Nope. We were wrong. First, when we got there, the menu was totally different. It was very limited & the items that we thought about getting weren't offered. We told our server, who attempted to be very accommodating, however, the chef wasn't! My husband asked if he could get soup instead of a salad, since there was no soup on this menu & there were soups offered on the online menu. He asked for pasta fagioli & our server said he'd tell the chef. I asked for a Caesar salad & asked if they had anchovies to put on it & was told yes. Our server came back & said no pasta fagioli. How about a seafood soup? My husband decline & ordered the same Casesar salad with anchovies as I did. We received our salads without anchovies & with stale bread pretending to be croutons. The salad was good & we were hungry & since our server didn't deliver the salads & didn't come around to check on us until they were almost done, we never got our anchovies, although we did tell our server that they were missing. He offered to get us some anchovies, but it was too late. My husband had a strange piece of something in his salad. We're not sure if it was maybe an artichoke, but it wasn't part of the salad, that's for sure. We were asked if we wanted bread with our meal. Of course! Little did we know we would be charged $2 for it. Who charges for bread?! We were offered a strange mix of olive oil & balsamic for dipping it into. Our main courses were ordered. I ordered a fusilli pasta dish & got rigatoni. It was supposed to have kalamata olives in it & it probably had about 1 olive sliced up in the whole dish. It also had eggplant in it, which was way under cooked & crunchy. The server took my dish away & came back a minute later with a piping hot dish with fusilli. How it got cooked that fast is beyond me. My husband ordered some seafood pasta dish which was served with a closed mussel & he didn't get the small fork to use for the clams, nor was he asked if he wanted any crushed red pepper for the dish. After dinner, we decided to have a drink & asked if they had black Sambuca. Our server said that they did, but in about a minute or so later, he came back & they didn't have any. We decided to call it a night & left. Later that night, I was sicker than a dog. Never have I ever gotten that ill after a meal. DO NOT BOTHER GOING HERE!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-20T08:41:25-0400", "location_id": "8704774", "id": "420557052", "user": {"username": "NY-FL-RA", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Horrible service", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r414235366-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review414235366", "text": "When we sat down, we were the only people in the restaurant.   Our wine, water and salad came in good time.   Additional people came in.  Then we waited, waited, and waited.  About 45 mins later, the waitress said our food was coming right out and the kitchen was a little behind.   We left after another 30 minutes with no food.   Other than salad, no food came out of the kitchen for us or anyone else.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-03T07:39:41-0400", "location_id": "8704774", "id": "414235366", "user": {"username": "Melanie A", "user_location": {"name": "Florida", "id": "28930"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Do Not Go There", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r414192865-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review414192865", "text": "Wow! Probably the worst dining experience I've had in a long time. It was so bad, I felt sorry for the waitress! My daughter ordered the filet mignon. She asked for spaghetti with butter as the side dish. She was served the spaghetti with Marsalla sauce. The filet had been cooked in the same sauce, which she didn't like. The waitress took it away, promising to bring another filet cooked with just salt and pepper. Meanwhile, my SIL had ordered Pizza, which hadn't arrived yet. Long story short, my daughter's steak never arrived. 45 minutes later, the waitress told her the cook had cooked another steak in the Marshall a sauce again. My steak had grown cold while waiting for my daughter's steak to arrive, so the whole meal was a bust. The manager never came to our table to explain or to apologize, but left all that customer relations work to the poor waitress. My daughter and SIL are local and said this is the second time they've had a bad experience at this restaurant. We weren't charged for my daughter's meal, but really shouldn't have been charged for any of it. The people at tbe next table had a problem too and finally left after just paying for their drinks. A classy restaurant this isn't. My SIL's Pizza did finally arrive and it was ok. Small consolation. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-09-03T05:48:16-0400", "location_id": "8704774", "id": "414192865", "user": {"username": "karen p", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Great Food and Atmosphere!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r411523429-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review411523429", "text": "My husband and I were looking for a place to eat in downtown Melbourne and stumbled upon this gem. We got right in, without a reservation, and were seated at a nice table on the large patio. The staff were friendly, attentive, and made everyone feel welcome. We got nice wine, good food, and excellent live music for a very reasonable price! We will definitely be back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-27T11:17:27-0400", "location_id": "8704774", "id": "411523429", "user": {"username": "mjustice81", "user_location": {"name": "Saint Louis, Missouri", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Every visit at this restaurant takes me back to Italy ", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r408522620-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review408522620", "text": "Frequent visitor of La Vela, this is a beautiful restaurant right in the heart of downtown Melbourne. Food is always on point and delicious, pizza straight from the brick oven. Atmosphere is fun and laid back, but perfect for more intimate dates too. Owner Carlo is an absolute gentleman who treats his customers like family. Outside area is lovely with lighting, bar, live music and great views. Servers are very personable and Patrick is awesome! This is the first place in the 3 years that I've been back from Italy that I felt like I was there again. No other place I've been to makes me feel as if I'm there. Definitely my favorite place downtown, please keep it up!!  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-21T21:30:26-0400", "location_id": "8704774", "id": "408522620", "user": {"username": "Aliana F", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-08", "title": "Food average, service awful ", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r406581616-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review406581616", "text": "Took wife for a Friday night out and nice dinner (planned). Went to La Vela after hearing of renovation the. The restaurant has a nice outdoor sitting area where on this Friday a duo performed some jazz music. The food was just okay. The service: it took 15 minutes before anyone talked to us, we ordered wine and water and had to remind waiter to get us the water twice, when he brought our main course I let him know he no longer needed to bring our appetizer and salad we ordered (he said he forgot!). All in all, not a good first impression at all. We might try it again but definitely not on a weekend. They seemed completely overwhelmed as evidenced by other patrons around us complaining about service. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-17T06:20:27-0400", "location_id": "8704774", "id": "406581616", "user": {"username": "Ernie11223344", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Fantastic Local Italian", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r403363139-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review403363139", "text": "Beware of the prices - they are very misleading compared to the **HUGE** portion sizes.  Very intimate, expertly decorated and a very attentive staff.  The kitchen is expertly run and the food is top notch.  Easily 5 star.  Located in scenic downtown Melbourne.  Full bar with tons of drink options.  Not a chain - this is the real deal from Italy.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-08-09T13:00:26-0400", "location_id": "8704774", "id": "403363139", "user": {"username": "Don M", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "\"Outstanding\"", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r398152709-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review398152709", "text": "I have been here with my girlfriend about 2 weeks ago. We come from Italy. We started  with calamari and Antipasto. It were something really amazing. As entrées I took eggplant Parmesan and was incredible. Never ate something like that! My girlfriend took pizza, Italian flag. Omg! Something out of the order! Incredible! It's as you are in Italy. Really really Good!! The server was really good. The name is Patrick. He knows everything about menu! I recommend this restaurant. 100% guaranteed.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-27T14:05:31-0400", "location_id": "8704774", "id": "398152709", "user": {"username": "Davide S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Something Is Terribly Wrong", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r392272649-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review392272649", "text": "The premium wood fired pizza margarita was soggy, lacked a crispy crust as exists in Naples. The chicken parmigiana was so overcooked it was nearly inedible, totally without any flavor. The mostaccioli rigati were overcooked-mushy, probably reheated. The noise from the band was so overpowering that even at a distance we could not have a conversation. I had high hopes for this restaurant but am so terribly disappointed that I will not return. I thought that maybe it was just a bad day for the pizza man but checking other sites on the web  you will find a common complaint that their pizza alla napolitana vera is lacking a crust and comes out soggy. Maybe they think that's how Americans like their pizza. I don't know but their wood fired brick oven  premium priced pizza is definitely not up to neapolitan standards( based on spending several  months in Napoli and surroundings). If you like a lot of noise in a nice setting this place has it but I wouldn't  recommend it, not even for \"Italian American\" food let alone Italian cuisine. While I truly regret writing this type of review, my hope is that the owners will recognize a problem and take steps to improve the situation as i believe the restaurant has great potential if they can only find and train a few good chefs.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-13T13:32:16-0400", "location_id": "8704774", "id": "392272649", "user": {"username": "jayp49", "user_location": {"name": "orlando, fl", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-07", "title": "Some good food, some not.  Service needs help.", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r390592271-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review390592271", "text": "We sat outside at the bar and had 1 drink while waiting to sit inside.  We got up to leave after the 10 minute wait passed 30 minutes and were ushered inside where 25% of tables were occupied.  Service came quickly, was friendly and brought water and wine soon enough.  We were very hungry and ordered apps.  Our calamari and mussels in wine were very, very good, the bread that cost extra was above most.\nOur waiter forgot our salads entirely and came out with our meals.  My plus $24 filet was not and it was sliced and over salad.  It was less than the thickness of my pinky, so less than 3/8\" thick, was cooked as ordered but had stringy chewy parts.  Her Chicken Piccata was some where else because they brought out Chicken Marsala.  When asked about the dish the waiter said he heard Marsala but would be happy to make it right.  When asked about the salads the waiter remarked that he thought they brought it out.  We had those packaged to go home but he did not put in the dressings, one of which he called 3 cheese I was looking forward to.\nThe Jazz was a 3 piece and it was okay.  The outdoor bar and bartender was very good.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-08T21:48:10-0400", "location_id": "8704774", "id": "390592271", "user": {"username": "Kparfl", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Italian food worth trying", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r386643100-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review386643100", "text": "I had dinner at La Vela for the first time.  We made reservations in advance and they had an indoor table waiting for us.  The place was nicely decorated inside and out.  They had a saxophone player outside to entertain the diners that were eating out there. Our waiter was friendly and he did his best to make sure we had everything we needed.  The food was not bad.  I ordered the chicken parm. and it was a little chewy but the rest of the food ordered with my party turned out well.  The prices are in line with what you would expect to pay for a higher end restaurant.  If you're looking for something different to try in Downtown Melbourne, give them a shot.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-27T13:32:18-0400", "location_id": "8704774", "id": "386643100", "user": {"username": "Lovin_lifealways1313", "user_location": {"name": "Palm Bay, Florida", "id": "34528"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "It's Okay", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r378360743-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review378360743", "text": "We visited a new Italian restaurant in downtown Melbourne, the waiter told us they were open six months. The place is beautiful the owner spared no expense on the design, however they need to have the same urgency with the staff. For some reason everyone looked as if they didn't know what they were supposed to do. We enter threw the outside where there were plenty of tables so we asked for one and we were told it would be a 30 min wait. I don't know why there was plenty of seating, so we said okay and went to the outside bar and waited 10 minutes before someone showed up?? So now we ask again to sit outside again no tables were available and we sat inside. Again it took someone at least 5 minutes to help us, again they weren't busy.  We order the food was okay I had the chicken parm which had very little flavor. My wife had the eggplant and said it was okay. Our waiter seemed he was stretched and had us waiting a long time we had to flag him down and ask for drinks and bread.  We did notice the pizza pie guy was frustrated too waiting for his pizzas to be picked up. You can try it but plan to be there awhile, I hope they improve it was a beautiful place to eat.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-31T10:48:01-0400", "location_id": "8704774", "id": "378360743", "user": {"username": "Steve C", "user_location": {"name": "Orlando, Florida", "id": "34515"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-04", "title": "Trainwreck!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r377711635-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review377711635", "text": "We lunched there during the huge art show.  They were out of potatoes!  Out of champagne, club soda, and mint!!! This was one of the biggest crowds available all year!\n\nWe were going back to hear our favorite jazz singer, Sybil Gage, and the management screwed up and booked a dj on the night she was booked.  So they cancelled her at the last minute.  Last night we went there to hear her again, and she was cancelled again!!! The manager who booked her had quit!!!  What a mess.  They need to close, and start all over again.  Such a shame for such a beautiful place.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-29T12:54:38-0400", "location_id": "8704774", "id": "377711635", "user": {"username": "dobler", "user_location": {"name": "Melbourne FL", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "It's closed for renovations", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r377115400-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review377115400", "text": "We booked a reservation on Open Table, and received a confirmation.  When we arrived on May 24, the restaurant was closed for multiple months of renovation work.  There was a very nice gentleman that gave us the bad news, but has was polite, and may have been a GM or owner.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-27T11:31:07-0400", "location_id": "8704774", "id": "377115400", "user": {"username": "Smissy", "user_location": {"name": "Dunkirk", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Good Food", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r375068532-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review375068532", "text": "\nWe found this restaurant downtown Melbourne Fl. La Vela it was good. The service was slow but the food was good . Our SERVER took forever to bring our drinks. She also served the food in 10 min. increment. We went as a family (7 people) we wanted to eat together. My cousin put his food aside to wait for our food to come.  Yes it was cold by the time we all got our food. The restaurant wasn't that busy. We will try again .\nWe hope next time we all get our food together.\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-21T05:12:20-0400", "location_id": "8704774", "id": "375068532", "user": {"username": "Sabino R", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "I love everything about this restaurant!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r370205534-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review370205534", "text": "We went their last night for our 1st Anniversary and we both had the special \"Grouper Parmesan Crusted Fish\" dinner, which was excellent.  The fish was served over their homemade risotto with a touch of red sauce on 1/2 of the top.  Great for dipping our bread in, which we did have to order seperately at $2 for the basket.  It was crispy and very hot and made from their own dough!  The wine was delicious and it was the house wine, so very inexpensive!  We are in our early 70's and look for special places like this.  Our salad was delicious and actually had tomatoes and cucumbers on it.  We also had an Italian dessert, it was soooooo good!  We ordered an after dinner drink, paid the bill and the waiter \"Henry\" was kind enough to bring it to their outdoor bar where we sat and admired their beautiful blue lights.  We noticed inside that their pizza's looked absolutely great as they were made in their wood burning brick oven.  They will even put on a Baseball game on TV if you so desire.  I can't wait to go back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-04T11:24:14-0400", "location_id": "8704774", "id": "370205534", "user": {"username": "ladykarlotta", "user_location": {"name": "Melbourne, Florida", "id": "34433"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Yummy restaurant", "url": "https://www.tripadvisor.com/ShowUserReviews-g34433-d8704774-r369178869-m11068-La_Vela-Melbourne_Brevard_County_Florida.html#review369178869", "text": "Sat outside for dinner. Weather was great and the music playing was wonderful. Great atmosphere. The appetizers were tasty. Pizzas were delish! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-05-01T03:02:43-0400", "location_id": "8704774", "id": "369178869", "user": {"username": "bbgator57", "user_location": {"name": "Satellite Beach, Florida", "id": "34620"}}}]}