{"paging": {"total_results": "6", "skipped": "0", "previous": null, "results": "6", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "AFTER 2 YEARS : A VERY BAD EXPERIENCE", "url": "https://www.tripadvisor.com/ShowUserReviews-g34439-d196466-r393614116-m11068-The_Dog_Bar-Miami_Beach_Florida.html#review393614116", "text": "Be carefull!!! Dog Bar changed their grooming team and they abuse client.\n I was a happy and faithful client for 2 years. One or twice a month,  I take my little Havanese to grooming (75$, already expensive). \nBut to day ,we experienced the new Grooming team and they charged me an addition of $ 40 more because of few knots. \nI brush my puppy every day and it does not take more than 5 mn. The cashier did not want to hear any of my complaints and forces me to pay:\nTHEY LOST A CLIENT .\nIt is a shame, because the Boss, Steven, has , always, been great and nice to us:he was not there today.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-07-17T11:00:20-0400", "location_id": "196466", "id": "393614116", "user": {"username": "drpmiami", "user_location": {"name": "Miami Beach, Florida", "id": "34439"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-03", "title": "DON’T BRING YOUR PETS HERE FOR NAIL TRIMMINGS – THEY WILL LEAVE BLEEDING!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34439-d196466-r261506824-m11068-The_Dog_Bar-Miami_Beach_Florida.html#review261506824", "text": "I have been purchasing dog food and treats from Dog Bar for the past few months and decided to bring my two yorkies for a nail trimming.  We usually have their nails trimmed at the vet, but Dog Bar was closer to our condo.\n\nThe groomer was an older, Russian woman who is regular employee of Dog Bar.  She finished with my first dog and took in the second one.  I noticed my first dog was shaking and panting which was unusual, so I held him to calm him down.  I looked down at my hands and noticed blood.  I immediately examined at his paws and there were 2-3 nails bleeding on each paw and some nails that had an odd yellow powder on them.  I went right to the cashier to inform her and we both walked back to the groomer who then brought out my second dog with bleeding nails as well!!  \n\nI told them that out of all of the groomers I have been to in years, my dogs have NEVER left bleeding after a nail trim.   The groomer simply replied that “it is normal for the dog’s nails to bleed sometimes” and that she “can’t see where their veins are since their nails are black”.  I responded that most dogs nails are black so that means she most have done this to several dogs in the past!  I continued to voice my frustration that if she had seen 1 or even 2 nails start to bleed, then she should have immediately should have stopped or trimmed the nails lightly.  EIGHT PAWS WITH BLEEDING NAILS IS RIDICULOUS.  Some of my dogs’ nails even had pink flesh showing at the nail tip!!  \n\nI spoke with the owner, Stephen, afterwards and he had the same belief that “it’s normal for dogs nail sometimes bleed after trimmings” and that even “his 3 dogs’ nails bleed when he cuts them at home”.  This is absolutely RIDICULOUS & NOT RIGHT.  I have spoken to my vet, researched online and talked to other pet owners who agrees that it is NOT NORMAL for your animal to bleed after a nail trim.  This must occur often at Dog Bar because the groomer and owner immediately referred Kwik Stop which is the yellow powder I noticed on a few of my dogs’ nails.  They have their first aid powder on-hand and ready to hide the bleeding before owners pick up their animals!  My conversation ended with “two free nail trimmings on your next visit with another groomer” – ARE YOU SERIOUS?!\n\nDog Bar – you really need research PROPER CARE and SAFE grooming guidelines, FIRE that old Russian lady who was not sympathetic at all and reevaluate the rest of your groomers (as Stephen said “this happens with all the groomers”).  How about I cut your nails until they bleed??  Would that be NORMAL???", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-03-24T12:06:35-0400", "location_id": "196466", "id": "261506824", "user": {"username": "onedlc", "user_location": {"name": "Miami Beach, Florida", "id": "34439"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-12", "title": "What a surprise!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34439-d196466-r245471361-m11068-The_Dog_Bar-Miami_Beach_Florida.html#review245471361", "text": "I love this place and all the thinks they have. My pet really enjoys the row food and they are  so kind! A bit pricey! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2014-12-22T03:08:43-0500", "location_id": "196466", "id": "245471361", "user": {"username": "Tobia2011", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": null, "title": "Overpriced", "url": "https://www.tripadvisor.com/ShowUserReviews-g34439-d196466-r224832192-m11068-The_Dog_Bar-Miami_Beach_Florida.html#review224832192", "text": "Had standard pet boutique items that were grossly overpriced. Staff was not very helpful, leaving me mid sentence when someone more important walked in. Made me feel like I was not high class enough, even though I spent money on a very high priced dog bowl, $40. Will not go back. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2014-08-27T07:53:12-0400", "location_id": "196466", "id": "224832192", "user": {"username": "Elen C", "user_location": {"name": "Baton Rouge, Louisiana", "id": "40024"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "the best groomers and staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g34439-d196466-r6726156-m11068-The_Dog_Bar-Miami_Beach_Florida.html#review6726156", "text": "i came when i first moved here with my bolognese pup who was all knotted and mangled because his hair is just unmanagable. (I had just moved from philly where i thought i was using the best groomer around) my dog is very needy, he cannot be away from me without gettin rediculously sad so i have to admit i was worried, i was just giving my dog away to strangers. Nevertheless, I dropped Benny off and a few hours later i could not believe my eyes. He was having a blast but more importantly he smelled incredible and i had no idea his hair could ever feel this soft and healthy. The haircut was just out of this world, can that even be said about a dog? But the best part about his haircut is the fact that its been a month since and he has not gotten one tangle in his coat. I can not say enough about this place. The staff is very educated and very caring. They have all sorts of all natural foods and treats. Its a pit pricey but most non-chain pet stores or boutiques are. You will not be disappointed with this establishment.\n", "helpful_votes": "6", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2007-01-31T19:00:00-0500", "location_id": "196466", "id": "6726156", "user": {"username": "svetlana1201", "user_location": {"name": "miami beach", "id": null}}}, {"lang": "es", "rating": 5, "travel_date": "2014-11", "title": "Divino", "url": "https://www.tripadvisor.com/ShowUserReviews-g34439-d196466-r320096081-m11068-The_Dog_Bar-Miami_Beach_Florida.html#review320096081", "text": "Cosas hermosas para nuestras mascotas.\nAdorable lugar.\nEncontraras todo lo que buscas.\nUn poco caro, pero vale la pena.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-10-19T06:56:55-0400", "location_id": "196466", "id": "320096081", "user": {"username": "AlRola", "user_location": {"name": "La Plata, Argentina", "id": "312747"}}}]}