{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Great first time at a hookah bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g60097-d7702742-r294686821-m11068-Lucid-Milwaukee_Wisconsin.html#review294686821", "text": "I went here on my birthday with my husband, sister and brother in law. I believe it used to serve food but it is more of a nightclub atmosphere now. I am a fan of Surg Restaurant Group so I wanted to also try their hookah lounge since I never tried one. The servers were helpful and the drinks were great. They also have DJs and great drink specials- 5.00 wines and 3.00 martini's on Friday  nights.  I had the \"Mellow Tide\" drink-Grey Goose Melon, Lime and Ginger Beer-very good. We had the Hazelnut coffee hookah for 25.00. They had many different flavors to choose but we didn't want anything too sweet. There is no tobacco in the hookah, they described it as \"not healthy for you, but not bad for you\" It was great. It was a club-type atmosphere with neat lighting. . They had the windows wide open as it was a nice summer night. It was a great first experience at a hookah lounge and highly recommend trying it. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-01T07:18:13-0400", "location_id": "7702742", "id": "294686821", "user": {"username": "Melisx33", "user_location": {"name": "Milwaukee, Wisconsin", "id": "60097"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-04", "title": "Chic hookah dining, drinking and dancing", "url": "https://www.tripadvisor.com/ShowUserReviews-g60097-d7702742-r266307751-m11068-Lucid-Milwaukee_Wisconsin.html#review266307751", "text": "Tried the new Surg place last night during a promo for 1/2 off all the food. Overall, it was very good with just minor issues. This is the old Kennedey's/Tangerine location which has been reinvented many times. The new space is very modern and sleek, resembling a South Beach lounge. Filled with silver walls and ceiling, comfortable booths and high tables. Abstract shaped sliding panels conceal the dance floor in the back. The lighting is odd, rather bright especially when seated at a booth it was downright harsh. It seems clearly designed to compete with the popular Casablanca up on Brady Street.\n\nThe food was quite good. We started with a Greek salad. Being Greek, this is a dish I grew up with and something I really love. This was a nice salad with chopped romaine, cherry tomatoes, purple onion, feta cheese. The issue here was the dressing. Greek salads normally include pepperocini as well as a dressing pretty heavy in red wine vinegar. This salad had very little dressing on it so we asked for more. It was mostly olive oil so the salad really lacked acid. There was a nice hint of parsley in there but it also needed oregano.\n\nThe next dish was Kefta. Kefta is a turkish dish that is combined ground beef and lamb seasoned heavily with garlic, cumin, etc. It is usually rolled into little cigar shapes. This one was rolled onto chopsticks. It is served with basmati rice and Tzatziki sauce. The Tzatziki was delicious and tangy, just as it should be. The issue with dish was the meat. It seemed wrong to me. It had a very peculiar and unpleasant smell. I'm guessing it was not fresh. It also seemed undercooked as the inside was very purple. We both avoided it after a bite or two.\n\nThe total winner dish was the masala chicken and lentils. The chicken is fried with a nice crust of flavorful skin. Masala is an Indian term which really means \"spice blend\" but it usually includes some curry powder, cumin, fenugreek, etc. which you associate with Indian food flavor. This dish was absolutely delicious.\n\nThe service was casual, attentive and friendly. We both enjoyed a couple creative craft cocktails.\n\nThe place allows hooka smoking right in the same area as dining. To me that is VERY off-putting. Hookah smoke is just as carcinogenic as cigarette smoke, actually in some ways it's worse. I don't want the neighboring table's billows of smoke wafting at me while I'm trying to eat. Just be advised what you're getting into. If Hookah dining is your thing, then you're fine.\n\nSome nice things happening here. There's room for a little polish.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-04-17T12:52:59-0400", "location_id": "7702742", "id": "266307751", "user": {"username": "clayewi", "user_location": {"name": "Santa Monica, California", "id": "33052"}}}]}