{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Business in the City", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r437908537-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review437908537", "text": "My husband and I stayed at The Hotel Minneapolis for three nights while he was on a business trip. I loved the location as I was able to walk to local shopping and dining while he was working during the day. We also were able to take advantage of short uber rides to wonderful dining in the city for dinner. The hotel was very nice but the housekeeping didn't arrive until late in the day so I typically turned them away. The wifi was also not very good so we had trouble using the internet and had to connect to our own data so we could work in the room. Overall it was a nice stay but I might try some of the other hotels in the future.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-16T12:43:21-0500", "location_id": "1128805", "id": "437908537", "user": {"username": "Beth V", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-11", "title": "Terrible", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r437304512-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review437304512", "text": "Worst hotel I've ever been to in Minneapolis, service is terrible and never corporate. Wanted to talk to the manager & the front desk people wouldn't give their names and kept hanging up. Front desk people sounded unprofessional I couldn't even understand what they were trying to say. Told me they \"didn't feel comfortable giving their names\" when I told them I wanted to talk to their manager on how unprofessional they were, they kept hanging up the phone. Rooms are small for the pricing and they also charge extra for the littlest things. Would highly prefer the W Foshay, never will I come back to the Hotel Minneapolis ever again!! They should not treat people from out of town with such disrespect, I'm disgusted.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for taking a moment to share your experience with us.  I am very disappointed to hear of the unacceptable service that you received from our front desk staff.  Please know that this is absolutely not acceptable and I sincerely apologize for the frustrating experience you encountered.  I invite you to contact me directly so I can learn more about your experience by either calling me directly at 612-215-5441, or via email at terry.seppala@hotelmpls.com.\n \nOnce again, my deepest apologies for your experience.  Thank you again for alerting us to this situation, and I look forward to speaking to you more about it.", "title": "Owner Response", "published_date": "2016-11-15T12:02:05-0500", "id": "437602623"}, "trip_type": "Friends getaway", "published_date": "2016-11-14T21:28:49-0500", "location_id": "1128805", "id": "437304512", "user": {"username": "Nyajuok K", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Good location, cool vibe!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r437254391-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review437254391", "text": "Stayed here for 4 nights for business.  The location is very convenient, and a bit quieter than hotels nearer to Nicollet Mall / 7th Avenue.  The hotel is a former bank building - check out the vault on the lower level. \n\nThe front desk staff is great - the restaurant / bar staff was so-so.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-14T16:28:32-0500", "location_id": "1128805", "id": "437254391", "user": {"username": "Bill G", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "A good value - we'd probably stay again", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r436708960-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review436708960", "text": "We stayed two nights at this Autograph Collection property. This is a converted bank building, very nicely renovated and still containing the original bank vault for your examination. Highlights included a very quiet and comfortable room, and a helpful and responsive staff. After my request for actual tea in the room, rather than the herbals some call tea, the front desk person immediately fetched some for me. We also received good advice from the front desk finding nearby attractions, along with helpful maps. The on-site restaurant was better than expected, too.\n\nThe room had a small refrigerator sitting on the floor near the bathroom, which we thought a bit odd, and no microwave.\n\nProblems included a billing system outage at check-in, and a period of several hours when the wifi would not pop a login screen. I ended up using xfinity wifi which was surprisingly strong in the room. The clock radio was a few hours off (and could not be reset), and some of the furniture was very dusty.\n\nProblems aside, we thought the overall value was good, and would probably stay there again when we visit Minneapolis.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-12T17:22:00-0500", "location_id": "1128805", "id": "436708960", "user": {"username": "CvilleTraveler2013", "user_location": {"name": "Charlottesville, Virginia", "id": "57592"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Good location", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r436681925-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review436681925", "text": "I stayed for three nights for a conference trip. The room was very comfortable. The height of the shower was great. Even though I am short, I usually travel with a tall companion so I always take notice. There was more than enough clearance for someone over six feet. No view to speak of and most of the tv stations said no signal but it didn't really bother me since I was mostly outside. The location was close to the metro but also seemed in walking distance of everything I needed. The front desk was very helpful. I also appreciated that one needed a room key to access the main entrance and to operate the elevator. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-12T13:27:02-0500", "location_id": "1128805", "id": "436681925", "user": {"username": "NesofOklahoma", "user_location": {"name": "Lawton, Oklahoma", "id": "51463"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "A little different, but a \"good\" stay and a nice location", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r436571327-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review436571327", "text": "I had seen the Hotel Minneapolis on prior trips to Minneapolis and recently the rates were low and I thought I'd try it out on a single night trip. I will say that I had a good stay at this hotel and certainly don't have any complaints, but simply some observations. For my trip, the location of the Hotel Minneapolis was perfect, and I was able to walk to all of my scheduled activities for the evening. This hotel is on the north edge of downtown and is quite close to US Bank Stadium, Nicollet Mall, Target Center. Target Field, and the Warehouse District. It's always a huge plus for me when I can park my vehicle and not have to touch it again until I depart. The hotel is situated a little weird on 4th Street and I had to look for the entrance a little since it is off the street about a half block in a driveway for the hotel and valet service. I did not use the valet and there are several public parking ramps nearby. The styling of the hotel is modern, with a slight retro feel to it since this is an older building. The lobby and check in were nice and smooth and I was given a king suite on the 5th floor. Some view, but not much and basically a street corner, street noise was minimal. The room I had was nice, clean, and comfortable, but was missing something in the furnishings. It was all fine, but it was large room and just seemed a bit open. The was a micro fridge which is a nice touch, but it was just sitting on the floor by itself. The bathroom was modern and well done, and the shower was great. Glass doors and a stone tile shower with a good shower head, always plus! I thought the hotel was nice and I will definitely consider it again on another trip to Minneapolis, but more for the location than anything else. There are some slight oddities to the flow and design of the hotel, but in a way it was fun and all staff that I encountered were fabulous so it all came together in the end.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-11-12T05:11:56-0500", "location_id": "1128805", "id": "436571327", "user": {"username": "ecryan2016", "user_location": {"name": "Ashland, Wisconsin", "id": "30341"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Great escape", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r434172864-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review434172864", "text": "Our stay here was incredible. The presidential suite was beautiful and had a wonderful bathroom!!! See pictures attached. My boyfriend and I just needed a quick get away from our busy lives and this place did it. We had the best sleep in a long while on their comfortable bed. \n\nBrennen at the front desk delivered amazing customer service and gave us passes for dinner appetizers and breakfast (which is really good btw, one of the best breakfast buffets I've been to). If you're looking for a nice relaxing area in downtown, this place is the place to be. It's a few blocks away from nightlife and restaurants which is perfect because you get good sleep away from the noise but within walking distance if you want to grab something to eat or go to a bar/club. Highly recommend for their price and quality! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-02T19:49:40-0400", "location_id": "1128805", "id": "434172864", "user": {"username": "Evelyn L", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Great showerhead for both short and tall people!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r431208411-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review431208411", "text": "Staff was very accommodating when our flight arrived early! We were allowed to check in to a very nice room before the \"official\" check in time. Our room was great - large, clean, great bathroom (esp. the showerhead) refrigerator and reading chair with ottoman. Only drawback was no good view but that was not so important to us. The different vault doors were interesting to see. The location is wonderful and only 1 block away from nearest light rail stop.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-24T07:11:17-0400", "location_id": "1128805", "id": "431208411", "user": {"username": "VirginiaLady1990", "user_location": {"name": "Springfield, Virginia", "id": "58202"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Not a lot of work", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r429231362-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review429231362", "text": "Overall I wasn't impressed with the stay. No bellman or bellcarts available at check-in. They didn't have our room type that we booked available at check-in. Dirty carpets in common areas and in rooms. We told housekeeping That we were leaving and that they could take our rollaway out and clean the room. They only took the rollaway out and didn't service our room. I forgot my pillow in the room at checkout and am still waiting for someone to call me back. There are no fridges in the room. I was double charged at checkout. There is just no attention to detail, would not stay here again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for sharing your feedback.  I am so sorry to hear of the unacceptable experiences you encountered during your time with us.  This is most certainly not the level of service we expect from our team and I assure you that we will be spending time reviewing your concerns with our valet, front desk, and housekeeping teams to make sure these issues are swiftly addressed so they are not encountered by other guests.  While I am unsure of the details regarding your lost pillow as well as the billing issues, I would be happy to assist with these if you have not already had resolution.  Please contact me directly at terry.seppala@hotelmpls.com or via phone at 612-215-5441, and I would be happy to assist you.\n \nOnce again my apologies for your disappointing stay, I hope to hear from you soon.", "title": "Owner Response", "published_date": "2016-10-19T16:48:59-0400", "id": "429871158"}, "trip_type": "Friends getaway", "published_date": "2016-10-18T06:02:12-0400", "location_id": "1128805", "id": "429231362", "user": {"username": "Amy M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-03", "title": "Okay for priceline prices", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r428594518-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review428594518", "text": "Priceline e express deal brought me to those hotel for one night. Parking is difficult as the entry is small and there is no information about where to self park.  Found the people at the front desk nice and engaging but this may have been because one was in training.  The room seemed older, dated and a bit dirty. Glad it was just one night, but no real issues.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for sharing your feedback regarding your stay with us.  I am very sorry to hear that we did not exceed your expectations during your stay.  I am delighted that you enjoyed your interactions with the front desk team.  We offer valet parking at our entrance for the convenience of our guests.  In addition, there are several parking ramps within walking distance of the hotel.  I am sorry that you did not have sufficient information available when you arrived regarding parking options, and I will relay this information to our front entrance team so they can be better prepared to assist with this information in the future.  I am also sorry to hear of your dissatisfaction with your guest room.  A dirty room is absolutely unacceptable and I assure you we will be following up with our housekeeping team by sharing your concerns as we coach and retrain our associates to to ensure these issues do not recur.\n\nThank you again for your comments.  We thank you for staying with us and hope you will consider us again when your travels bring you back to Minneapolis.", "title": "Owner Response", "published_date": "2016-10-18T15:05:52-0400", "id": "429485430"}, "trip_type": "Business", "published_date": "2016-10-16T20:20:17-0400", "location_id": "1128805", "id": "428594518", "user": {"username": "Sarah Z", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-08", "title": "Worst customer service ever! 2x my loyalty to Marriott was a bad idea in MN!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r427608994-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review427608994", "text": "I am a loyal Marriott Rewards member (2 stays from Gold level again) and have consistently tried to stay at this location when I am in town and the customer service has been atrocious! The hotel itself is ok in terms of the rooms and the facilities and the staff who works in the concierge lounge are amazing.  I left an item in my room that had a high value and I called the hotel immediately when I arrived in Atlanta to inquire.  I was told that no one could assist me until the housekeeping staff arrived in the a.m. The person I spoke to then suggested that I come back to the hotel then I reminded him that I did NOT live in MN and would not be returning so that was not an option. the next day I called at 9:05 and was told that they had the item but that the person who could assist me was not in yet.  This went on for FIVE (5) days!!! I was enraged that no one could assist me and I was put on hold for long periods of time only to be transferred to someone who asked all the same questions again and then told that I had to speak to housekeeping which kept going to voice mail.  I provided my mailing address and the item was not mailed. Finally I was told the following week that they needed a credit card to mail it to me and that was the cause of the delay.  I was dumbfounded that 7 days and 10-15 calls later including a never returned call to the hotel manager and I still did not have my item. I then asked my coworker to please go to the hotel she retrieved it and mailed it to me and I had it the next day.  I could not believe that there was such a disregard for me and as a result I am choosing to stay at the Loews in my next visit where I know I will be treated incredibly well! Do not stay here unless you're sure you won't have any problems. This was my second time in a year having MAJOR issues with customer service that I was motivated to write a review! ALSO: The location of the valet is really confusing and of the hotel so getting an Uber from there is virtually impossible! I was late to a meeting because of poor signage and difficulty of the address matching the location.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for sharing your experience.  I am extremely disappointed and very sorry to hear of the unacceptable response you received to your lost and found inquiry.  This is absolutely not the standard we expect from our employees and on behalf of our entire team, please accept my deepest apologies.  I can certainly understand your extreme frustration in this situation and I greatly appreciate you bringing it to our attention so we can immediately share this with our lost and found team to swiftly ensure remedial action is taken so that this never happens again.  I do thank you for recognizing our concierge staff and the service they provide, but I can certainly understand how this is not enough for a satisfying stay.  We never like to hear that a guest is choosing not to stay with us again, and I would like to speak with you directly if I may to help ensure that if you would consider giving us another try, I will personally assist you with your experience.  Please contact me directly at terry.seppala@hotelmpls.com or via phone at 612-215-5441, and I would be happy to assist you.", "title": "Owner Response", "published_date": "2016-10-14T16:12:46-0400", "id": "428013972"}, "trip_type": "Business", "published_date": "2016-10-13T06:51:37-0400", "location_id": "1128805", "id": "427608994", "user": {"username": "flutterbyga", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Amazing treatment by the staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r427350027-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review427350027", "text": "Wow!  All I can say is Wow!  I called in advance of our trip for recommendations.  I spoke with Brennan and he was amazingly helpful, accommodating and gave great recommendations for us to plan a large dinner.  To my amazement, he also checked me in and I remembered his name.  Brennan went above and beyond with every interaction we had.  He made sure that all 4 of our rooms were together on the same floor, even helped me with a trip to Target. He is super friendly, super professional and just a wonderful representation to have at the front desk.  I highly recommend the hotel based on the treatment of all of the staff, but truly most especially Brennan because he put the hospitable in hospitality.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-12T11:29:52-0400", "location_id": "1128805", "id": "427350027", "user": {"username": "haydenyellowlab", "user_location": {"name": "Bethesda, Maryland", "id": "41003"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Good bones but unpolished front desk", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r427101808-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review427101808", "text": "Not as impressive as previous years. Front desk attendant was arrogant and argued with me. I am a platinum elite who attends a conference there every year. Room size is good but shower tile needs rehab. Room service just ok- not given 2 percent milk as requested. Appreciate robe but need slippers to be up to autograph collection level found elsewhere.\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for sharing your experience with us.  Please accept our apologies for the issues you encountered, most notably the unacceptable interaction you had with the front desk agent.  I appreciate you taking time to share your experience so we can swiftly follow up with the staff involved.  While I can share your comments with out entire team, it would be most helpful to determine the specific associates involved in order to provide more specific attention to this matter.  I would welcome additional information by contacting me directly at 612-215-5441 or via e-mail at terry.seppala@hotelmpls.com.\n\nOnce again, my apologies for your experience.  We greatly value you as a loyal guest and I look forward to hearing from you soon\n", "title": "Owner Response", "published_date": "2016-10-13T10:19:42-0400", "id": "427666245"}, "trip_type": "Business", "published_date": "2016-10-11T18:07:56-0400", "location_id": "1128805", "id": "427101808", "user": {"username": "Nervedoctormom", "user_location": {"name": "Washington DC, District of Columbia", "id": "28970"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Nice Hotel! Martin at front desk is the best!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r424857218-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review424857218", "text": "We stayed at this hotel for a nearby college visit. Martin at the front desk was very accommodating and went above and beyond! We appreciate that and will be back because of it. This hotel is located in a great spot in downtown Minneapolis! I thought it was very reasonable priced for the area!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-03T17:03:00-0400", "location_id": "1128805", "id": "424857218", "user": {"username": "Jeff L", "user_location": {"name": "Windom, Minnesota", "id": "43645"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Not Autograph worthy", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r424414701-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review424414701", "text": "We are loyal Marriott people and enjoy the decor and experience of their Autograph hotels.  This one did not fit the bill.  It is in a great location to the light rail and downtown shopping/restaurants.  The staff was helpful and friendly and the lobby is wonderful for relaxing.  But, the hotel is dirty!  As we were sitting in the restaurant, I looked at the window sills and noticed a layer of dust.  It was more than a day or two of dirt.  Our room was on the concierge floor, it was dark and needed a total redo.  The TV was hung on a wall at an ackward spot, a mini fridge was placed under it, again in an ackward spot.  We woke up every morning to the smell of meat cooking and in the evening of food in general.  We must have been above the kitchen vent.  We departed in the morning and when we returned several hours later, the room was not made.  We decided that if housekeeping does knock, we will just ask for towels.  Never had a knock.  When we went out for the evening, I asked the front desk to have our room made up and they were surprised that it had not been done already.  When we returned later in the eveipning, it was done.  For the price, Marriott has many other hotels in the near area that are much better than this hotel.  We will not be returning.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for taking time to share your experience with us.  While I am delighted that you enjoyed your interactions with our staff, I am very sorry to hear that you did not enjoy the facility itself.  I am disappointed that the level of cleanliness you experienced did not meet your expectations or our high standards.  Rest assured that we have already taken steps to ensure that our teams are on track with proper cleaning schedules to ensure all areas are addressed in a regular and timely manner.  I apologize for the delay in having your room serviced as well.  While I am happy that you did ultimately receive service, you certainly should not have had to ask for it.  \n\nOnce again, my apologies for your disappointing experience.  You are a valued guest and I hope you will allow us another chance in the future to provide you with the experience you expected to receive the first time.", "title": "Owner Response", "published_date": "2016-10-04T15:40:07-0400", "id": "425156907"}, "trip_type": "Family", "published_date": "2016-10-02T08:45:06-0400", "location_id": "1128805", "id": "424414701", "user": {"username": "WarEagle201329006", "user_location": {"name": "Auburn, Alabama", "id": "29006"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "I Don't Recommend", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r421815313-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review421815313", "text": "Overall, if I could rate the hotel a zero I would. So I found one thing worth highlighting to give it one circle. I was looking for some fruit well before the work day and before the lounge opened, the front desk guy, without me asking grabbed a banana from the restaurant. A big thanks to him.\n\nIt was the room that really made this rating a one. Where to start. If you like dust, stained chairs, dirty carpets, pillow cases with stains, dresser drawers with crumbs or hair, a clogged sink, an iron with black sticky stuff on it that melted onto my shirt  and no wake up call when requested. OK, You get the idea. \n\nThe trip was only a few nights so I bit my tongue and powered through it. Not enough time or energy to raise the issue or change rooms after unpacking.  Plus, I was traveling with four others whose rooms were all the same. While this is my rating, I can say all five of us shared a lot of the horror stories over nice meals off premises.\n\nI've been using Marriott for over 20 years and have been a gold member for many of them, including this year and this by far was the worst kept hotel I've ever visited.\n\nIf you do decide to stay, I wish you the best.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for taking the time to post a review of your stay with us.  I was very concerned and dismayed to read your feedback.  First and foremost, please accept my sincerest apologies for the absolutely unacceptable condition of your guestroom.  Please know that what you describe here is absolutely not the level of service and quality expected from our staff and our product.  The guest room experience is such an important part of any guest’s stay, and I can completely understand your frustration and disappointment in a guest room that in no way meets your expectations, as well as the failure to receive your wakeup call.  I am sorry you were unable to share your concerns while you were here with us, but I do appreciate you letting us know so that we can swiftly follow up with these teams to ensure necessary coaching and counseling is provided to improve the services in these areas.  I am happy to hear the front desk staff was able to accommodate your request for something to eat during the overnight hours.  I will be sure to pass that along as well.\n \nOnce again, my deepest apologies.  You are a valued guest and we hope you allow us another opportunity in the future to provide you with a much better experience.", "title": "Owner Response", "published_date": "2016-09-28T16:03:20-0400", "id": "423331347"}, "trip_type": "Business", "published_date": "2016-09-24T10:25:52-0400", "location_id": "1128805", "id": "421815313", "user": {"username": "Jeff T", "user_location": {"name": "Long Valley, New Jersey", "id": "46583"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Expensive and slow internet ", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r421636920-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review421636920", "text": "The price is very expensive compared with its quality. There is 14 dollar fee per day for internet access. However, if you connect to lobby fIrst and then change to guest wifi, you will be connected automatically without. The internet is freaking slow!!!!\n\nBreakfast has 6 dollar deliver fee and extra 20 percent service fee on top of already expensive price. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for sharing your concerns regarding your recent stay.  On behalf of our entire team please accept my apologies for not enjoying your stay with us.  I am very sorry to hear you experienced issues with your internet connection.  I hope you had an opportunity to speak with our front desk team so they could follow up with our internet provider to help resolve your internet issues.  We do regularly monitor the pricing for the services provided by similar hotels in our area and work diligently to ensure that our prices are in line with them.  As such, we believe that we provide a good value for the amenities and services we offer in our convenient downtown location.  However, in the instance we were unable to exceed your expectations, and for that I sincerely apologize.  We will take your comments into consideration as we continue to evaluate the value and pricing of our services.\n\nThank you again for your feedback.  We greatly value you as a guest and I hope you will allow us another opportunity in the future to provide you with a much more enjoyable stay.\n", "title": "Owner Response", "published_date": "2016-09-26T10:19:30-0400", "id": "422545705"}, "trip_type": "Business", "published_date": "2016-09-23T19:50:04-0400", "location_id": "1128805", "id": "421636920", "user": {"username": "Gongjin C", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Will not return calls for invoicing issues", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r421498406-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review421498406", "text": "I have left 4 message to try to resolve an invoicing issue-2 with accounting and 2 with the GM.  None of which appear to be able to return a call to explain why the credit they stated would be given was not.  Service while in the hotel was adequate, but won't return.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Terry S, Manager at The Hotel Minneapolis, Autograph Collection, responded to this review", "text": "Thank you for alerting us to your billing issue.  I can understand your frustration with this unacceptable situation.  Please accept my apology for the delay in responding to your messages.  While I do not know the nature of the billing issue, I would be happy to help follow up on the issue.  Please contact me directly at 612-215-5441 or via e-mail at terry.seppala@hotelmpls.com with more information and I will follow up with our accounting team to find resolution for you.", "title": "Owner Response", "published_date": "2016-09-26T10:21:04-0400", "id": "422546192"}, "trip_type": "Business", "published_date": "2016-09-23T08:18:29-0400", "location_id": "1128805", "id": "421498406", "user": {"username": "browneyedgirl40", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Nice hotel in heart of downtown", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r419534079-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review419534079", "text": "This is a clean and relatively up to date old hotel. The rooms are small but at least the bathroom, tv and furniture is new. I like a little more room but I knew it was an \"old\" hotel so i wasn't  surprised. It's close to the train stops. US Bank stadium is nearby. \n\nThe staff was very friendly. No complaints. I will probably try a different hotel next time, though. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-17T10:43:34-0400", "location_id": "1128805", "id": "419534079", "user": {"username": "386trugrit", "user_location": {"name": "Saint Cloud, Minnesota", "id": "43493"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Upscale hotel in older downtown building", "url": "https://www.tripadvisor.com/ShowUserReviews-g43323-d1128805-r419206064-m11068-The_Hotel_Minneapolis_Autograph_Collection-Minneapolis_Minnesota.html#review419206064", "text": "We stayed here for 1 night on business and liked it a lot.  The lobby is beautiful and the rooms were spacious with tall ceilings.  Mine was handicapped accessible so not sure if it was larger than other rooms. but it was much bigger than a typical hotel room.\n\nMy only knock on the hotel is that the fitness center is reserved for Marriott Rewards Elite level members but that is not disclosed anywhere on the hotel's website.  Since I'm not Elite, my key did not grant me access so I went down to the front desk where they explained the policy.  They were very accommodating and gave me access, but it seems silly to limit who can use a nice but fairly ordinary fitness center.  I was the only person in there for about an hour so excess demand did not seem to be an issue.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-09-16T09:42:50-0400", "location_id": "1128805", "id": "419206064", "user": {"username": "baseball_dad", "user_location": {"name": "Chicago", "id": null}}}]}