{"paging": {"total_results": "4", "skipped": "0", "previous": null, "results": "4", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "AMAZINGLY FUN!", "url": "https://www.tripadvisor.com/ShowUserReviews-g45277-d10682965-r435227767-m11068-Big_Sky_Breakout-Missoula_Montana.html#review435227767", "text": "AMAZING fun for ALL ages. Had seen some other rooms advertised in Arizona while searching for things to do during a visit down there and decided to search for one in Montana. While visiting Missoula we thought we would give it a try and we were thrilled that we did. It was so much fun in so many ways. It was so interesting to see how each person's mind works so differently when in a Puzzling situation. The staff was incredible!!! I was a little creeped out with the thought of them watching us at first but after the first 5 minutes in the room I was very thankful knowing they were there to help us just enough when we got stuck without giving away the secrets. How the owners created these rooms is mind boggling, we left talking about it for hours!! You have to see it to believe it!! I would HIGHLY recommend Big Sky Breakout to everyone.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-11-06T20:47:35-0500", "location_id": "10682965", "id": "435227767", "user": {"username": "Applegang", "user_location": {"name": "Havre, Montana", "id": "45209"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Excellend Experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g45277-d10682965-r431062670-m11068-Big_Sky_Breakout-Missoula_Montana.html#review431062670", "text": "The rooms were excellently put together- from the artwork and atmosphere to the puzzles and challenges, everything was quite well done. I took a group of friends who had never done an escape room before and they had a blast. We did \"Embassy Escape\" and \"Through the Looking Glass.\" The owners were incredibly nice and accommodated our booking mistake on our second visit, going so far as allowing us to play \"Through the Looking Glass\" ahead of its release schedule.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-23T20:21:00-0400", "location_id": "10682965", "id": "431062670", "user": {"username": "Daniel R", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Brain Teasing FUN!", "url": "https://www.tripadvisor.com/ShowUserReviews-g45277-d10682965-r428819824-m11068-Big_Sky_Breakout-Missoula_Montana.html#review428819824", "text": "My boyfriend & I were visiting some friends who live in Missoula and decided to give this escape room a try.  What a unique experience!  The owners, Jaime & Ralph, clearly worked very hard to make our experience fun & exciting, yet challenging.  We started with the \"Embassy Escape\" room which was the perfect place to start.  We escaped!!  And, we had so much fun, we had to come back & try their new (HUGE) game \"Through the Looking Glass\" which is an Alice in Wonderland themed game - a visual marvel and brain teasing FUN!  We were hooked!  So much so that we had to come back for \"Du Frank's Break\" where you're locked in a jail cell and have to escape!  It's so cool!!  \nIf you're looking for something fun to do, but the weather outside is nasty, this is the perfect alternative!  If you have kiddos and want to do something that is both fun and challenging, bring them here!!  It's like a real life video game, with tangible things to touch and twist, riddles to solve & requires team work to complete!  You'll be talking about your experience for weeks afterwards!!  It will not disappoint!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": ", Owner at Big Sky Breakout, responded to this review", "text": "Thank you so much for this thoughtful review! So glad you enjoyed your games with us!", "title": "Owner Response", "published_date": "2016-10-19T07:32:52-0400", "id": "429705036"}, "trip_type": "Couples", "published_date": "2016-10-17T11:20:34-0400", "location_id": "10682965", "id": "428819824", "user": {"username": "litepaint", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "1 Hour WELL spent. What an experience!", "url": "https://www.tripadvisor.com/ShowUserReviews-g45277-d10682965-r425588054-m11068-Big_Sky_Breakout-Missoula_Montana.html#review425588054", "text": "This was my first escape room experience, AND IT WAS PHENOMENAL. I am a life-coach for my buddy Dylan, who has friedreich's ataxia (A form of Muscular Dystrophy), and we decided to check out Big Sky Breakout with his sister, Sienna.\n\nDylan was apprehensive about going, and we were unsure if it was wheelchair accessible. Turns out it was, and both Dylan and Sienna left with a HUGE smile on their face.\n\nThey talked about the different clues and puzzles for hours (and days) afterwords.\n\nThe owners, Ralph and Jaime, were incredibly fun and engaging.\n\nI highly reccomend if you have 1-2 hours in Missoula, DO THIS ESCAPE ROOM. You will have a thrilling experience with the friends you decide to take with.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": ", Manager at Big Sky Breakout, responded to this review", "text": "We had SO much fun with you all! Thank you for this great review!", "title": "Owner Response", "published_date": "2016-10-19T07:34:34-0400", "id": "429705658"}, "trip_type": "Friends getaway", "published_date": "2016-10-06T07:13:10-0400", "location_id": "10682965", "id": "425588054", "user": {"username": "Josh H", "user_location": {"name": "Thompson Falls, Montana, United States", "id": null}}}]}