{"paging": {"total_results": "5", "skipped": "0", "previous": null, "results": "5", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2014-11", "title": "This place has closed", "url": "https://www.tripadvisor.com/ShowUserReviews-g56304-d6214903-r318767857-m11068-Fort_Bend_Brewing_Company-Missouri_City_Texas.html#review318767857", "text": "It is no wonder that this place has closed. The beer was basic at best. We went for a visit and there was a band. The band playing was like someone's buddy they were doing a favor for. They weren't the best. The most interesting beer on tap, (brewed with ginger) they downplayed like they were trying to get rid of it. I'm not sure these people understand the craft beer market/culture. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-10-14T16:02:30-0400", "location_id": "6214903", "id": "318767857", "user": {"username": "Valerie P", "user_location": {"name": "Missouri City, Texas", "id": "56304"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-11", "title": "Great Story", "url": "https://www.tripadvisor.com/ShowUserReviews-g56304-d6214903-r243922054-m11068-Fort_Bend_Brewing_Company-Missouri_City_Texas.html#review243922054", "text": "This is place where you can learn on how golden liquid is created. Taste all blends and remember taste of malt. You will get back with memories here every time you zip that beer anywhere. It;s recommended as local attraction - so bring your \"driver\" with you to enjoy even more.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-12-10T12:13:08-0500", "location_id": "6214903", "id": "243922054", "user": {"username": "miloszek", "user_location": {"name": "Herentals, Belgium", "id": "680686"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "First visit to a brewery and I loved it!", "url": "https://www.tripadvisor.com/ShowUserReviews-g56304-d6214903-r225557061-m11068-Fort_Bend_Brewing_Company-Missouri_City_Texas.html#review225557061", "text": "I went with some friends to this brewery just to check it out. I don't like beer at all but I still enjoyed the time we spent here. There was a good atmosphere. They had a live band and they allow dogs there! All in all a great experience for my first brewery and I would go back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-08-30T15:24:55-0400", "location_id": "6214903", "id": "225557061", "user": {"username": "Oriley2013", "user_location": {"name": "Whitehouse, Texas", "id": "56884"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Texas Big In Every Way - Except Size", "url": "https://www.tripadvisor.com/ShowUserReviews-g56304-d6214903-r199778234-m11068-Fort_Bend_Brewing_Company-Missouri_City_Texas.html#review199778234", "text": "A Saturday afternoon \"tour\" of the brewery is big on value, atmosphere, friendliness, variety and - most importantly - taste. For such a new entrant to the hugely-competitive microbrewery market, the maturity and confidence of its ales is quite remarkable. Displaying an impressive breadth and depth of technical knowledge coupled with an earnest desire to excel, taking the few steps from one end of the tiny facility to the other is an entertaining and edifying experience. That the small admission charge rewards the visitor with four more-than-generous \"samples\" is a bonus that easily earns the fifth TripAdvisor review point. As to the beers themselves, there is literally something for everyone. The blonde ale is refreshingly cool and crisp, but with enough body to satisfy the more mature palate. The farmhouse ale is a triumph! Described as \"Belgian style\" by the brewers, it actually deserves a classification all its own with a complexity of tastes and flavours that demand a second or third glass to continue the journey of exploration. The IPA, in the North American derivation of the term, is strong and bitter enough to demand an accompaniment (fortunately provided by an excellent food truck) but sufficiently flavourful to savour at one's leisure. The stout is equally remarkable in the masterful combination of hops and malts producing flavours that set it apart from its obvious big-brewery competitors. And from what I sampled of the special concoctions, it is clear that the crew have no qualms about experimenting and thinking outside the box. I expect great things!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-04-03T09:02:18-0400", "location_id": "6214903", "id": "199778234", "user": {"username": "Rip G", "user_location": {"name": "Mississauga, Canada", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2013-12", "title": "Fort Bend Brewing: Craft Brewing Charm from Houston to You", "url": "https://www.tripadvisor.com/ShowUserReviews-g56304-d6214903-r193577307-m11068-Fort_Bend_Brewing_Company-Missouri_City_Texas.html#review193577307", "text": "A visit to the Houston area isn’t complete without a tour of some local breweries and one that deserves a look is Fort Bend Brewing. Established in late 2012, Fort Bend Brewing has been around for a relatively short time but has already wowed local craft beer fans with its craft beer lineup and expertise.\n\nA visit to Fort Bend Brewing is similar to other brewery tours in the Houston area in most ways. Guests pay a small fee at the door and get several samples of freshly brewed beer. Glassware and other items are available for a separate purchase and if you decide to buy a larger glass, it can be used for the samples, so it is easily worth the money. Food is available as well and is served by some of Houston’s finest locally owned and operated restaurants. \n\nOne thing that sets Fort Bend Brewing apart from other Houston area breweries is its atmosphere. It is air conditioned, which is something you need in Houston but do not always get when you visit other breweries. The inside, the restrooms, and the grounds are nicely maintained and guests are made to feel more than welcome by the owners and staff. There are often some simple games for outdoor play, which is great if you have kids. Oh, and let’s not forget the beer- there are always at least 4 products on tap, including the acclaimed Thunder Stout, a critical favorite. \n\nFort Bend Brewing presently offers tours every Saturday afternoon and it may expand its schedule in the future. Always check the Fort Bend Brewing web page, social media, etc., to get the most up to date information and enjoy your visit to one of the Houston area’s fastest growing craft breweries.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-02-09T10:40:03-0500", "location_id": "6214903", "id": "193577307", "user": {"username": "Bryan_Carey", "user_location": {"name": "Houston, Texas", "id": null}}}]}