{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-12", "title": "Authentic Lao Cuisine and Killer Wings", "url": "https://www.tripadvisor.com/ShowUserReviews-g30712-d9603013-r334594452-m11068-Cuisine_Style_Express-Montgomery_Alabama.html#review334594452", "text": "Total disclosure: this is a recently opened, family owned, little restaurant. I went at odd hours and met the owner and cook, a very friendly lady who makes the food individually as if your auntie opened a restaurant.  They are still working on the dining area and it looks more like takeout right now so the atmosphere is what I would call \"in development\" but she has plans.  It is located in a strip mall by ASU in a recovering neighborhood.  Get past it and get to the FOOD!   \n\nStart with the sticky rice and jeow som or whatever the spicy sauce is for the day.  The pad kee mao aka drunken noodles are so good. I also recommend the spicy curry chicken. There is a yummy papaya salad that I think I could eat every day.  Anything on the menu can be made vegetarian on request.  The owner also does fried wings, not traditional lao food but I went with a friend who loves wings, so we tried them with a hot and spicy asian garlic dipping sauce.  Yes, yes and yes!  \n\nEverything was under $10 and the portions are substantial.The food comes as it is prepared so be ready for staggered arrival and laotian food is spicy so go light when they ask unless you love heat, then enjoy.  If there are more than two of you it is better to call ahead with your order if you want it at the same time.  If no frills, killer good food is the most important part of your dining experience then try this place.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-12-23T04:53:45-0500", "location_id": "9603013", "id": "334594452", "user": {"username": "NDdenver", "user_location": {"name": "Denver", "id": null}}}]}