{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2014-08", "title": "Great Middle Eastern Food in Montebello", "url": "https://www.tripadvisor.com/ShowUserReviews-g32735-d4920073-r221836093-m11068-Krazy_Kabobs-Montebello_California.html#review221836093", "text": "This place is super casual, but the food is great.  Years ago it was a family run grocery and produce market.  One of the younger generation told me that the hot food business started with patrons smelling the hot lunch the family was making for themselves and customers asking if they could sample it.  At first it was just take out, then just a couple of tables, now the tables take up about half the floor space.  The offer a variety of wraps and plates.  Plates include white rice or rice pilaf, salad, protein and appetizer.  Protein choices include chicken, beef, lamb, salmon, and a couple of vegan choices.  There are kabobs and gyros.  There are more than a dozen appetizer/side dish choices.  Several mineral water choices as well as a variety of middle eastern sodas.  They still carry a variety of canned goods, spices, grains, and legumes in the grocery section.  They also still have a deli with cold cuts, cheeses, and olives.\n\nIf you eat there, the plates are served on real plates, but the appetizers and pita chips are served in styrofoam and paper respectively and the flatware is disposable.  There are a couple of sit down Middle Easter restaurants with table cloths and real flatware about a mile away.  Unfortunately, the food is not  as good at either.  So, if you want some great food and don't care about frills, this place is perfect.\n\nI have taken their prepared salads and Family Meals to a number of pot lucks.  When I have done so, I am always asked for their information.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2014-08-14T11:22:05-0400", "location_id": "4920073", "id": "221836093", "user": {"username": "Brenda G", "user_location": {"name": "Monterey Park, California", "id": "32738"}}}]}