{"paging": {"total_results": "4", "skipped": "0", "previous": null, "results": "4", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Great place for families", "url": "https://www.tripadvisor.com/ShowUserReviews-g51524-d10723362-r425995263-m11068-The_Station_at_Central_Park_Aquatic_Center-Moore_Oklahoma.html#review425995263", "text": "This review will only be regarding the outdoor pool area at the station, as that is the only part that we have been to. We were late to visit the station once it opened but came several times before school started and it closed. My three children as well as myself enjoyed it each time. I will say right off the bat that it is very small and might not be something to hold the attention of teens very long. I did see some around that age, but overall I would imagine they would prefer something a little larger with larger/more thrilling rides. For my children, who are all under 10, this was perfect. It is small enough that it is almost possible to see your children from any area that you might be in. I know, because my two oldest, went down the two slides with tubes while me and my youngest played in the zero entry, toddler area. Both my older children are swimmers (and meet the stations requirements to be alone) so me and my youngest played and I could still look over and watch the big kids go up and down the stairs over and over as they kept riding the slides. They had a blast. For them at least, the slide was perfect and not scary at all. The lazy river is pretty shallow, which is helpful for those with younger kids. It can actually be a little hard to enjoy as a parent of a small child since you either have to walk and have the water be to your midthigh or you have to crab walk to carry your toddler and still be in the water. The biggest swimming pool area has just a plain wide slide that goes into it. The older kids loved this. They loved the diving boards. There was a climbing wall and a floating island type of thing that they had to run across. There was a basketball hoop as well. Overall I can't imagine anyone actually trying to swim laps in this pool. It's just basically the only place (as an adult - or a taller person) that you can be completely in the water. \n\nSo, as long as you don't go here expecting anything spectacular, which you probably wouldn't since you can clearly see everything there is to offer as you drive in, you will not be disappointed. There is also a small snack bar that offers a few things that are pretty cheap. I'm not for sure, but I thought I saw people with water bottles (not branded ones, but ones from home). I thought perhaps they were like some other water parks I've been too that will let you bring in your own water bottle from home and they will put water in it - but I'm not sure. The first time I came we hadn't intended to spend any money, only to find we could not find a water fountain. That was a downside to me. There are life jackets, for those that need them. I also found the lifeguards to be attentive and there seemed to be quite a few of them. for those that have smaller kids that sometimes get away quickly, the deeper areas has a gate that must be opened so the littler ones cannot slip away from the toddler area and get into deeper water - without assistance that is. \n\nOverall I was very pleased with this new attraction and most importantly, my kids loved it and kept asking to come back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-10-07T19:53:02-0400", "location_id": "10723362", "id": "425995263", "user": {"username": "flyingradish", "user_location": {"name": "Moore, Oklahoma", "id": "51524"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Excellent gym equipment coupled with glorified splash pool", "url": "https://www.tripadvisor.com/ShowUserReviews-g51524-d10723362-r410123712-m11068-The_Station_at_Central_Park_Aquatic_Center-Moore_Oklahoma.html#review410123712", "text": "If you are interested in working out this place has some excellent training equipment and an indoor walking track, two basketball courts plus two training rooms and numerous programs. There is also a decent snack bar. The pool area is fine with a wading pool and other attractions. However if you want to swim forget it. The \"lap pool\" is usually full of kids or adults just standing around making it impossible to do any swimming. Plus, as mentioned in a previous review, the pool area in total is a chaotic mess to say the least. Plus the pool will be shut down Sept 5 so any hope of swimming will be gone. Why can't they stay open for a few more weeks so the rest of us can have a chance. Most of the life guards go back to school then but surely something could be done. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-08-24T10:10:31-0400", "location_id": "10723362", "id": "410123712", "user": {"username": "810taylor", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "This is new and the place to be for all ages.", "url": "https://www.tripadvisor.com/ShowUserReviews-g51524-d10723362-r410052861-m11068-The_Station_at_Central_Park_Aquatic_Center-Moore_Oklahoma.html#review410052861", "text": "There is a water park, athletics, walking trails, farmers market and fun assorted classes here. I took a jewelry making class and there are summer classes for children as well. Many play indoor basket ball here as well as exercise  classes. The staff is friendly and all are welcome.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-08-24T07:37:19-0400", "location_id": "10723362", "id": "410052861", "user": {"username": "juliedan2016", "user_location": {"name": "Oklahoma City, Oklahoma", "id": "51560"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Gets busy quickly, needs fewer people in the lazy river....", "url": "https://www.tripadvisor.com/ShowUserReviews-g51524-d10723362-r406306212-m11068-The_Station_at_Central_Park_Aquatic_Center-Moore_Oklahoma.html#review406306212", "text": "The setup at The Station is pretty neat: a toddler zero depth entry splash area (misters, colorful sprayers), a separate lazy river with 2 slides feeding into it (unsure of the length of the lazy river),  a separate swimming pool with dive boards and a small water slide. Each area has fencing around it and plastic pool chairs. Life vests in various sizes are available free of charge. There are family changing stations with showers & toilets & women's and men's locker rooms. Locks for the lockers cost $6 each. (Bring your own). The concession stand has decent prices. Free tubes are available for the lazy river. The \"lazy\" river is ANYTHING BUT RELAXING...There is a waterfall that is so strong it can knock a child or adult  off of their tube. Other water features in the lazy river are set on full force (jarring) instead of a soothing mist.  Lifeguards DO NOT monitor the # of people in the river & kids dart between tubes, yelling & playing chase. More of a madhouse than fun....", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-08-16T12:37:24-0400", "location_id": "10723362", "id": "406306212", "user": {"username": "donttravelmuch2014", "user_location": {"name": "Oklahoma City, Oklahoma", "id": "51560"}}}]}