{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "A Wonderful Little Hotel with Some Truly Horrible Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r437340925-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review437340925", "text": "I stayed at Hotel Indigo during this year's Dodge Poetry Festival in October, and I was initially very happy with the place. The funky, industrial room design works well with the building's original structure, check in was a breeze, and the beds are comfortable.\n\nHowever, since we were tired, we ordered room service. The voice message at room service said to leave a message if no one answered, so we left our room number and order. And then we waited. And waited. Finally, my friend called, only to be told that the kitchen was now closing, so room service wasn't available. He explained that we had followed the voice mail directions more than an hour earlier, and--to their credit--room service came through and delivered our meal rather quickly after that and free of charge. \n\nIf this had been the only snag, I'd be raving about how great this place was, but I came back to the room one day at 3, and the room hadn't been tidied, so I simply called housekeeping for fresh towels and toilet paper that evening. And then, and hour or so later, I called again. Finally, an hour after that, I went down to the front desk to ask, and--of course--just missed housekeeping as they went to my room. \n\nThe next day, I came back at 3, and the housekeeping cart was directly in front of my room. I excused myself, saying I would go down to the bar for a drink, allowing them to tidy the room in peace. I stayed in the bar, drinking an unwanted glass of wine for about 30 minutes. When I returned, the cart was gone, and the room hadn't been cleaned, beds were unmade, towels were still on the floor, and there were no fresh towels. So I gathered the towels, took the elevator into the basement and sought out housekeeping; I didn't want to dump a pile of dirty laundry at the front desk and cause a scene at the hotel, which by now (Saturday) was very busy. I then cleaned the room with lysol wipes, bagged the garbage, and took that to the basement as well.\n\nWhen we checked out on Sunday, the woman on duty at the desk did not ask how our stay was; however, I informed her of the lapses in service. She responded that I should have brought the matter to the attention of the front desk and that I had \"taken the matter to a third party,\" so there was nothing she could do. She spoke very loudly and rudely, dismissing me in front of other customers as if I were some sort of pest.\n\nI am not used to having to clean my own room at a hotel that charges the rates of the Hotel Indigo, and I don't appreciate being spoken to as if I were something unpleasant one might find on one's shoe. Even thinking of this now makes me so upset.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-15T00:41:52-0500", "location_id": "4786607", "id": "437340925", "user": {"username": "Ann C", "user_location": {"name": "Watertown, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Great location to everything!", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r433697907-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review433697907", "text": "Parking was available up the block and my room was decent. Clean. Good service. Love the architecture from the original bank that the hotel was previously. Must visit the Sky Lab bar on the rooftop in order to get generous views and even see the NYC skyline on a clear day/night. Worth the price. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brad S, General Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Steve - On behalf of the hotel Indigo Newark, NJ, I wanted to thank you for taking the time to provide us your feedback about your recent stay. I am glad to hear you experienced the hospitality and cleanliness that you expected and appreciated the wonderful views from our SkyBar. We value your patronage and hope that you choose us again on a return visit. \nWarm Regards,\nBrad Swales\nGeneral Manager\n", "title": "Owner Response", "published_date": "2016-11-09T11:05:59-0500", "id": "435939469"}, "trip_type": "Business", "published_date": "2016-11-01T11:06:51-0400", "location_id": "4786607", "id": "433697907", "user": {"username": "SteveTravels365", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great place to stay!", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r432488426-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review432488426", "text": "I had to go to Newark for a work trip - after my last experience in the city I wasn't really looking forward to it, tbh. However as soon as I stepped into Hotel Indigo I knew that my trip would be better than the last time (the hotel I was at last time was awful!). Great space, very nice and courteous staff, and my room was both very clean and super cute. I was up on the 9th floor so noise wasn't really an issue at all. My room was across from the elevator (which is normally a horrible place to be) but I didn't hear a single thing throughout the night. My colleague and I both agreed that if we ever have to come back to Newark, Hotel Indigo is the only place we'll stay.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Brad S, General Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Kelly - Thank you for taking the time to provide us your feedback about your recent stay at the hotel Indigo Newark, New Jersey. It is extremely gratifying that we earned your five star review. Thank you again for your thoughtful feedback and for your patronage. We would be honored to host your return visit.  \nWarm Regards,\nBrad Swales\nGeneral Manager\n", "title": "Owner Response", "published_date": "2016-11-09T11:12:55-0500", "id": "435941544"}, "trip_type": "Business", "published_date": "2016-10-28T12:11:36-0400", "location_id": "4786607", "id": "432488426", "user": {"username": "Kelly M", "user_location": {"name": "st. paul, minnesota", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Spacious room and great location", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r432012383-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review432012383", "text": "I was overwhelmingly surprised with the spacious room and amenities offered.   If you don't like city sounds, you will probably have to find a more recluse location, but I don't mind them. Great updated amenities (push button blinds/darkening blinds), sliding barn door to bathroom, hidden coffee/cream area, all makes for a seemingly massive room. The only thing I've had better is the mattress...it was ok, but not the best I've experienced. If you are staying in Newark, this is definitely the hotel to stay at. And the history (former bank) is even more intriguing!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-10-26T20:48:52-0400", "location_id": "4786607", "id": "432012383", "user": {"username": "ksboh", "user_location": {"name": "ohio", "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Disappointed ", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r431801789-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review431801789", "text": "We booked the Hotel Indigo in Newark to avoid the high cost of rooms in Manhattan and plus we were attending the MetLife for NFL Sunday and downtown Newark hotel is convenient for that. At Newark Liberty Airport we called for the shuttle to be told that it does not operate on weekends, so a cold traipse through Newark with cases after getting the NJ Transit to Newark Penn Station. No specific reason for not having a shuttle at weekends given, it was one of the reasons for booking this hotel. Staff on arrival friendly and apologetic, room allocated 807 faced Broad Street, beds comfortable and rooms with nice decor, facilities well appointed and of a good quality including a Keurig coffee maker. Excellent shower too and nice toiletries.\nThe area is indeed sketchy and as we wheeled cases down Broad Street we were asked for money 3/4 times. Didn't feel threatened as there seemed to always be a police presence, just not what we needed after doing our own transfer from the airport in the cold. Maybe the hotel owners need to replicate a guest experience from the airport to fully understand why the no shuttle at weekends is a mistake. And this too could not be used to travel between the hotel and Newark Penn station for trains to New York City. \n\nOn the second day of the two we returned to our room at around midnight to find the door to our room inexplicably open. The room had been \"serviced\" since we left late morning and we reported to reception thankfully nothing appeared to be missing. The receptionist comment that she couldn't do anything having just come on shift. There wasn't in fairness much to \"do\" but we we're surprised by the lack of empathy or recognition of the serious nature of the situation. (Quite what we could have walked in on was concerning)\nThings in the room had been moved but most importantly nothing was missing. These circumstances we're again reported in the morning before check out.\nFrankly liking Newark as a good option to stay and use NJ Transit \nto NYC I wanted to be positive about this stay at the Indigo as I generally am as a reviewer. Sadly I only have disappointment and won't return.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brad S, General Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Martyn - On behalf of the hotel Indigo Newark, New Jersey, I wish to thank you for taking the time to share your experiences about your stay. I am extremely sorry that your guest room was not secured as is required, but am grateful to hear that no issues arose from this. Feedback such as yours is taken very seriously and will be shared with our management team in order to make improvements to our service and product delivery. Thank you again for your thoughtful feedback and for your patronage.   I hope you will allow us the opportunity to regain your faith in us on a future visit. \nSincerely,\nBrad Swales\nGeneral Manager\n\n", "title": "Owner Response", "published_date": "2016-11-02T13:41:51-0400", "id": "434116067"}, "trip_type": "Friends getaway", "published_date": "2016-10-26T06:57:31-0400", "location_id": "4786607", "id": "431801789", "user": {"username": "MartynG_11", "user_location": {"name": "London, United Kingdom", "id": "186338"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Wonderful stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r431754308-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review431754308", "text": "My friend and I needed a hotel close to NJPAC for the four days of the Geraldine R Dodge Poetry Festival, and found a great value and lovely hospitality in Hotel Indigo. Every person, from the shuttle driver who met me at the train station, to front desk clerk, to housekeepers, were friendly and accomodating. The historic decor of this old bank is fascinating, from heavy metal columns, to the actual vault in the restaurant. We ate one dinner in the restaurant, and it was heavenly. I have food sensitivities and the sous chef came over, sat down next to me, and together we came up with a plan. The salmon over spinach with asparagus was cooked to perfection. And the chilled shrimp appetizer was delicious. \n\nTwo minor cons--no shuttle on the weekends, but a taxi from NJPAC to the hotel was only $7, plus it was an easy walk when we desired; and no refrigerator in the rooms, but ice was available for coolers.\n\nWe will definitely be booking again for the next Dodge Festival in 2018!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-26T04:34:01-0400", "location_id": "4786607", "id": "431754308", "user": {"username": "dotdoh", "user_location": {"name": "Annapolis, Maryland", "id": "29494"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Ask for Gerry!! A sweet southern soul", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r431649611-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review431649611", "text": "I enjoyed my 5 day stay at the Indigo. The minute I checked in I was greeted by this amazingly sweet woman named Gerry who checked me in. Each time she saw me she greeted me and my guest with a hug. I've been to Jersey many times, but she gave me true southern hospitality. All of the staff were amazing.\nRoof Top Bar is nice  (get the nachos or whiskey barbecue wings)\nPenn Station is literally a few blocks away which was perfect. which they suggested shuttle service and drove us over and we took the train to Manhattan.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-25T16:02:11-0400", "location_id": "4786607", "id": "431649611", "user": {"username": "Renée F", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Bad Location, Prepaid Room Downgraded.", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r431008298-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review431008298", "text": "First The Good: The rooms have interesting design, Good customer service for the most part. Helpful when they could. \nNow the BAD: My Prepaid room was downgraded from a Queen to double. No real explanation given, other then out of rooms. Since i reserved and prepaid, and even called to arrange for late check-in with specific request not to give away my room I don't understand.\n\nArea is horrible, even scary, and rundown. Spend the extra to get out of Newark!!\nRather gross looking spit on the Wall in very obvious location so not sure how the cleaning crew missed it. (picture submitted below)\nConcrete flooring throughout restroom including shower was very poor design choice. And water pressure in shower too low. \n\nIn general I am not a complainer, ex-army have stayed in much worse conditions. But This was not the way to start my Trip to NY.  Couldn't wait til morning to get out of this place. Thankfully i only planned to stay for 1 night since i arrived in Newark Airport so late. \n\nMy suggestion Get out of newark ASAP !!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Brad S, General Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Samuel - Thank you for taking the time to share your experiences about your stay at the hotel Indigo Newark, NJ.  Our mission is to deliver exceptional hospitality and I am disappointed to hear that we did not achieve this during your visit. I apologize that the room type you requested was not available when you checked in and were unable to accommodate your request as well as for the housekeeping issues that you encountered.  We take great care to accommodate all of our guests and I am sorry that you were inconvenienced in any way. \nThank you again for your thoughtful and I hope you will allow us the opportunity to regain your faith in us on a future visit. \nKind regards,\nBrad Swales\nGeneral Manager\n\n", "title": "Owner Response", "published_date": "2016-11-02T13:46:09-0400", "id": "434117317"}, "trip_type": "Friends getaway", "published_date": "2016-10-23T13:49:28-0400", "location_id": "4786607", "id": "431008298", "user": {"username": "SugaSam", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Enjoyable ", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r430656356-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review430656356", "text": "We spent the last night of our holiday here in Newark as handy for manhatten and the airport. We arrived early at around 10 am but the lady on reception was amazing. Even though she had been left on her own she got us into our room early and even gave us a free breakfast. What service.\n\nThe hotel itself is very pleasant nice room and some unique points being a former bank. My only complaint being that some of the service in the bar/restaurant was less than \"welcoming\".\n\nI know people have said it's a sketchy area but you need to see past the stigma. We had no problems at all and found the people of Newark were warm and friendly.\n\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-22T11:02:33-0400", "location_id": "4786607", "id": "430656356", "user": {"username": "BogtrotterBelfast", "user_location": {"name": "Belfast", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Nice hotel - sketchy location", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r430315954-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review430315954", "text": "I stayed here during a work trip.  Hotel staff were very friendly and helpful - provided me with great assistance on how to take the train to NYC - they also provided a shuttle to the train station. \n\nLocation - wouldn't feel safe exploring or walking to the train station - so I didn't.  The one time I stood outside to catch a Lyft was approached by someone. \n\nRoom was very nice - comfy bed and hot shower; cool shades and lighting. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brad S, General Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "On behalf of the hotel Indigo Newark, NJ, I wanted to thank you for taking the time to provide us your feedback about your recent stay. I am glad to hear our staff was friendly and helpful and that you enjoyed your room. Thank you for your feedback and for your patronage and we hope you choose us again on a return visit. \nWarm Regards,\nBrad Swales\nGeneral Manager\n", "title": "Owner Response", "published_date": "2016-11-02T13:51:51-0400", "id": "434118813"}, "trip_type": "Business", "published_date": "2016-10-21T07:35:21-0400", "location_id": "4786607", "id": "430315954", "user": {"username": "grantparkgal", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Nice hotel scary location.", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r429782974-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review429782974", "text": "My wife and I travelled to New York city. We stayed in Newark rather than Times Square to save money. We decided on Hotel Indigo. The hotel is only a year old. It used to be an old bank building. The décor has been kept to stay close to the original. Even the bank vault is intact. The hotel was very clean, water in room was hot, bed was comfortable, curtains made the room nice and dark for sleeping. Negatively though the walls between rooms are paper thin. We could hear what was on the TV in the next room, not good at 2:00am in the morning. The front desk people are fantastic especially Jerry who seems to work 24/7. Always there to help with any questions. The people in the restaurant were almost as good. Unfortunately the food was poor at best. The prices were average. The main reason for the 3 star rating though is the fact that the hotel is not in a good neighbourhood. Cop cars with lights flashing at each major intersection to deter criminal activity. Even when I did research it was recommended that you should not wonder from the main roads after 9:00pm. I agree.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Brad S, General Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Steve - Thank you for taking the time to share your experiences about your stay at the hotel Indigo Newark, New Jersey. I am sorry that the hotel location was not acceptable to you. We do staff a security team that is on site daily to ensure the safety and comfort of all of our guests. Our mission is to deliver an outstanding hospitality experience and feedback such as yours is taken very seriously so that we can make immediate improvements for our guests. Thank you again for your candid feedback, I hope that you will allow us the opportunity to regain your faith in us on a future visit. \nKind regards,\nBrad Swales\nGeneral Manager\n", "title": "Owner Response", "published_date": "2016-11-02T13:56:52-0400", "id": "434120195"}, "trip_type": "Couples", "published_date": "2016-10-19T11:06:53-0400", "location_id": "4786607", "id": "429782974", "user": {"username": "Steve H", "user_location": {"name": "Barrie, Canada", "id": "154980"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-11", "title": "Stylish hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r429623338-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review429623338", "text": "We have a very nice experience in this hotel. We like it's interior design and kindness staff. No free parking place, but it's easy to find the place to park. Will visit again next time, and try their restaurant. May,2015", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-10-19T03:53:11-0400", "location_id": "4786607", "id": "429623338", "user": {"username": "beico", "user_location": {"name": "Taiwan", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great getaway!", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r429542475-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review429542475", "text": "Hotel indigo was awesome! My girlfriend and I stayed there one night, that was supposed to be for the drake concert but it was cancelled. Although we were bummed about the show, the hotel made our stay as great as it could be. The staff there are all amazing and go above and beyond what is expected of them. We were allowed to check in early and the room was perfect. The blinds go up and down with a button and the shower was to die for! The bed was really comfortable and everything was clean. We ordered breakfast in the room and it was extremely fast and tasted amazing! When we checked out, the valet drivers were super friendly. Our car battery had died and they went completely out of their way to make sure we were okay. Terell (not sure if the name is correct) stayed with us in the parking lot the whole time and found jumper cables to jump the car. He was extremely helpful and I don't know what we would've done without him. They really have great staff working there and Terell was our lifesaver! Definitely going back!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-18T21:48:34-0400", "location_id": "4786607", "id": "429542475", "user": {"username": "Lindsey G", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Very good business-class hotel. Best I have stayed at in Newark.", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r425929455-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review425929455", "text": "Well-run business-class hotel in downtown Newark. Housed in a remodeled 1912 bank building, the facility has a great deal of character, while being very comfortable and well-appointed. Smaller hotel, the rooms are fairly small (mine was perhaps 140 square feet, but had floor-to-ceiling windows, and fantastic views).  Staff was very helpful and friendly. Restaurant was well-above average for a hotel restaurant. Workout room in the basement was as expected. Rooftop bar, with great views of the Manhattan skyline, is a great bonus. The neighborhood is a bit sketchy, but Penn Station is a 5 minute walk. Couple minor quibbles kept it from getting 5 stars (the lights on the bed reading light didn't work, and the TV wasn't properly connected), but these are trivialities. Overall, this was a very good hotel, and I will definitely be staying there again on my next trip to Newark.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Yajaira F, Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear FlyingAuditor,\n\nThank you very much for taking the time to share your recent experience with us. We are delighted to read that your overall stay was enjoyable. We can ensure our goal is provide an overall perfect and relaxing stay for all of our guest. Our maintenance department was addressed about your comments to ensure these issues do not occur for our future guest. Again thank you for your comments and we hope to see you again!", "title": "Owner Response", "published_date": "2016-10-13T19:10:40-0400", "id": "427762059"}, "trip_type": "Business", "published_date": "2016-10-07T11:43:27-0400", "location_id": "4786607", "id": "425929455", "user": {"username": "FlyingAuditor", "user_location": {"name": "Cincinnati, Ohio", "id": "60993"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "A good option in Newark", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r425676296-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review425676296", "text": "The options in Newark are limited.  I'll start by saying that I would definitely stay here again, but the property is not perfect.\n\nThe tall ceilings, good light, location and simplicity are a plus.  My room was on the second floor, and it seemed to have a pretty constant funky smell on the floor.  Not tragic, but not ideal.  \n\nNo minibar or complimentary bottled water in the room, but the room does have a keurig coffee maker.  \n\nThe bathroom has a concrete floor that extends into the shower area.  It wasn't super clean, and I'm not sure how well it will stand the test of time.  There was no trash can in the bathroom, which was befuddling.\n\nThe walls are pretty thin--the room next door had a cell phone alarm going off early in the morning (just on vibrate) and it was loud enough to be annoying in my room.\n\nThe food/beverage options in the hotel are decent given the lack of strong options in the immediate area.\n\nAll in all, it's a good option.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Yajaira F, Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Lauren,\n\nThank you for taking the time to share your recent experience at our hotel. While we appreciate your kind regards toward our hotel's design and layout. Allow me to apologize for any inconvenience you may have experienced. I can assure you that I have addressed your concerns about cleanliness with our Executive housekeeper and team to better service our future guests. We hope that you would give us another chance to prove we can provide an overall perfect visit.", "title": "Owner Response", "published_date": "2016-10-13T19:16:16-0400", "id": "427762640"}, "trip_type": "Business", "published_date": "2016-10-06T12:44:45-0400", "location_id": "4786607", "id": "425676296", "user": {"username": "Lauren S", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Comfortable stay as always", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r425080746-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review425080746", "text": "I'm a big fan of the Hotel Indigo chain and the Hotel Indigo Newark is no exception.  Great hotel with great rates within easy walking distance to Prudential Center and Penn Station.  There are also plenty of good restaurants within walking distance as well if you want to eat something outside the hotel.  Beds are heavenly with great pillows and shower space is fantastic with great Aveda products.   Hotel is nicely decorated and staff are courteous and helpful.   I'd like to give a special mention to Ruben Torres as he's consistently gone above and beyond what I'd expect from a front desk supervisor - with helping me out with queries before my arrival, to storing my bags and helping me with anything and everything I might need while I'm staying in Newark - he's a good employee.  \n\nI'd highly recommend this hotel and would stay again without hesitation.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Yajaira F, Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Boilermaker84,\n\nThank you for your feedback about your recent stay with us. Our goal is to provide exceptional service to our guests and I am glad that Ruben did just that to make sure your stay was enjoyable. We look forward to seeing you again.", "title": "Owner Response", "published_date": "2016-10-13T19:21:38-0400", "id": "427763155"}, "trip_type": "Business", "published_date": "2016-10-04T10:53:25-0400", "location_id": "4786607", "id": "425080746", "user": {"username": "boilermaker84", "user_location": {"name": "London, United Kingdom", "id": "186338"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Nice hotel, very friendly staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r422806320-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review422806320", "text": "This hotel is very nice, it is in an old building, but looks completely new but still respects the original architecture. I like the metal pillars in flashy colors.\nBed was fine, room has good lights and big windows, a spacy bathroom, fast internet.\nI had dinner, the restaurant was great though some more variety would be great.\nSpecial thanks to Max, the shuttle driver who showed up half an hour earlier in the morning to drive me to the airport", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": ", Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear erbee64,\n\nThank you for taking the time to share your recent experience at our hotel. We appreciate your kind regards toward our hotel's design and layout. I am glad that Max was able to provide you with a great experience. We hope to serve you again in the future.", "title": "Owner Response", "published_date": "2016-09-29T14:49:30-0400", "id": "423657874"}, "trip_type": "Business", "published_date": "2016-09-27T06:30:13-0400", "location_id": "4786607", "id": "422806320", "user": {"username": "erbee64", "user_location": {"name": "Leuven, Belgium", "id": "188669"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Graduation time", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r422132371-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review422132371", "text": "An evening of pure happiness. The hotel staff were incredible and VIP status had nothing to do with it.  From the time I arrived at the front door for valet until the time I checked out they were friendly, attentive and the please was spotless.  Real industrial feel with the renovations, that iPad in the room was a nice touch!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": ", Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear JesVel7\n\nThank you for your feedback about your recent stay with us. Our goal is to provide excellent service and amenities to our guests and I am glad that you enjoyed our hotel and service. It was our pleasure taking care of you and we are already counting down to your next visit.", "title": "Owner Response", "published_date": "2016-10-01T10:49:42-0400", "id": "424157788"}, "trip_type": "Family", "published_date": "2016-09-25T10:28:09-0400", "location_id": "4786607", "id": "422132371", "user": {"username": "JesVel7", "user_location": {"name": "Vineland, New Jersey", "id": "46890"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "Surprisingly nice overall given the location", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r421598342-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review421598342", "text": "I spent a night here on a business trip and was pleasantly surprised. The property is clean and in good condition. I found the staff to be very pleasant and helpful. I had a corner room overlooking Broad St so it was fairly noisy and lots of light got past the blackout shades, but it was comparable in noise and light to lots of NYC hotels. I enjoyed a light supper and a beer at the rooftop bar (although the music was a tad loud). A hearty and well cooked breakfast was provided. The fitness center was in good repair and clean. Definitely on my list for the next Newark trip. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Yajaira F, Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear HughKensington19,\n\nThank you very much for taking the time to share your recent experience with us. We are delighted to read that your overall stay was enjoyable. We can ensure our goal is provide a perfect and relaxing stay for all of our guest. We hope to see you soon!", "title": "Owner Response", "published_date": "2016-09-24T11:56:39-0400", "id": "421839759"}, "trip_type": "Business", "published_date": "2016-09-23T14:19:27-0400", "location_id": "4786607", "id": "421598342", "user": {"username": "HughKensington19", "user_location": {"name": "Oak Park, Illinois", "id": "36471"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Poor Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g46671-d4786607-r418880352-m11068-Hotel_Indigo_Newark_Downtown-Newark_New_Jersey.html#review418880352", "text": "This is a good property, which has spacious rooms.  But I have to say that the service was below par.  I stayed one night at this hotel, and had a business meeting the next morning.  In the morning, I ordered room service (breakfast) to be delivered.  It never came.  I waited two hours after I placed my order, and the food never came.  Not only this, but no one ever called me to communicate what was going on.  I had to go to my meeting on an empty stomach ...", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": ", Front Office Manager at Hotel Indigo Newark Downtown, responded to this review", "text": "Dear Daniele983\n\nThank you for your feedback about your recent stay with us. We regret that the service you have received was sub par and apologize for any inconvenience you may have experienced. I can assure you that I have addressed your concerns about room service with our chef and restaurant manager and corrective actions have been taken. Once again, thank you for sharing your feedback. I truly hope that we will have a chance to make it up to you and provide you with a better stay in the future.", "title": "Owner Response", "published_date": "2016-09-21T16:21:59-0400", "id": "421011286"}, "trip_type": "Business", "published_date": "2016-09-15T09:45:08-0400", "location_id": "4786607", "id": "418880352", "user": {"username": "Daniele983", "user_location": {"name": "Connecticut, USA", "id": null}}}]}