{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Such a pretty room for lunch", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r426786870-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review426786870", "text": "We had the room mostly to ourselves...my husband had the soup and salad bar which was nice and i had the crab cakes which were good, not amazing but good...the ambiance was sooo nice tho and the staff VERY friendly...I am happy to recommend. If you are not a foodie, you'll love it. If you are...and I am a bit of a food snob...I think you will still quite enjoy lunch in such a beautiful spot.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-10T13:59:21-0400", "location_id": "2718771", "id": "426786870", "user": {"username": "joygilinsky", "user_location": {"name": "Philadelphia, Pennsylvania", "id": "60795"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Love, Love, Love", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r413339568-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review413339568", "text": "Great service, nice menu with creole-cajun flair.  A little pricey, but well worth it.  The décor is so old-Southern.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-08-31T17:20:43-0400", "location_id": "2718771", "id": "413339568", "user": {"username": "Chrystal S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "An Elegant Breakfast", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r386644910-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review386644910", "text": "Since we were staying at Le Pavillon, we reserved breakfast one morning at the Crystal Room. The room is absolutely gorgeous and very elegant. We ordered off the menu and both of our breakfasts were delicious. Our server, Dallas, was absolutely wonderful! So kind and caring. We thoroughly enjoyed our meal and the beautiful surroundings. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-27T13:34:31-0400", "location_id": "2718771", "id": "386644910", "user": {"username": "faithrunfarm", "user_location": {"name": "Noble, Oklahoma", "id": "51546"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Faded Glory", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r373039381-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review373039381", "text": "Breakfast is served in a beautiful, ornate ballroom.  The food is quite good.  Excellent selections which reflect the location.  The problem is that everything just seems a bit tired.  The carpeting, the scuff marks on the wall, the ill fitting suits on the waiters.  The buffet breakfast looks downright inedible.  Order from the menu and be pleasantly surprised by the quality of the food.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-05-15T04:56:05-0400", "location_id": "2718771", "id": "373039381", "user": {"username": "dmittleman", "user_location": {"name": "Palm Beach Gardens, Florida", "id": "34531"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Great dining experience!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r368265304-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review368265304", "text": "My mother, wife and I enjoyed truly one of the best dining experiences in our lives. Exceptional service by Alvin , Lucy, Guadalupe, and  Ms. Patty Cake made dinner and breakfast most memorable.  The congenial personalities and a heartfelt personal attention is more than worthy to mention.  My mother (age 91) still talks about the experience daily. Thank you Crustal Room staff.   We'll be back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for sharing your recent dining experience with us, we are elated that you enjoyed your it. I will be sure to pass on the accolades to all the staff that you mentioned. I am glad that we were able to make a lasting impression on you and your mother. It would be our pleasure to welcome you back to the Crystal Room on your next visit.", "title": "Owner Response", "published_date": "2016-05-07T08:23:10-0400", "id": "370935420"}, "trip_type": "Family", "published_date": "2016-04-27T13:15:07-0400", "location_id": "2718771", "id": "368265304", "user": {"username": "mabdulbaaqee", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "great food and service", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r365446373-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review365446373", "text": "Food excellent Staff excellent!! They offer anything from seafood to steak. The breakfast  buffet offers made to order eggs and omelets as well as cereal and juices", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for taking the time to share your recent experience with us. We are glad that you found our food and staff to be excellent. I will ensure to pass on the accolade to the staff. We do look forward to welcome you back to the Crystal Room.", "title": "Owner Response", "published_date": "2016-05-07T06:24:51-0400", "id": "370904397"}, "trip_type": "Friends getaway", "published_date": "2016-04-19T10:40:13-0400", "location_id": "2718771", "id": "365446373", "user": {"username": "Luci C", "user_location": {"name": "New York", "id": "28953"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-02", "title": "Beautiful Room. Very good Breakfast", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r351651918-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review351651918", "text": "We only had breakfast two times at the hotel, but the service, and for us, the a la carte menu was perfect....great fresh orange juice and coffee.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for your review. I am glad that you enjoyed your dining experience. We look forward to welcome you back", "title": "Owner Response", "published_date": "2016-03-05T05:46:21-0500", "id": "353080906"}, "trip_type": "Family", "published_date": "2016-02-28T10:49:30-0500", "location_id": "2718771", "id": "351651918", "user": {"username": "citycat66", "user_location": {"name": "New York City, New York, Usa", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-02", "title": "Great Breakfast Buffer", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r349991593-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review349991593", "text": "Start out your morning with a huge buffet. While pricey, you can probably skip lunch if you load up.  The choices are very good and I enjoyed finding some local options there.  The room will start you off with a great feeling of Nola elegance.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for taking the time to review us. I am happy to hear that you do enjoy the breakfast buffet and the local selections offered. I will pass on the accolades to the culinary staff.\n\nWe look forward to welcome you back. ", "title": "Owner Response", "published_date": "2016-03-05T05:52:44-0500", "id": "353082102"}, "trip_type": "Business", "published_date": "2016-02-22T06:44:09-0500", "location_id": "2718771", "id": "349991593", "user": {"username": "Denise K", "user_location": {"name": "Walnut Creek, California, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-08", "title": "Lovely place with both excellent food and service", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r337100583-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review337100583", "text": "A beautiful room with an outstanding buffet filled with not only delicious food but  a fantastic presentation. The service is impeccable.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Food and Beverage Manager at The Crystal Room, responded to this review", "text": "Thank you for recent review,  we value hearing the feedback from our guests. I am delighted that you appreciated and enjoyed our menu and service. I will be sure to pass along your accolades. We truly look forward to welcoming you back again.\n\nSincerely,\nPatrina Jamieson\nFood and Beverage Manager", "title": "Owner Response", "published_date": "2016-01-12T17:12:21-0500", "id": "339519925"}, "trip_type": null, "published_date": "2016-01-03T18:16:03-0500", "location_id": "2718771", "id": "337100583", "user": {"username": "Harold S", "user_location": {"name": "Minneapolis, Minnesota", "id": "43323"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-12", "title": "Great Atmosphere", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r335713577-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review335713577", "text": "The atmosphere and service were great. We had the breakfast buffet which was average but not spectacular. A little pricey.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Food and Beverage Manager at The Crystal Room, responded to this review", "text": "Thank you for taking the time to share your recent Crystal Room experience, we truly value your feedback.  I am glad that you were pleased with the service and atmosphere as it is our goal to exceed every guest expectations. \nI will definitely share this with our culinary team as we seek to improve the breakfast buffet.\n We look forward to welcome you back soon.\n\nSincerely,\nPatrina Jamieson\nFood and Beverage Manager\n\nSincerely,\nPatrina Jamieson\nFood and Beverage Manager", "title": "Owner Response", "published_date": "2016-01-12T17:25:57-0500", "id": "339521248"}, "trip_type": "Couples", "published_date": "2015-12-29T07:03:51-0500", "location_id": "2718771", "id": "335713577", "user": {"username": "Carlos S", "user_location": {"name": "Wisner", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Christmas Brunch was a horrific experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r335287864-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review335287864", "text": "My girlfriend and I made reservations for the Christmas Champagne Brunch for 11:45.  Due to parking we arrived at 11:50, but we had called ahead.  There was a frazzled woman at the hostess desk but about 30 people in front of us and 30 people milling about looking angry.  She eventually just told us to go to the bar without taking our name.  She had a napkin in her hand with names on it so my girlfriend went back and gave out name and said we had a reservation.  The hostess said everyone had reservations, but wrote out names down and sent us back to the bar.  An hour later our name was called.  We went in to find it was a buffet...not advertised as one.  The meat cutting station was no manned.  The food was in warmers...about half were empty and cold.  The food was tasteless and bland.  Much was thrown away.  They 2 hours later they still had a line.  I have never seen so many angry patrons wanting to talk to management.  They had taken a credit card to charge if you didn't show.\n\nWe spoke with other patrons who had been coming for 10 years who said the management had changed and the chef had either quit of been fired.   Brunch was supposed to last until 2:30 but by 2:20 we were leaving having been seated after 1 PM.  They were clearing out the trays, but still seating people.  Others on Yelp had an Identical dinner expeience.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for taking the time to share your recent Crystal Room experience, we truly value your feedback. My sincere apologies that your dining expectations were not met as our goal is to exceed each guest expectation.\nI can assure you that my team and I are working assiduously to ensure that something of this nature on a occasion like this or any occasion at all does not reoccur. I did spoke with Open Tables and got more incite with regards to the credit card function and why it was requesting such that we were unable to see on our system. \nI will definitely share this with our culinary team as we seek to improve the overall dining experience. I do hope you will offer us the opportunity to serve you and your girlfriend again and provide a more promising dining experience. Please reach out to me at crystalroom@lepavillon.com to set up your visit as we look forward to welcome you back.\n\nPatrina Jamieson\nFood and Beverage Manager\n", "title": "Owner Response", "published_date": "2016-01-14T13:06:09-0500", "id": "340072390"}, "trip_type": "Couples", "published_date": "2015-12-27T12:11:18-0500", "location_id": "2718771", "id": "335287864", "user": {"username": "Christopher F", "user_location": {"name": "Slidell, Louisiana", "id": "40435"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Christmas Ruined!! Or 27 Reasons to Avoid Le Pavillion at all costs.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r335113223-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review335113223", "text": "Let me first say that I have been a regular customer of the Crystal Room for more than a decade now and have enjoyed almost 20 Thanksgiving, Christmas, and Easter holidays at the hotel.  My patronage and unwavering support has now ended in the wake of the single most disastrous dining experience I have ever had.  Just one of the problems I experienced would be enough to aggravate even the most seasoned diner, but I experienced no less than 27 problems on this visit, some of which are so rare and offensive I am still struggling for the words to describe them.  I'll also say that I am not a fussy diner and the overwhelming majority of my reviews on Trip Advisor are positive as I generally like to use this platform to recommend rather than reject hotels and restaurants.  Without further adieu here are the reasons:\n1.\tA reservation could not be made by telephone in a timely manner because the person who answered the telephone was unable to make a reservation, twice.\n2.\tA credit card required to guarantee reservation on Open Table, which is kind of insulting given that I attempted to make reservations via telephone on two separate occasions which would not have required one.\n3.\tWe arrived at 1:40pm for a 2:00pm reservation to find close to 100 people waiting in the lobby of the hotel to eat.  I knew I was in trouble at this point, but I was being held hostage as they already had my credit card number.\n4.\tThe hostess immediately blamed the customers in the dining room for the delay.  She said people are taking longer than normal.  Who could have anticipated that people would linger at Christmas dinner?  I’m pretty sure that everyone with half of a brain could have anticipated that.\n5.\tNumerous tables were open and set and many more needed to be cleared.  None of those tables ever had customers seated at them over the course of my 3 ½ hour stay.  \n6.\tThe hostess abandoned computerized reservation system and scrawled my name on a slip of receipt paper.  This was not the result of a computer crash and no one was able to explain to me how or why this was happening.  It is totally inexplicable, but it happened.\n7.\tI later learned that the hostess started seating whoever was in front of her and completely ignoring times of reservations or party sizes.\n8.\tAfter being told to wait in the hotel lobby no hostess or employee ever came to the lobby to call for any party, not just my party but any party at all.\n9.\tThe hostess refused to give me a wait time.  She refused to even tell me a ball park figure or the time of the reservations of those currently being seated.\n10.\tNo bartender was ever available at bar when I tried to get my wife a drink.  Waited for 10 minutes and 15 minutes and never saw one.  I did see two waiters pouring themselves drinks from the soda gun and both promised to get the bartender but none ever came.\n11.\tNever able to check with hostess as she was never at the stand on the four separate occasions that I attempted to check with her.\n12.\tA hotel employee repeatedly lied to me about why the wait was so extreme and the time of the reservations of the other guests that had been seated before my wife and I.  She kept saying “they are just a little backed up today” which isn’t actually possible given that this was a buffet.  How does the kitchen get behind at a buffet? \n13.\tAfter the hostess was retrieved by another employee for me one hour and 20 minutes into my wait.  She said she would seat me and then disappeared into the dining room to never be seen again.\n14.\tThe restaurant manager then told me at 3:15 (one hour and 35 minutes into my wait) that her advice is that I not even eat at the Crystal Room due to what she described as “challenges.”\n15.\tThe manager then suggested that we eat elsewhere and that they would pay for my meal, but when I asked where that meal would be she was unable to offer even one suggestion of where that meal might take place.\n16.\tAfter offering for me to order from their a la carte menu the manager then sat me at a table next to buffet stations that were being disassembled.  I can only assume so that I could see what I was missing, or wanted the staff to have an audience while they carted off the dregs of the buffet.  Numerous other tables were available in that were not in the work zone of the buffet.\n17.\tWe were offered complimentary champagne which was served hot, not warm or room temperature, but hot like it had been stored in a boiler room.  It was undrinkable even to two people who had been trying to get a drink for two hours. \n18.\tOur waitress took 15 minutes to bring us menus for a la carte dining before disappearing for another 15 minutes.  This is in a restaurant that is fully staffed, half full, and serving a buffet.\n19.\tMy wife then ordered crab cakes and a steak from the menu and I ordered a salad and a club sandwich.  My wife was more optimistic than I at this point and I figured we are finally going to get something to eat, but I was right, they screwed up this seemingly simple order.\n20.\t20 minutes later the waitress returned to tell me that they were out of crab cakes.  When I asked what they could provide as an alternative she suggested that we look at a menu again.  I refused and advised her to cancel the rest of the order.  Actually I am fairly certain that the waitress could not speak or understand English at a level that would allow her to hold a job where she has to interact with the English speaking public.  I got a lot of blank stares.\n21.\tWe then ate random scraps of leftovers from a buffet that was sitting out for at least 5 hours as I was convinced that it was the only way that we would get anything to eat.  \n22.\tThe food later gave both my wife and I tremendous gastrointestinal distress making this not only one of the worst experiences I have ever had at any hospitality establishment it actually followed us home and continued into the next morning.\n23.\tOur a la carte order that had been cancelled 30 minutes earlier arrived at our table.\n24.\tThe $12 Ceaser Salad was the saddest, most wilted, most pathetic salad I have been served anywhere but a fast food restaurant.  Wendy’s has a better ceaser, but they are closed on Christmas so I could not go get one.\n25.\tMy wife’s steak was ordered medium-rare but was served at a temperature best described as well-ruined, hockey puck like, or inedible.\n26.\tThe manager who had previously promised to personally take care of us finally reappeared and promised that the General Manager would be contacting me to discuss our experience.  That never happened.\n27.\tAll of this madness went on despite the fact that the hotel and restaurant both appeared to be fully staffed.  There must have been at least 40 wait staff present, but they all seemed to be hiding from the customers rather than trying to serve anyone.\nAnd on a final note all of this occurred on my wife's birthday at an establishment that I had been touting as one of the finest holiday dining experiences one could have.  Thank you Pavillon for ruining two special occasions for the price of one.", "helpful_votes": "9", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for your time to share in detail your experience, we truly value your feedback and loyalty to the Crystal Room. My sincere apologies that your dining expectations were not met as our goal is to exceed each guest expectation.\n\nI can assure you that my team and I are working assiduously to ensure that something of this nature on a occasion like this or any occasion at all does not reoccur. I did spoke with Open Tables and got more incite with regards to the credit card function and why it was requesting such that we were unable to see on our system. \nI will definitely share this with our culinary team as we seek to improve the overall dining experience. We do hope you will offer us the opportunity to serve you and your wife again and provide a more promising dining experience. Please reach out to me at crystalroom@lepavillon.com to set up your visit as we look forward to welcome you back.\n\n\nPatrina Jamieson\nFood and Beverage Manager", "title": "Owner Response", "published_date": "2016-01-24T12:55:50-0500", "id": "342439269"}, "trip_type": "Couples", "published_date": "2015-12-26T14:25:01-0500", "location_id": "2718771", "id": "335113223", "user": {"username": "Thomas P", "user_location": {"name": "Asheville, North Carolina, United States", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Christmas eave dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r334851535-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review334851535", "text": "Had family Christmas eave dinner and would rate dinner as poor. Despite waiting over an hour for meal, the ribeye I ordered (medium) was way over cooked and sent it back. The ribeye is not thicker than 1/4\" thick so I was disappointed in the quality for a $32 steak. I have had better steaks at Applebee's. I would not recommend this place for dinner despite the beautiful hotel. Not a quality restaurant. Wish it was better. The piano man was good though.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for taking the time to share your recent Crystal Room experience, we truly value your feedback. My sincere apologies that your dining expectations were not met as our goal is to exceed each guest expectation.\n\nI will definitely share this with our culinary team as we seek to improve the overall dining experience. I do hope you will offer us the opportunity to serve you and your family again and provide a more promising dining experience. Please reach out to me at crystalroom@lepavillon.com to set up your visit as we look forward to welcome you back.\n\nPatrina Jamieson\nFood and Beverage Manager", "title": "Owner Response", "published_date": "2016-01-24T12:59:49-0500", "id": "342440049"}, "trip_type": "Family", "published_date": "2015-12-24T18:24:56-0500", "location_id": "2718771", "id": "334851535", "user": {"username": "john f", "user_location": {"name": "Henderson, Nevada", "id": "45953"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-12", "title": "Wanted to be impressed but we wer disappointed", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r333520165-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review333520165", "text": "We eat here on our first evening at the hotel and also for breakfast. It's a magnificent room but the restaurant is not being run as a destination. It was practically empty when we dined yet a number of items from the menu were unavailable and the staff were very willing and personable but seemed to lack some training. A great restaurant manager and chef could transform this place. I really wanted to rate this place highly but sadly cannot. Sorry", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for taking the time to share your Crystal Room experience, we truly appreciate your feedback. My sincere apologies that your dining expectations were not met as our goal is to exceed each guests expectations. My team and I can assure you that we are working hard to improve the overall dining experience. \n\nWe do hope you will offer us the opportunity to serve you again and provide a more promising dining experience. \n\nPatrina Jamieson\nFood and Beverage Manager\n", "title": "Owner Response", "published_date": "2016-01-24T16:07:13-0500", "id": "342465590"}, "trip_type": "Couples", "published_date": "2015-12-17T06:22:32-0500", "location_id": "2718771", "id": "333520165", "user": {"username": "johnzbath", "user_location": {"name": "Bath, United Kingdom", "id": "186370"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "Excellent", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r326909082-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review326909082", "text": "We ate Breakfast and Dinner in this beautiful restaurant the waiters were wonderful and could not do enough for you. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Patrina J, Manager at The Crystal Room, responded to this review", "text": "Thank you for your review, we value hearing the feedback from our guests. I am delighted that you enjoyed your experience. I will be sure to pass along your accolades. We truly look forward to welcoming you back again.\n\nSincerely,\nPatrina Jamieson\nFood and Beverage Manager", "title": "Owner Response", "published_date": "2016-01-24T16:14:31-0500", "id": "342466463"}, "trip_type": "Business", "published_date": "2015-11-15T06:14:01-0500", "location_id": "2718771", "id": "326909082", "user": {"username": "josephine z", "user_location": {"name": "Davenport, Florida", "id": "34169"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-02", "title": "Fine Dining in Elegant Setting", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r326903631-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review326903631", "text": "On a visit to New Orleans, my wife and I were looking to find a nice restaurant to celebrate her birthday.  She did some research and liked the photos of this hotel/restaurant.  The first impression we got as we departed from the cab was spectacular!  The restaurant is in a white mansion that is now a hotel.  A doorman in a derby greeted us and led us to the restaurant.  The ceilings are very high and the walkway to the restaurant was furnished with what appeared to be antiques with a setting of the late 1800s.  We were seated by the fireplace which added to the atmosphere of eating in a by gone era. My wife order drum fish (similar to redfish) and I ordered the beef tips over noodles.  My wife’s fish was excellent, but mine was average.  I must say my Manhattan was excellent, however.  We were celebrating my wife’s birthday so to our surprise the chef came out and talked to my wife and our server provided us a complimentary dessert with a personalized message (Look at the photos to see it.)  Our server also took several photos of us dining and in front of the fireplace so we have memories for later.  Overall, we had a very enjoyable and memorable dinner.  I thought the value was reasonable for downtown New Orleans and very good for the beautiful atmosphere they maintain here.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-11-15T05:49:32-0500", "location_id": "2718771", "id": "326903631", "user": {"username": "Amease", "user_location": {"name": "Akron, Ohio", "id": "29912"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "Warm Southern Charm", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r318150846-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review318150846", "text": "The Crystal Room offers service with a warm southern hospitality and with the culinary talents of Chef Mendoza your palate is taken to new heights. Chef Mendoza offers an amazing Sunday Brunch from omelets of your choice made before your eyes, to shrimp and crab legs, to prime rib and salmon.  Several trips to the buffet were taken so we could get a sampling of all this Chef has to offer. One also needs to experience dinner, from seafood to filet to gumbo with the ambiance of the fire place and attentive staff you are taken back in time to a time of gentility.  The prime rib just melts away,  the gumbo gives one the taste of New Orleans, and the salmon was out of this world. Chef Mendoza I hear is working on a new menu and knowing that in itself makes one want to travel back to New Orleans to sample this Chef's tantalizing cuisine.  We have also mentioned Chef Mendoza's staff.  We would like to mention  a few dining staff that have warm, wonderful, and attentive personalities that offer service with a smile and want your dining experience to be over the top, and they are Frank and Jyllian.  Frank offers true southern hospitality and treats all guests like royalty.  Jyllian takes care in seeing that all guests are treated like family and that ones dining experience is complete from start to finish.  And in the bar area we have Pam.  Pam's sincere, outgoing and fun personality make for a wonderful close to one's day.  It was a pleasure speaking with Chef Mendoza, Frank, Pam and Jyllian who are a rare finds in customer service today in that they treat all guests with hospitality, kindness and friendliness and are an asset to the LePavillion family.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-10-12T17:23:45-0400", "location_id": "2718771", "id": "318150846", "user": {"username": "MG H", "user_location": {"name": "Quakertown, Pennsylvania", "id": "53503"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Excellent breakfast", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r307942187-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review307942187", "text": "Breakfast buffet and omelet station were both excellent. Frank was so attentive and so much fun, We really enjoyed the entire experience.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-09-07T15:20:13-0400", "location_id": "2718771", "id": "307942187", "user": {"username": "Donna W", "user_location": {"name": "Ridgeland, Mississippi", "id": "43981"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "$20 weekday lunch buffet: definitely worth it.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r297664917-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review297664917", "text": "Delicious gumbo, lovely attentive staff. Pasta station with dishes made-to-order. Large salad bar and a variety of tasty NOLA hot food items to try. Beautiful setting!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-08-10T13:01:57-0400", "location_id": "2718771", "id": "297664917", "user": {"username": "Liz_Rom", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Lovely Meal", "url": "https://www.tripadvisor.com/ShowUserReviews-g60864-d2718771-r293742814-m11068-The_Crystal_Room-New_Orleans_Louisiana.html#review293742814", "text": "This is a restaurant to enjoy a \"slow\" meal with friends to enjoy the lovely surroundings  Don't be in a hurry.  Food was excellent - the spinach salad is very good and HUGE", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-07-29T08:59:20-0400", "location_id": "2718771", "id": "293742814", "user": {"username": "Bobbye D", "user_location": {"name": "Houston, Texas", "id": "56003"}}}]}