{"paging": {"total_results": "9", "skipped": "0", "previous": null, "results": "9", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "A very special ride on the water", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r386681567-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review386681567", "text": "My husband and I took a gondola ride in Newport Beach for our wedding anniversary.  Our gondolier, Parker, did a great job, he was helpful getting into and out of the gondolier and was very personable.  Our ride was smooth and not hurried.  It was very pleasant.  My only reservations were that we could not hear the music he was playing and the snack was lack-luster (cheese/crackers/sliced sausage).  We took our own beverages (they don't provide wine) but a bottle of sparkling cider was included and we were able to take that with us.  I would highly recommend and would do again. Our tour was only an hour.  Go longer if you can and if available.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-27T14:27:12-0400", "location_id": "1764064", "id": "386681567", "user": {"username": "lighthousepam", "user_location": {"name": "Orange, California", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Fantastic Experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r361072963-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review361072963", "text": "The weather cooperated wonderfully, the water was smooth, and our gondolier was tremendous. Parker was polite, respectful and very unobtrusive on a peaceful, idyllic cruise. I highly recommend the Gondola Company of Newport!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-02T22:57:46-0400", "location_id": "1764064", "id": "361072963", "user": {"username": "John G", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "Very fun and relaxing", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r303554850-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review303554850", "text": "As part of our 29th wedding anniversary celebration, we did a one hour gondola cruise around Newport Cove. It was very peaceful and we brought our own wine and cheese, crackers and snacks. Very fun and entertaining; the gondolier was able to give a little history and point out sites along the trip. We stopped at the bridge and took a quick photo from an adjacent dock. \nWe were entertained by an Italian opera, so it felt very much like we were in another country, say Venice, Italy for example. This is highly recommended and affordable with a Groupon, or even without.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-08-25T21:24:26-0400", "location_id": "1764064", "id": "303554850", "user": {"username": "Tim_the_Enchanter417", "user_location": {"name": "Lake Forest, California", "id": "32596"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-02", "title": "Beautiful, peaceful evening", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r254110971-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review254110971", "text": "First, the good news:\nI had the pleasure of corresponding and talking with Ella. I first telephoned the company attempting to get a time for Valentine's Day, but they were completely booked. Instead of just writing me off, Ella suggested we come in on Friday, with a 6:30pm opening. Because of rush our traffic, it took us 1.5 hours to get to the site, but Ella was there waiting for us, as well as a very friendly, smiling woman at the desk. It was exactly the kind of atmosphere I needed after dealing with traffic. I brought some apple cider, which they took and brought to the Gondola along with cheese, bread and sausage or salami.\n\nNow, the less-than-good news:\nAccording to my watch, our gondola pushed away from the dock at approximately 6:32pm and the cruise was very relaxing and peaceful. Our gondolier didn't have much to say, but we didn't mind. It was a beautiful evening. At 7:15pm we stepped off the gondola, making our cruise an approximate 45 minute event.\n\nThe Happy Ending:\nThe true character of any business is the ability to resolve issues.  When someone wants to make a purchase, it is easy to sell them what they want.  When they are not happy with the purchase, customer service will say a lot about a company.  Here is where I believe Ella and her company were head and shoulders above many businesses.\n\nI was a little perturbed, because it was supposed to be an hour long gondola ride. I went to the office and complained to Ella. She said we left early and when I countered with our departure time from the dock, she apologized and immediately asked how she could make it right and offered $15.00 off the price. Fair enough. \n\nI sincerely appreciated the fact Ella remained as friendly and professional trying to appease me as she did trying to accommodate me when we first spoke on the phone. She could have just dismissed our concerns, but she came across absolutely sincere, honest and compassionate. An excellent business woman and representative of the Gondola Company of Newport.  Nicely done, Ella.\n\nI really do recommend this company, but make sure you keep tabs on your departure time from the dock and your return time. Thank you, Ella.\nVisited February 2015", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-02-14T06:16:06-0500", "location_id": "1764064", "id": "254110971", "user": {"username": "paulm5545", "user_location": {"name": "Los Angeles, California", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Perfect Day", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r197645044-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review197645044", "text": "The weather was perfect, the harbor beautiful and the folks at Gondola Company were great. I booked the ride a few days ago on a whim because the weather was so nice at the beach. My hub felt like it was a special occasion and we were treated as such.\nI wish all get away weekends were so fun. It started with some great customer service here. I hope I get the same surprise someday.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-03-16T14:40:00-0400", "location_id": "1764064", "id": "197645044", "user": {"username": "WineGal2", "user_location": {"name": "Newport Beach", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2013-11", "title": "Sensational!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r187649926-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review187649926", "text": "I grew up in Huntington & Newport beach and wanted to show my daughters some of my memories, we picked up my sister (who lives in Newport & Kim told us about the Gondola ride). It was wonderful! The ride was so beautiful! Mike Olsen was so charming, he went above and beyond to make that night our favorite memory out of our 2 week vacation! \n\nMahalo Mike & A Hui Hou! \n\nTara Wilhelmsen", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2013-12-14T14:30:52-0500", "location_id": "1764064", "id": "187649926", "user": {"username": "Taramaui", "user_location": {"name": "Kihei", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2011-11", "title": "Romantic.", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r120529810-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review120529810", "text": "I purchased a Groupon for a Gondola ride for up to four individuals, it was only my boyfriend and I though. Very romantic. They take you through the harbor, in the \"backyard\" of BEAUTIFUL homes. You go under several bridges. They also provide bread, salami, cheese, Hershey's kisses and sparkling cider. You are welcome to bring your own bottle of champagne or wine if you'd like. Along with the basket of goodies, they also provided a blanket and an umbrella (because there was chance of rain). It is an hour ride, well worth it!\n\nIt did start sprinkling for about 5 minutes, but nothing crazy, and we managed. Then it stopped. Our gondolier was Mark, he was very courteous.\n\nDefinitely will do again on a special occasion!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2011-11-13T05:15:57-0500", "location_id": "1764064", "id": "120529810", "user": {"username": "Claudeezyy", "user_location": {"name": "Escondido, California", "id": "32358"}}}, {"lang": "en", "rating": 5, "travel_date": "2011-10", "title": "Very unique and romantic", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r120093919-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review120093919", "text": "My wife and I took a gondola trip for our anniversary.  We went in mid-October, and I scheduled the trip to begin just before sundown.  The evening was cool, but not windy.  The Gondola company was very friendly and helpful in making the arrangements.  Our Gondolier was courteous and very professional.  The Gondola company provided a rather warm blanket for us to snuggle under and a small snack basket (cheese, a few slices of Italian bread, and some rather thin salami slices). \nWe brought our own bottle of champagne, which helped set the mood. \nThe setting was beautiful, and the night was enchanted.  Sure, the snacks were light, but we were not expecting a meal.  We relaxed and enjoyed the scenery as the boats and houses passed by and the day turned into night.  The gondola ride was a little pricey for an hour's entertainment.  It is not something I would do often, but for a special occasion, it was worth every nickle.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2011-11-02T17:36:19-0400", "location_id": "1764064", "id": "120093919", "user": {"username": "UAHiker", "user_location": {"name": "Columbus, Ohio", "id": "50226"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Great unique experience!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d1764064-r67264659-m11068-Gondola_Company_of_Newport_Private_Cruise-Newport_Beach_California.html#review67264659", "text": "I took my boyfriend on a Gondola Cruise and we had a great time! The staff is excellent and made sure it was a wonderful experience. I surprised my boyfriend with it for Valentine's Day and he had no clue this even existed. I highly recommend Gondola Cruises of Newport- the scenery is beautiful in the Newport Beach canals and the weather is always great!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2010-06-12T06:40:55-0400", "location_id": "1764064", "id": "67264659", "user": {"username": "UniqueMichelle1980", "user_location": {"name": "Southern California", "id": null}}}]}