{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Superb Service!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r436958545-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review436958545", "text": "We had an excellent stay at the Newport News Marriott at City Center. The staff was nothing short of amazing. Miyah at the front desk was knowledgeable, approachable, and really made my fiance and I feel appreciated. Kerry in the Concierge made us feel like family. We were instantly greeted with a smile, top notch service, and we can't wait to visit again. Lastly, Kadijahdra with Room Service was great as well. The facility was clean, quiet, and very accommodating. Marriott has never failed us and this will be my only choice when staying in Newport News, Virginia! Thank you again!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for your recent stay at the Newport News Marriott at City Center and for reviewing your experience with a very kind review.  We work diligently to provide outstanding service in every area of the hotel and I was delighted to read that the Front Desk, Concierge and Room Service Teams contributed to making your overall stay even more enjoyable. Thank you again for your feedback. We will keep up the hard work.  Please come back and again the next time you are in Newport News.  ", "title": "Owner Response", "published_date": "2016-11-14T09:13:39-0500", "id": "437152486"}, "trip_type": "Couples", "published_date": "2016-11-13T15:55:17-0500", "location_id": "603595", "id": "436958545", "user": {"username": "michjohn80", "user_location": {"name": "Newport News, Virginia", "id": "58019"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Simply The Best", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r436866850-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review436866850", "text": "We had a conference to attend in Newport News, and to our delight, we found we would be staying at the Mariott at City Center. Not only is it a first class hotel, but the surrounding area is so lovely!  I had the opportunity each morning to walk around the Fountain Plaza right outside my door, and also check out all the many restaurants and shops in the area. This was probably one of the best staff I have ever had the pleasure to work with, from the front desk throughout the entire hotel, great, friendly people.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing our hotel for your recent stay in Newport News Marriott at City Center.  We put a lot of time and emphasis on training to ensure we provide service excellence to each and every guest.  Your wonderful comments let us know we are on the right track.  Whether our guests are here for a quick two night stay or attending a week long meeting, there is so much to enjoy within steps of our hotel.  It was also wonderful to read that you thoroughly enjoyed your accommodations and that the facilities and amenities exceeded your expectations.  On behalf of our team, we appreciated the opportunity to be of service and thanks you for kind compliments.  ", "title": "Owner Response", "published_date": "2016-11-14T02:20:30-0500", "id": "437046704"}, "trip_type": "Business", "published_date": "2016-11-13T08:34:29-0500", "location_id": "603595", "id": "436866850", "user": {"username": "Diane M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Home Away From Home", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r436275437-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review436275437", "text": "Once a year, we stay at the Newport News Marriott at City Center.  This year, we decided to take advantage of the Concierge Lounge and it was definitely a treat.  The food and refreshments in the Lounge are great.  Kerry is one of the Hostesses in the Concierge Lounge and she goes above and beyond to assure that guests are satisfied.  She also has a beautiful smile and truly understands customer service.  She is a valuable asset to the Marriott in Newport News.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing the Newport News Marriott City Center hotel for your stay once again.  As a General Manager, there is no greater praise to have a guest return because they love the staff, location, amenities and everything else our hotel has to offer.  Our associates work exceptionally hard to go above and beyond to for every single guest that walks through our doors. I appreciate you for mentioning Kerry and I will be sure to read your comments in this morning's stadand up meeting. We sincerely thank you for your business and look forward to welcoming you back soon to the Newport News Marriott City Center.", "title": "Owner Response", "published_date": "2016-11-14T02:22:13-0500", "id": "437047036"}, "trip_type": "Friends getaway", "published_date": "2016-11-10T20:18:55-0500", "location_id": "603595", "id": "436275437", "user": {"username": "darkchocchild", "user_location": {"name": "Maryland", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Outstanding food and services", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r436158047-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review436158047", "text": "Very professional services by the staff. I was met with a smile and very welcoming attitudes. Thanks to Tonia, Aaron, Derek and Jhaylsue and Vivian...  I will definitely return often.  One of the best restaurants in city center", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for staying at the Newport News Marriott City Center.  I am glad that you had the opportunity to dine at our Kitchen 740 Restaurant.  Our chef takes great pride in preparing mouth-watering dinner specials and entrees made of the highest quality ingredients. Thank you for taking the time to recognize the restaurant team for the wonderful service they provided you during your stay.  We are very proud of them and you can be assured that I will recognize their efforts at the next staff meeting in front of his/her peers. I will be sure to share your compliments with the chef, management and wait staff. They will be thrilled to know you had a great dining experience. We look forward to the opportunity of welcoming you back in the near future.", "title": "Owner Response", "published_date": "2016-11-11T05:02:31-0500", "id": "436358751"}, "trip_type": "Business", "published_date": "2016-11-10T06:55:27-0500", "location_id": "603595", "id": "436158047", "user": {"username": "JGX88", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Great Place to Stay when in Newport News area", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r435841523-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review435841523", "text": "I have been staying at this hotel Mon-Thurs for approximately 3 years and i have really enjoyed it.  The staff has been great and makes me feel very welcome.  From the check-in staff to the staff in the concierge lounge, I always feel like this is my home away from home.  Kerry in the lounge always greets me a smile and does everything to make my stays enjoyable.  I would recommend this property to anyone staying in the area.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing our hotel for your lodging while in Newport News. As you are aware, Newport News Marriott at City Center puts a lot of time and emphasis on training to ensure we provide service excellence to each and every guest. Your wonderful comments let us know we are on the right track. Kerry is one of our terrific Concierge attendants and gets to take care of our special guests like you. On behalf of our team, we appreciated the opportunity to be of service and thank you for the recommendation and kind compliments.    ", "title": "Owner Response", "published_date": "2016-11-10T07:30:52-0500", "id": "436166111"}, "trip_type": "Business", "published_date": "2016-11-09T06:26:22-0500", "location_id": "603595", "id": "435841523", "user": {"username": "bkodish", "user_location": {"name": "Atlanta, Georgia", "id": "60898"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Nice hotel, great staff!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r435458815-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review435458815", "text": "I have recently been traveling to Newport News, VA and staying at the Marriott at City Center. The hotel itself is nice, and the rooms are spacious and clean. What separates this Marriott from others is the staff - they are awesome! Kerry, who works in the concierge lounge, has gone out of her way to make me feel at home when I am on the road. She will quickly learn your likes and dislikes, and if you're lucky, she might just save you a piece of your favorite dessert knowing it will make your long work day seem not that bad (as she did for me).  If you are coming to Newport News, VA, I highly recommend you stay here and experience their hospitality for yourself!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Wow - thanks for your terrific review!  One of the best compliments a hotel can receive is the honor of earning a repeat guest. We are so glad you love staying with us and thank you for posting your experience online for future travelers to read. We really think Kerri is special too and I am pleased she is personalizing your experience. Please know we truly appreciate your business and look forward to being your home away from away every time your travels bring you to Newport News Marriott City Center.  ", "title": "Owner Response", "published_date": "2016-11-09T05:19:04-0500", "id": "435822561"}, "trip_type": "Business", "published_date": "2016-11-07T13:38:50-0500", "location_id": "603595", "id": "435458815", "user": {"username": "dottens", "user_location": {"name": "Palm Harbor, Florida", "id": "34535"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Outstanding Food and Customer Service!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r434300780-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review434300780", "text": "I frequently have lunch here for over 10 years, and I've enjoyed every visit! The staff is very professional and courteous, and the food is outstanding! Huge recognition goes out to Derek, Aaron, Toya, Kayla, and Antoinette...and even those that I don't know their names, but take time out to speak and smile. Keep up the excellent work, I sincerely appreciate it!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for dining at the Newport News Marriott City Center.  I am glad that you had the opportunity to dine at our Kitchen 740 Restaurant.  Our chef takes great pride in preparing mouth-watering dinner specials and entrees made of the highest quality ingredients.  Thank you for recognizing our great team working in the restaurant and kitchen!  I will be sure to share your compliments with the chef, management and wait staff.  They will be thrilled to know you had a great dining experience.  We look forward to the opportunity of welcoming you back in the near future.", "title": "Owner Response", "published_date": "2016-11-04T04:42:36-0400", "id": "434526080"}, "trip_type": "Friends getaway", "published_date": "2016-11-03T07:32:40-0400", "location_id": "603595", "id": "434300780", "user": {"username": "Demetrius D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great Hotel, I will come back", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r434242886-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review434242886", "text": "We stayed overnight for a business trip.  The hotel is new, clean, good facilities, Great location, good value for the price, great service (a special thanks to Kerry in the lounge who helped me during a time of need),.  I travel to Newport News often and will be coming back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing to stay at the Newport News Marriott at City Center and for sharing your review with other travelers.  I was absolutely delighted to hear how much you enjoyed your stay with us and we were able to impress you with our service, accommodations and facilities. Thank you for recognizing Kerri, she really cares about her guests in the Concierge Lounge!  I look forward to sharing your wonderful comments with our staff. They will certainly appreciate the recognition of their hard work.  I hope you will stay with us again during your next visit Newport News.", "title": "Owner Response", "published_date": "2016-11-04T04:41:12-0400", "id": "434525793"}, "trip_type": "Business", "published_date": "2016-11-03T03:54:51-0400", "location_id": "603595", "id": "434242886", "user": {"username": "Gary W", "user_location": {"name": "Milwaukee, Wisconsin", "id": "60097"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Thoughts on my second visit here", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r433972865-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review433972865", "text": "I enjoyed my stay here for a business conference over three days. Some of the highlights were:\n1.  The bed comfort and cleanliness of the bathroom are the most important issues for me and both were excellent. The bedding was nice and comfortable too\n2. I ate here a few times and the menu is diverse, avant-garde, and priced right! Chicken wings were awesome. \n3. I had lost the code on me room key and the maid that happened to be on the second floor took the time to call for a new key to be delivered. She could have easily walked by. That made a huge difference among my stays in other hotels. The service staff though the whole hotel was this friendly. \n4. The water they used for my conference was good water. Not tap water. The coffee was high grade and tasted very good. The full breakfast was also very well done \n5. I don't like we're the toilet spool is located. It's hard to reach but a minor complaint. \nI would highly recommend staying here for business or pleasure. Very nice digs and very friendly staff. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing the Newport News Marriott at City Center for your recent conference.  It was a privilege to be of service!  I was delighted to read that our associates met all of your needs and expectations.  Thanks also for posting our review online.  Your feedback will confirm for future groups that we are the ideal hotel of choice in Newport News City Center.  Not only do we work hard to make sure your event operates smoothly, our Downtown location offers endless possibilities to “see, do and unwind” when the business portion of the day is over.  We do hope we do have another chance in the future to welcome for your group back for another meeting. ", "title": "Owner Response", "published_date": "2016-11-03T05:48:09-0400", "id": "434271762"}, "trip_type": "Business", "published_date": "2016-11-02T06:52:45-0400", "location_id": "603595", "id": "433972865", "user": {"username": "bronco38", "user_location": {"name": "Prince George, Virginia", "id": "58089"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Excellent Location Near Airport", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r433834090-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review433834090", "text": "This is an excellent location surrounded by shops, restaurants, office buildings and a pond with huge fountains. The following individuals provided outstanding service in making my stay an enjoyable one. They were accommodating and  attentive to whatever I needed.  Drew Walton( bellman),  Brian Banks, Jalisa Davis, and Justin Rogers (front desk),Marta Douglas ( housekeeping supervisor), David Phillips (engineer) and Maurice Williams, Toya (hostess), Malik  Salaam (server) and Jhaylsae Kilmartin (breakfast supervisor)..", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Wow - thanks for your terrific review!  One of the best compliments a hotel can receive is the honor of earning a repeat guest.  Thank you for taking the time to recognize ten of our terrific team members for the wonderful service they provided you during your stay.  We are very proud of them and you can be assured that I will recognize their efforts at the next staff meeting in front of their peers. We are so glad you love staying with us and thank you for posting your experience online for future travelers to read.   Please know we truly appreciate your business and look forward to being your home away from away every time your travels bring you to Newport News Marriott City Center.  ", "title": "Owner Response", "published_date": "2016-11-03T05:50:25-0400", "id": "434272471"}, "trip_type": "Business", "published_date": "2016-11-01T21:28:40-0400", "location_id": "603595", "id": "433834090", "user": {"username": "emanuel282016", "user_location": {"name": "Providence, Rhode Island", "id": "60946"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Thanks Kali - the upgrade was a nice surprise !", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r433778501-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review433778501", "text": "My wife and I stayed here this past weekend - when we checked in - Kali (Front Desk) thanked us for our Platinum Loyalty. I told her this was a special weekend for my wife and I and asked if an upgrade was possible. \n\nShe told us that she upgraded our room to a fountain view. What we didn't realize was that she upgraded us to the PRESIDENTIAL SUITE !! \n\nTo Management: Please extend our highest gratitude to Kali. It's team members like her - excellent customer service, and attention to detail is what keeps us maintaining our Platinum level of loyalty. \n\nThe room was excellent - the view was stunning! thanks again  - when visiting Newport News - this is the only property anyone should consider when looking for accommodations.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for your loyalty to Marriott and for choosing our hotel for your recent stay in Newport News Marriott at City Center. We put a lot of time and emphasis on training to ensure we provide service excellence to each and every guest.  Your wonderful comments let us know we are on the right track. Kali is a great example of our customer service in action!  On behalf of our team, we appreciated the opportunity to be of service and thanks you for kind compliments.    ", "title": "Owner Response", "published_date": "2016-11-02T04:06:39-0400", "id": "433913475"}, "trip_type": "Business", "published_date": "2016-11-01T14:47:40-0400", "location_id": "603595", "id": "433778501", "user": {"username": "Brent D", "user_location": {"name": "New Orleans, Louisiana", "id": "60864"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Concerige ", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r433083376-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review433083376", "text": "Awesome service in the concerige lounge.  Kerry took great care of us and was friendly and helpful as well as a super hostess.  This was our favorite part of the stay as well as the clean hotel and friendly staff.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for taking the time to share your wonderful comments regarding your recent stay at the Newport News Marriott at City Center.  As a General Manager, your compliments were a pleasure to read and I was delighted to hear that you were thoroughly spoiled by our associate Kerri. I am glad you had a chance to take advantage of our great location! I will be sure to share your fantastic remarks with my team as a testimonial that what they do daily makes a difference. Thank you again and we look forward to the opportunity of welcoming you back very soon. ", "title": "Owner Response", "published_date": "2016-11-02T04:04:13-0400", "id": "433912862"}, "trip_type": "Business", "published_date": "2016-10-30T17:10:35-0400", "location_id": "603595", "id": "433083376", "user": {"username": "Amy W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Hampton University Homecoming", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r432007257-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review432007257", "text": "Everyone that I encountered during my visit was extremely helpful and pleasant. One employee in particular stood out from the rest, his name is Drew. Drew assisted my husband and my friends throughout our stay. Each time we encountered Drew he was very friendly and helpful. I also heard that several other visitors to the hotel were assisted by Drew and had a similar experience. He should be commended for a job well done!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "We were so glad to have the distinct pleasure of hosting your recent event at the Newport News Marriott at City Center.  It was nice to read that our staff and facilities helped make your function go off without a hitch. We host many such groups and meetings and our entire team is committed to ensuring everyone has a great experience. I appreciate your recognizing Drew for his outstanding service and I will be sure to read your review in our morning meeting. Thank you again for your feedback.  We will keep up the hard work.  Please come back again the next time you are in Newport News.  ", "title": "Owner Response", "published_date": "2016-10-28T02:44:28-0400", "id": "432349368"}, "trip_type": "Friends getaway", "published_date": "2016-10-26T19:55:10-0400", "location_id": "603595", "id": "432007257", "user": {"username": "hugrad98", "user_location": {"name": "Philadelphia, Pennsylvania", "id": "60795"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great stay during conference", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r431867575-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review431867575", "text": "I had a very enjoyable stay during a three day conference.  Their facilities and staff were great.  The rooms were immaculate and very comfortable.  Loved the shops and restaurants within walking distance.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing the Newport News Marriott at City Center for your recent conference.  It was a privilege to be of service!  I was delighted to read that our associates met all of your needs and expectations.  Thanks also for posting our review online.  Your feedback will confirm for future groups that we are the ideal hotel of choice in Newport News City Center.  Not only do we work hard to make sure your event operates smoothly, our Downtown location offers endless possibilities to “see, do and unwind” when the business portion of the day is over.  We do hope we do have another chance in the future to welcome for your group back for another meeting.  ", "title": "Owner Response", "published_date": "2016-10-28T02:42:30-0400", "id": "432349011"}, "trip_type": "Business", "published_date": "2016-10-26T10:23:37-0400", "location_id": "603595", "id": "431867575", "user": {"username": "Koro214", "user_location": {"name": "New England", "id": "4672736"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Hampton university homecoming ", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r430743421-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review430743421", "text": "I had a great stay. The beds were very comfortable and the staff was extremely friendly from the housekeeping girl, the girl that delivered in my room service and especially the Bellboy named Drew. I'm booking my room soon for next year ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "We were so glad to have the distinct pleasure of hosting your recent event at the Newport News Marriott at City Center. It was nice to read that our staff and facilities helped make your function go off without a hitch. We host many such groups and meetings and our entire team is committed to ensuring everyone has a great experience. Thank you for recognizing Drew we put a lot of time and emphasis on training to ensure we provide service excellence to each and every guest. Your wonderful comments let us know we are on the right track. We will keep up the hard work.  Please come back again the next time you are in Newport News.  ", "title": "Owner Response", "published_date": "2016-10-24T05:35:37-0400", "id": "431177640"}, "trip_type": "Friends getaway", "published_date": "2016-10-22T18:56:52-0400", "location_id": "603595", "id": "430743421", "user": {"username": "Moe M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Hampton University Homecoming", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r430368462-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review430368462", "text": "Everyone was friendly and accommodating. \nThere was a number of us in our group there for a college homecoming. We got a little loud one night and they allowed us to move our party downstairs to the lounge area. \nA gentleman by the name of Drew was very helpful to us as well. \n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing the Newport News Marriott at City Center for your recent conference.  It was a privilege to be of service!  I was delighted to read that our associates met all of your needs and expectations. Thanks also for posting our review online. Your feedback will confirm for future groups that we are the ideal hotel of choice in Newport News City Center. Not only do we work hard to make sure your event operates smoothly, our City Center location offers endless possibilities to “see, do and unwind” when the business portion of the day is over. We do hope we do have another chance in the future to welcome for your group back for another home coming. ", "title": "Owner Response", "published_date": "2016-10-24T05:46:12-0400", "id": "431181120"}, "trip_type": "Friends getaway", "published_date": "2016-10-21T10:36:00-0400", "location_id": "603595", "id": "430368462", "user": {"username": "Theron C", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Pleasant Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r430181139-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review430181139", "text": "My stay at The Marriott at City Center was perfect. The room was stylish and modern, the bed was plush and comfortable. The room service was fast and my food was hot.  There is mini fridge in the room. The area surrounding the hotel is gorgeous, from the many restaurant/bar options to a gym and a pond in the middle.  One of the staff that helped make my stay enjoyable was Drew, he showed us exceptional customer service.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing the Newport News Marriott at City Center for your stay.  I was pleased to read we were able make you feel at home and that our service, facilities and amenities all contributed to making you feel welcome and comfortable. We are also happy to hear how much you enjoyed being able to walk around and take advantage of all City Center has to  offer during your free time. I appreciate your reciognition of one of our great team members, Drew. Thanks again for all of your kind comments.  We look forward to welcoming you back the next time you are in Newport News. ", "title": "Owner Response", "published_date": "2016-10-24T05:25:22-0400", "id": "431174303"}, "trip_type": "Couples", "published_date": "2016-10-20T19:38:14-0400", "location_id": "603595", "id": "430181139", "user": {"username": "islandluva143", "user_location": {"name": "Brooklyn, New York", "id": "60827"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Excellent Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r429894125-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review429894125", "text": "Excellent service from Letesse Kerry concierge front desk!  Definitely coming back!  I am platinum Elite member and this is definitely best experience ever!  Will definetly recommend.  Thank you Mattiot for hiring exceptional talent!\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for choosing our hotel for your recent stay in Newport News Marriott at City Center.  We put a lot of time and emphasis on training to ensure we provide service excellence to each and every guest.  We take great pride in delivering excellent service and accommodations.  That along with our desired makes our Marriott one of the best places to stay while in Newport News. Your wonderful comments let us know we are on the right track. Thank you for taking the time to recognize Letesse and Kerri for their excellent service as well as your loyalty to Marriott and being one of our premier reward members. On behalf of our team, we appreciated the opportunity to be of service and thanks you for kind compliments.   ", "title": "Owner Response", "published_date": "2016-10-21T05:44:43-0400", "id": "430283239"}, "trip_type": "Business", "published_date": "2016-10-19T20:12:36-0400", "location_id": "603595", "id": "429894125", "user": {"username": "Elvis C", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Amazing Concierge in the lounge", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r429876646-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review429876646", "text": "From the front desk to the concierge lounge, this is one of the best full service Marriott's. Kerry in the lounge is an amazing host and will take great care of you. The front desk staff greets you with a smile and makes you feel welcome when on the road. They've even started elite parking spaces in the garage. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Wow - thanks for your terrific review!   One of the best compliments a hotel can receive is the honor of earning a repeat guest.  We are so glad you love staying with us and thank you for posting your experience online for future travelers to read.  Thank you  for recognizing Keri, She will definitely appreciate the recognition! Now that you have informed the world about the Elite Member parking on the first floor of the garage, they will be in high demand.  Please know we truly appreciate your business and look forward to being your home away from away every time your travels bring you to Newport News Marriott City Center.  ", "title": "Owner Response", "published_date": "2016-10-20T07:16:51-0400", "id": "430026100"}, "trip_type": "Business", "published_date": "2016-10-19T17:30:02-0400", "location_id": "603595", "id": "429876646", "user": {"username": "brd714", "user_location": {"name": "Annapolis, Maryland", "id": "29494"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Elite Lounge", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d603595-r429854610-m11068-Newport_News_Marriott_at_City_Center-Newport_News_Virginia.html#review429854610", "text": "Kerry is awesome! She really takes care of the folks in the 11th Floor Executive lounge. She makes sure the food is fresh, the tables are clean, and the customers are happy. The Marriott is lucky to have her.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Mark B, General Manager at Newport News Marriott at City Center, responded to this review", "text": "Thank you for your recent stay at the Newport News Marriott at City Center and for reviewing your experience.  We work diligently to provide outstanding service in every area of the hotel and I was delighted to read that Keri in the Concierge Lounge contributed to making your overall stay even more enjoyable. She is certain to appreciate the name recognition! Thank you again for your feedback.  We will keep up the hard work.  Please come back and again the next time you are in Newport News.  ", "title": "Owner Response", "published_date": "2016-10-20T07:18:28-0400", "id": "430026575"}, "trip_type": "Business", "published_date": "2016-10-19T14:57:54-0400", "location_id": "603595", "id": "429854610", "user": {"username": "Pam B", "user_location": {"name": null, "id": null}}}]}