{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Love it!!! Cute, Nice Art work All Around", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d8596754-r414623614-m11068-Wine_and_Design-Newport_News_Virginia.html#review414623614", "text": "Took 3 kids with me to a Saturday class and it was a great time!! My husband and I both ended both ended up painting a canvas also. The instructor was awesome!!! She was very nice and attentive!!! We are from out of town when we come back to the area again we will definitely be back to visit Wine & Design without a doubt!!! I was admiring all the pretty art work on the walls. I really enjoyed the experience and it want my first time at this type of facility but it was definitely one of my most memorable. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-09-04T09:47:41-0400", "location_id": "8596754", "id": "414623614", "user": {"username": "Libra123456", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "Therapy at its best", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d8596754-r310107431-m11068-Wine_and_Design-Newport_News_Virginia.html#review310107431", "text": "Christy and her staff are excellent! Painting takes you to a place of serenity while enjoying time with your family and friends. Christy's studio is beautiful and your time here is well spent! A customer forever!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-09-14T03:46:34-0400", "location_id": "8596754", "id": "310107431", "user": {"username": "Baynaked", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "Painting for Everyone", "url": "https://www.tripadvisor.com/ShowUserReviews-g58019-d8596754-r304627923-m11068-Wine_and_Design-Newport_News_Virginia.html#review304627923", "text": "This is a great studio right in the middle of City Center! There are actually two studios in one, with a larger studio in the front, which is a bright and colorful pink, and a smaller one in the back, which is a lovely turquoise color. Though they were still doing \"soft openings\" when I went, they will be serving two glasses of wine with each painting, which is where the \"Wine and Design\" comes from. This studio is surrounded by great restaurants and shops, so I recommend making a night of it, grabbing dinner somewhere in the City Center, and then walking right over to the studio to enjoy your paint class. If you are hesitant to think your painting will be a success, don't be! Most paintings are already lightly drawn on your canvas and the instructors will walk you through each step of the process and bring out the inner artist in everyone. I went with a friend and the painting that we did looked like it would be difficult, but with the instructor's help, every single painting in that room looked fantastic. She was really patient and her instructions were so easy to follow! They also have music on, and the instructor is not talking every second of the two hour experience so there is plenty of time to laugh and enjoy your time with your friends. It's a great place for a girl's night, a couple's night, and if you have a reason to celebrate, they even do private parties. They also do classes for children. I highly recommend trying this at least once, but I'll warn you, you'll be planning your next visit when you are done so clear some wall space and prepare to embrace your inner artist!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-08-29T04:53:58-0400", "location_id": "8596754", "id": "304627923", "user": {"username": "MakingMemories317", "user_location": {"name": "California", "id": "28926"}}}]}