{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "This was so much fun", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d3903049-r403775905-m11068-Pacific_Coast_Hydrobikes-Newport_Beach_California.html#review403775905", "text": "My boyfriend was worried about sharks but you're not out in open ocean. You pedal around the Naples canal area. I rarely exercise and was expecting to get winded but these are surprisingly easy to pedal. The group ahead of us had a boy who looked to be five or six years old on a bike by himself. (Life jackets provided) The bike is very stable for selfie and video opportunities at no time was I worried about being rocked off. There is a small waterproof compartment for storage right up front. The one thing that was intimidating was having to maneuver around the bigger boats. All in all a great way to spend an hour or two DO NOT FORGET SUNSCREEN! The rays bounce at you from every angle. The men running it are very informative and will tell you where to go and places that are good for \"chilling\" There is a groupon available that makes this $11 an hour but you have to purchase the groupon then make a reservation in advance. (I think by 24hours)", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-08-10T12:41:40-0400", "location_id": "3903049", "id": "403775905", "user": {"username": "Jennelle S", "user_location": {"name": "Durango, Colorado", "id": "33397"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-06", "title": "Relaxing Way to Spend an Afternoon", "url": "https://www.tripadvisor.com/ShowUserReviews-g32780-d3903049-r164102127-m11068-Pacific_Coast_Hydrobikes-Newport_Beach_California.html#review164102127", "text": "Great way to spend a an hour out in the bay at Newport Beach, an affluent seaside community located in Orange County.  Next time we'll do two hours.\n\nThe hydro-bikes are extremely easy to maneuver, don't take a lot of peddling effort and don't tip over. The have have a small storage containers where we stored our shoes, water, etc. We cycled  barefoot so we could dip our feet in the water when we wanted to cool off. \n\nTake your camera and get some amazing pictures of the boats and beautiful houses that line the shores. .   \n\nThe boaters out here are very polite and drive slow so not to cause waves. The harbor is relatively calm,\n\nOverall, peaceful, fun time out on the water.  The guy that checked us in was very nice and helpful as well.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-06-15T16:18:42-0400", "location_id": "3903049", "id": "164102127", "user": {"username": "Off2SeeItAll", "user_location": {"name": "California City, California", "id": "32139"}}}]}