{"paging": {"total_results": "4", "skipped": "0", "previous": null, "results": "4", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-01", "title": "Happy hour visit!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32810-d7345263-r343656959-m11068-Downtown_Wine_Merchants-Oakland_California.html#review343656959", "text": "We went here for happy hour on a Friday and we were lucky we got seats at the bar.   This was our first visit and I really like the ambiance and the vibe - low key and not pretentious.  Great way to relax after a long work week.\n\nThe happy hour prices were decent.  They had $7 glasses of wine and food options.  For our drinks, I ordered a Rose.  It was refreshing, had a balanced acidity and a smooth finish.  For food, We ordered off the regular menu and shared a salad and the cheese spaetzle.  I thought it was random that they offered spaetzle since you typically only see it at German restaurants.   It's similar to ma and cheese but instead of pasta, it's small dumplings coated in cheesy goodness.  I thought the portion was a little on the small side for the price, but again, I was starving and it was really good!\n\nGreat experience for a first visit and would definitely go back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-01-29T14:51:56-0500", "location_id": "7345263", "id": "343656959", "user": {"username": "maria c", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-06", "title": "If you miss this, you miss something very special!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32810-d7345263-r278312931-m11068-Downtown_Wine_Merchants-Oakland_California.html#review278312931", "text": "This is a fantastic place to bring friends to lunch in downtown Oakland.  First, the food was outstanding.  We ordered the market greens salad and the chopped salad, the lamb chops, the shrimp with green and red tomatoes flatbread, slow cooked pork with Granny Smith apples & carmelized onions flatbread, and a fantastic cheese plate.  Every crumb was consumed.  Each dish was well conceived and confidently executed.  Yet, the best dish was the figs with prosciutto ham and cheese - whoa!  Yum!  That one was eaten under a minute by 5 of us.\n\nThe service is excellent and caring.  The atmosphere is elegant yet comfortable.  It's located above the 12th Street Bart and in front of the beautiful green lawn in front of the City Hall stairs.  If you are coming to see a show at the Oakland Fox, the Paramount, the Awakening Cafe or the Sound Room, this is the perfect place to grab a delicious bite and taste amazing wines.  Or if you come for lunch, you can browse Oaklandish, the well curated Laurel bookstore, and other charming local Oakland stores.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-06-06T09:42:50-0400", "location_id": "7345263", "id": "278312931", "user": {"username": "Margaret H", "user_location": {"name": "Oakland, California", "id": "32810"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-02", "title": "Wine Bar + Wine Merchant with a lot of interesting, small production wines", "url": "https://www.tripadvisor.com/ShowUserReviews-g32810-d7345263-r254986678-m11068-Downtown_Wine_Merchants-Oakland_California.html#review254986678", "text": "Oakland, from Uptown down Broadway to Downtown and Jack London Square, is becoming a great beer and wine trail, with the likes of Diving Dog Brewhouse, The Trappist, Beer Revolution, Campovida, Independent Brewing Company, and several more all within walking distance. Downtown Wine Merchants, the latest entry, is right at the 14th Street exit of 12th Street BART, at the corner of Broadway and San Pablo and Frank Ogawa Plaza.\n\nThis part of town gets quiet at times, with the most foot traffic at weekday happy hour and Friday/Saturday nights. It is both a wine bar (with excellent, reasonably priced small plates - a $10 sort of octopus Niçoise salad among the dishes the last time I visited) and retail wine shop, with a lot of interesting, small production varietals, mostly from northern California, but plenty of European wines as well.\n\nThey have a great happy hour, with discounts on their fine tap wines and beer, and during happy hour you can also buy a bottle at retail price (half off the normal menu price) to enjoy on site.\n\nThe staff are friendly and knowledgeable and are happy to talk about the wines and make recommendations.\n\nIf you're around downtown at happy hour, or need a special (not necessarily expense) bottle of wine to go, Downtown Wine Merchants should be your first stop.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-02-18T08:39:46-0500", "location_id": "7345263", "id": "254986678", "user": {"username": "SantoGabacho", "user_location": {"name": "Oakland, California", "id": "32810"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-12", "title": "A great new gathering place in downtown Oakland", "url": "https://www.tripadvisor.com/ShowUserReviews-g32810-d7345263-r244100454-m11068-Downtown_Wine_Merchants-Oakland_California.html#review244100454", "text": "I went here tonight to meet friends who live in Oakland. Sadly, the restaurant had its windows broken and its chef attacked by protestors last week, and we went to support this two week old business. Amazing selection of interesting wines, nice wine tasting flights, and really tasty small plates. They're open for lunch, and I can't wait to try their lunch menu, as the food was really good. Definitely a nice comfortable sophisticated spot to meet friends and have good wine, food and conversation.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-12-11T20:59:18-0500", "location_id": "7345263", "id": "244100454", "user": {"username": "Cyclist704", "user_location": {"name": "Bay Area", "id": null}}}]}