{"paging": {"total_results": "5", "skipped": "0", "previous": null, "results": "5", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2004-09", "title": "Perfect place for our Wedding!", "url": "https://www.tripadvisor.com/ShowUserReviews-g38954-d76791-r3425742-m11068-Pickering_House_Bed_and_Breakfast-Olathe_Kansas.html#review3425742", "text": "We had looked at so many run-of-the mill wedding sites, then we found this gem! One look at this historic home and we knew it was where we wanted our family and friends to come together and share in our special day. This home reflects Olathe and it's history. The hospitality was so outstanding that it helped make all of our guest feel right at home. The food was excellent and much care was taken by the staff to make sure all of our needs were not only met but exceeded. We loved the residential neighborhood atmosphere and the nature of The Pickering House as we were not looking for a sterile cookie cutter \"facility\" to have our wedding and reception. The owners were wonderful in working with us and really made us feel part of the family. We would highly recommend The Pickering House for any event because we know they put their hearts into what they do.  Many thanks!\n", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2005-04-28T20:00:00-0400", "location_id": "76791", "id": "3425742", "user": {"username": null, "user_location": {"name": "Olathe, Kansas", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2005-01", "title": "Pickering House Major Disappointment...", "url": "https://www.tripadvisor.com/ShowUserReviews-g38954-d76791-r2432414-m11068-Pickering_House_Bed_and_Breakfast-Olathe_Kansas.html#review2432414", "text": "Disappointments, too numerous to mention here as well.  The Pickering House is managed by a  couple who have GREAT abilities in the kitchen and the food was elegant and plentiful.   The rest of their abilities are lacking.  Our son's outdoor wedding would have been a disaster had it not been for our OWN efforts to clean up and beautify the yard with flowers, mulch, pulling of weeds, and trash removal.  Promises made by the owners of Pickering are only half delivered or not delivered at all.   The food was served during the reception, then pulled after an hour of serving, without checking with us first.  The exterior of this home needs much attention, peeling paint, dirt, trash, weeds, and an unkept yard abound.   The interior is dark, but elegant, but also could use some attention.   We had an August wedding and were promised that the interior downstairs area would be kept cool for our guests.  This was dissappointing as well.   I could go on for days describing our disappointments.  We have drafted a letter to the owners expressing our dissatisfaction as well.   Please chose the Pickering house for an elegant dinner or a night out, but stay away from wedding planning involving this facility.   An unhappy customer here....\n", "helpful_votes": "7", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2004-08-08T20:00:00-0400", "location_id": "76791", "id": "2432414", "user": {"username": null, "user_location": {"name": "Overland Park, KS", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "The Pickering House, what a wonderful experience!", "url": "https://www.tripadvisor.com/ShowUserReviews-g38954-d76791-r1554854-m11068-Pickering_House_Bed_and_Breakfast-Olathe_Kansas.html#review1554854", "text": "My husband and I were married at The Pickering House and found the whole experience to be excellent. The hosts and staff were the most attentive and we were suprised at how smoothly such a large event progressed. We were drawn to the \"natural outdoor setting\" because we had wanted a outdoor home wedding at my parents but could not put together all the details in time. We were suprised and delighted to find such a unique setting existing in Olathe. We were happy with all aspects and would recommend this charming place to everyone. We can not say enough good things about our stay at The Pickering House.", "helpful_votes": "7", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2004-01-15T19:00:00-0500", "location_id": "76791", "id": "1554854", "user": {"username": null, "user_location": {"name": "Lawrence, Kansas", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Pickering House is a treasure!", "url": "https://www.tripadvisor.com/ShowUserReviews-g38954-d76791-r1554833-m11068-Pickering_House_Bed_and_Breakfast-Olathe_Kansas.html#review1554833", "text": "What a wonderful experience! Our wedding this past summer at The Pickering House was everything we had hoped for and more. The owners were not only gracious in accommodating the special little touches that made our weekend wedding so memorable, but helped with all the details so that we could truly enjoy the whole wedding and reception. They helped in so many ways and we are so appreciative. We were grateful that they opened their home to us for our special time. The food was wonderful and our guests are still talking about this \"treasure of Olathe history\". We highly recommend The Pickering House to anyone who desires a comfortable and stress-free wedding. We will definately return on our anniversary!", "helpful_votes": "6", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2004-01-15T19:00:00-0500", "location_id": "76791", "id": "1554833", "user": {"username": null, "user_location": {"name": "Houston, Texas", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": null, "title": "The Pickering House was a major disappointment", "url": "https://www.tripadvisor.com/ShowUserReviews-g38954-d76791-r1534553-m11068-Pickering_House_Bed_and_Breakfast-Olathe_Kansas.html#review1534553", "text": "My husband and I had our outdoor wedding at the Pickering House after seeing beautiful pictures and being assurred of our concerns from the owners who we met at a large bridal fair in Overland Park, KS. There are too many concerns for me to mention them all here. They include that the house and grounds are in need of maintenance (my husband and I visited this B&B in the winter and were told that they would be taking care of several things we noticed then), the owners were horrible about returning phone calls, the \"natural\" backyard included trash and a dead, rotting bird, and I had an allergic reaction after using their dirty hot tub. Also, my husband and I were told that we would have the B&B to ourselves for the night that we stayed there because the owners and their family live in a seperate house on the property. One of the owners kept walking around right near my husband and I's room for long after anyone should have been in the house---creepy! The one plus for the Pickering House is that the food is wonderful. I recommend you choose a different location for your wedding or stay no matter what you are promised!", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2003-12-30T19:00:00-0500", "location_id": "76791", "id": "1534553", "user": {"username": "DelightfulTravlin", "user_location": {"name": "Overland Park, KS", "id": null}}}]}