{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2015-05", "title": "Nice Lunch Spot in Downtown Ontario & Right Inside the Library!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32823-d4636840-r282450253-m11068-Page_One_Cafe-Ontario_California.html#review282450253", "text": "Since my office moved to Ontario, I've eaten there quite a bit and I'm loving it. I've tried to slow down the eating out, but when I want to have something that tastes good in a comfortable setting, I like to hit up Page One. I have to be honest, though.  The main source of my adoration is the caprese salad.  It's not even on the menu anymore, but they still make it!  It's fabulous.  So far, they've had amazing tomatoes and the basil and fresh mozarella are really yummy, but the star is the balsamic vinegar... they have a really nice one and I cannot get enough of that salad!\n\nI've also tried a bagel, chicken salad and a club sandwich and soup.  Everything I've eaten has been tasty.  My lunch buddy has had several sandwiches (also gets the caprese!), including the meatloaf sandwich and she also has enjoyed all of her meals as have other friends I've dragged over there.  One thing that is cool is that in addition to the regular menu, they do seasonal menus for limited times so things can get mixed up. I've treated us to cupcakes as well, which are a yummy treat.\n\nI also love that they have an iced tea selection.  Only bummer is the single size of cup!  I'm a large drink kind of girl and they only have small size.  Boo!\n\nThe staff there is VERY friendly.  It's not fast food and you'll have a little wait, but the food is really worth it.  I haven't disliked a single thing so far. Probably the only negative is it is not cheap. For lunch it can be kind of pricey.  Although they do this afternoon happy hour sort of thing later in the day, maybe around 3-5?  That seems to have some great pricing.\n\nI'll be back again and again!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-06-23T12:44:07-0400", "location_id": "4636840", "id": "282450253", "user": {"username": "ladyjadegd", "user_location": {"name": "Escondido, California", "id": "32358"}}}]}