{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Delicious BBQ!", "url": "https://www.tripadvisor.com/ShowUserReviews-g50825-d11779451-r436696770-m11068-Barabicu_Smokehouse-Parma_Ohio.html#review436696770", "text": "My husband and I happened to be walking the neighborhood when we passed Barabicu. All the folks inside were super friendly and helpful, explaining the options to us. We stopped in at 6:00p.m. They were already out of ribs and the daily sausage, but after eyeing the menu, we had already decided on the beef brisket. We also picked up a small 'smokey greens' and a large 'smoked potato salad'. After returning home, we dug into the greens first. My husband was skeptical but we both liked the bacon-y broth and taste of the greens. The potato salad's best trait was the smokey flavor, followed by the delicious flavor of the dressing. Would have liked those potatoes to be a little more tender. Last, but not least, we LOVED the smokiness of the brisket, the tender meat and especially the smoked edge on the meat. I tried it without the sauces and it was very good. But the flavor profile escalated with the sauces. I poured a little of the 'mustard vinegar sauce' on the meat and dipped each bite into the 'smokehouse sauce.' ....soooo good! They even throw in a piece of (sourdough?) bread with the meat...perfect for wiping up the extra sauces on the plate! A half pound serving of the brisket was just enough for the two of us with no leftovers. Can't wait for out next trip to check out their other options of ribs and the chicken 'cupcakes?'  Oh, and be sure to notice the cool aprons the employees/owners wear!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-12T15:22:43-0500", "location_id": "11779451", "id": "436696770", "user": {"username": "Karen P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Barbecue as it should be.", "url": "https://www.tripadvisor.com/ShowUserReviews-g50825-d11779451-r434242882-m11068-Barabicu_Smokehouse-Parma_Ohio.html#review434242882", "text": "There are two basic elements that define a barbeque restaurant bona fides before the first bite is taken. First, there must be the smell of smoke in the air from the smoker out back (or out front) and secondly, sauces are significant by their absence. Barabicu meets both these criteria. Drive through Parma’s Polish Village and that’s not pierogis you smell. Its good old American hardwood mixed with the slow cooking pork, chicken and brisket that will be served later that day. And if you must, there is sauce available – two to be exact and both very decent representations of their genre – but before you slather and dunk,  do be sure to sample the pitmasters daily effort unadorned. You’ll taste the rubs, spices, smoke and meat – prepared by someone who truly understands the process. This is barbecue –fire, meat and smoke –not a fried something and not dripping in sweet red sauce.\nThese are culinary guys with varied pedigree who have turned their diverse talents toward the ancient art of barbecue. Their breath of talent shows in each protein and side – each stands admirably on its own with Barabicu’s unique touch. There is no theme here, no one is trying to reinvent anything or establish “Polish Barbecue”. It is simply damn good Q prepared and served hot and fresh.\nAnd oh yeah, did I mention the cupcake chicken? Do not, I repeat, do not leave there without at least a couple of these smoky gems in your bag. Certainly not a pastry and not a desert, this is a boned, seasoned, rolled and smoked chicken thigh that is on its way to becoming Barabicu's signature item.\nThe menu is a chalkboard. This is not so much to save on printing costs as it is due to the fact that the offerings change frequently driven by chef imagination. Staples like pulled pork, ribs and brisket are available daily but watch for things like twice smoked bacon to make an appearance as well. Currently they only offer take out making it an ideal stop for lunch or take home for dinner. But don’t delay, they cook enough for each day to ensure freshness and when it’s gone, it’s gone – at least until tomorrow. Yes it is a little lacking in atmosphere, but again, there is no theme here – just honest food, good value and an overall excellent customer experience. This place is the real deal.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-11-03T03:54:50-0400", "location_id": "11779451", "id": "434242882", "user": {"username": "66itcheefeet43", "user_location": {"name": "Perry, Ohio", "id": "50837"}}}]}