{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2016-11", "title": "HORRIBLE EXPERIENCE", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r434383799-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review434383799", "text": "My son and I stayed at hotel for the WICKED musical on Nov 1 and checked out Nov 2 2016. We were not impressed. When checking in the employees didn't have anything on that identified them to working for the hotel. One employee had on a ball cap. He did not tell us what room were in when giving us our keys. We had to go back and ask. Once we got to room there was candy left in room and no not on the bed. It was left in the desk chair in the seat. Only two towels for a double bed room so we had to call for more towels. Later that night when we got back from WICKED I called front desk to ask where the ice machine was ( there was not one on our floor) and if there was any pizza places that delivered. Front desk lady then asked if I had a phone I said yes she then told me to google it and that should help me. Then my son went out that evening he came back to hotel around 3am and couldn't use his key ( and no he wasn't drunk). He went to front desk she came up with him tried there master key it didn't work. They had to call a guy in to fix it. I ended up just letting him in. My son didn't want to have to wake me up. We went down the next morning for continental breakfast which we had to have a ticket for. We waited for someone to take the ticket and another guest said just throw it in the basket. So the hotel had no way of knowing if we were supposed to get free breakfast or not. Breakfast was ok. They had fresh fruit and whole apples. The apples had many visible brown bruises on them which is gross. The furniture in the lobby had several rips in the supposedly leather chairs and the beds were very uncomfortable. I would never stay at this place again. Price of the room for us was 148.00. It was not what we expected. Very disappointed and unprofessional.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, Manager at Mark Twain Hotel, responded to this review", "text": "On behalf of our entire team I apologize that you did not enjoy your stay here at The Mark Twain Hotel. Your business is very important to us and we value your feedback. By telling us what you liked about your stay and how we can improve, you are helping us deliver a superior experience for you and other guests in the future. \n\nWe are perplexed that the above mentioned issues were not brought to our attention when we talked at length in our lobby. Our housekeeping staff and housemen take pride in their job and our property. We do however, take every criticism seriously and conducted a full self-inspection of our property to ensure the highest of quality control. \n\nAgain, we are sorry you did not enjoy your experience at our property. We hope you will come back and see us again soon.\n", "title": "Owner Response", "published_date": "2016-11-04T09:23:42-0400", "id": "434602378"}, "trip_type": "Family", "published_date": "2016-11-03T12:27:03-0400", "location_id": "87958", "id": "434383799", "user": {"username": "Cindy P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Best Place Ever", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r432927836-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review432927836", "text": "Ok so I travel quite a bit for business and have our special hotels that we use for weekend getaways where everyone knows us, but this by far tops them all. I'm not the review type (bad service you just won't see ever again) but this hotel I'd have to say went above and beyond all expectations and beyond their normal level of just average customer service. After driving from Peoria, Bloomington, Champaigne, Decatur Springfield and back to Peoria in one day we were tired hungry and wanting to watch the game.The driver was great took us to the store and dropped us at a local restaurant bar to watch the Cubs game and dropped our stuff off at the front where she was awesome enough to bring it to the room and even put in the fridge to keep the drinks cold!  If I wasn't 3 hours away I would make this my weekend getaway hotel away from Chicago! I will definitely will be staying here for future business trips in this area!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Wow! Thank you for your great feedback!  We take great pride in our hotel and I am pleased to hear that the Mark Twain had everything you were looking for.  If your travels bring you back to Peoria, Il we hope you choose us again!", "title": "Owner Response", "published_date": "2016-11-03T09:47:12-0400", "id": "434336759"}, "trip_type": "Business", "published_date": "2016-10-30T07:28:10-0400", "location_id": "87958", "id": "432927836", "user": {"username": "edmeza", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Not a good experience ", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r432740852-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review432740852", "text": "The room was small and noisy couldn't get comfortable the beds were hard and uncomfortable .had trouble at check-in took forever , still don't know if it was hotwire or the hotel. It wasn't a place that I would go out of my Way To stay in again. The bright spot was the omelet for breakfast delicious ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for your review on Tripadvisor.  We welcome good or bad response as we can use them as a training tool.  We hope that if you are in the area again you will give us a chance to make it up to you.", "title": "Owner Response", "published_date": "2016-11-03T09:42:14-0400", "id": "434335443"}, "trip_type": "Family", "published_date": "2016-10-29T12:26:08-0400", "location_id": "87958", "id": "432740852", "user": {"username": "gwebb765", "user_location": {"name": "Greencastle, Indiana", "id": "37154"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Needs a little  TLC", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r431662038-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review431662038", "text": "Room was very nice albeit a little small. The Bar and dining area need a little TLC, showing a bit of wear.  Breakfast was good. The staff  was friendly and helpful. The parking was free and well lit. Felt safe!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for taking the time to post a review regarding your recent stay with us.  We are happy to hear your feedback and should you return to Peoria, Il we will be happy to accommodate you.", "title": "Owner Response", "published_date": "2016-11-03T09:37:00-0400", "id": "434334135"}, "trip_type": "Couples", "published_date": "2016-10-25T17:42:04-0400", "location_id": "87958", "id": "431662038", "user": {"username": "David T", "user_location": {"name": "Moscow, Russia", "id": "298484"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Not what I expected.", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r431027719-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review431027719", "text": "I called the hotel directly to reserve a room and spoke with a woman with poor customer service skills, as if the call was a bother. She informed me they were booked. I went to the hotel's website and easily booked a room through there. Most of the pictures that are posted by others are accurate but somehow look a little better than in person. The lobby with its dark wood and leather furniture looks rich in the pictures but in real life it looks more dated from the 70's than rich. The hallway and room were deeply scented with some type of cleaner (maybe for the carpets?)that was very unpleasant. The room was especially bad and didnt fade when we opened the door and window. Maybe being close to the river makes things smell musty and they mask it with this overbearing smell. The room was not like the nicer ones that some people's pictures depict (no exposed brick wall). It did look renovated but when you are in the room it is not that nice. The bathroom had a small stand up shower with poor water pressure, no counter space and a tiny pedestal sink. I rarely complain about beds but my boyfriend said one of them felt like there was a he in the middle and was very uncomfortable. The breakfast was downstairs in the restaurant. Pretty standard for a chain breakfast. Two very nice women were making omletts or waffles (one each only). They were fairly good. I have wanted to come here for a while because we stay in Peoria a few times a year but will not be back. It was not expensive but not worth it and would never tolerate the smell again. There is a parking lot in back and a parking garage next door that you enter on the other side of the block. It is close to the downtown and within walking distance of the river and a few restautants. The downtown is very nice in some areas and this is located on one end of the nice area. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "I would like to apologize that we did not meet your expectations. I want to thank you for posting your comments so we know where we can improve and fix. I hope that you would consider staying with us again in the future.", "title": "Owner Response", "published_date": "2016-10-24T04:49:15-0400", "id": "431161557"}, "trip_type": "Family", "published_date": "2016-10-23T15:41:43-0400", "location_id": "87958", "id": "431027719", "user": {"username": "PeppyRN", "user_location": {"name": "Crystal Lake, Illinois", "id": "35860"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Amazing stay!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r430108573-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review430108573", "text": "This is a beautful hotel in downtown Peoria. The room was perfect and clean. The front desk staff was great. We had dinner in their on-site restaurant, as well as free breakfast in the morning. Worth every penny!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "On behalf of all of us here at the Mark Twain Hotel Peoria, Il, I thank you for offering up a review from your recent stay.  I am so glad you enjoyed your stay and we look forward in seeing you again when you are back in Peoria, IL.", "title": "Owner Response", "published_date": "2016-10-24T04:55:20-0400", "id": "431163294"}, "trip_type": "Friends getaway", "published_date": "2016-10-20T11:46:33-0400", "location_id": "87958", "id": "430108573", "user": {"username": "seanathon3", "user_location": {"name": "Washington DC, District of Columbia", "id": "28970"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Not worth the Price", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r429327949-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review429327949", "text": "I have to say the Lobby is nice. And the Bar. But you need comfort in a hotel room. Which is why I have this hotel a 2. Rooms VERY SMALL. Needs updated. Bathroom NO ROOM.  Just pedestal sink. TV. EXTREMELY SMALL!!!  Yes it is clean but that is all the room had going for it. \nFor THE HIGH PRICE THEY CHARGE.  ITS ONLY WORTH $60.00 a night ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "I would like to apologize that we did not meet your expectations. I want to thank you for posting your comments so we know where we can improve and fix. I hope that you would consider staying with us again in the future.", "title": "Owner Response", "published_date": "2016-10-19T06:06:39-0400", "id": "429671520"}, "trip_type": "Family", "published_date": "2016-10-18T08:46:41-0400", "location_id": "87958", "id": "429327949", "user": {"username": "jane and joe c", "user_location": {"name": "Missouri", "id": "28946"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "OKTOBERFEST", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r428835952-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review428835952", "text": "The room we were given this year was a lot smaller and not as nice as last year.   The beds were nice and comfortable.  The bathroom was not as big and it didn't have as many ammenties as the one from the year before.  The hotel was very nice and the staff were very friendly.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you so much for posting a reply!  We so appreciate your feedback.  Thank you for the compliment to the team I will be sure to pass it on.\n\n", "title": "Owner Response", "published_date": "2016-10-19T05:48:40-0400", "id": "429665363"}, "trip_type": "Couples", "published_date": "2016-10-17T11:49:44-0400", "location_id": "87958", "id": "428835952", "user": {"username": "momof262422", "user_location": {"name": "Peoria", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Awesome staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r424405437-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review424405437", "text": "The staff here was friendly, knowledgable and positive. We used the shuttle for a wedding at the zoo and our driver Jay was a great ambassador for the hotel and the city. It's great to stay in places with such positive staff. Breakfast buffet was great, very clean and I loved the personal touches of the boutique hotel. Would definitely stay again and based on Jay's recommendations I would make a point to come back for a visit to Peoria. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for taking the time to tell us of your satisfaction with our accommodations and service during your recent visit at our hotel. We certainly enjoyed having you with us.\n\nWe consider dedicated and competent staff members like Jay our most valuable assets. He was pleased that you acknowledged his efforts.\n\nWe appreciate you patronage and hope you will stay with us at the Mark Twain Hotel the next time you are in Peoria, Illinois. We look forward to your return.\n\nSincerely,\n", "title": "Owner Response", "published_date": "2016-10-03T13:13:41-0400", "id": "424820657"}, "trip_type": "Couples", "published_date": "2016-10-02T08:16:38-0400", "location_id": "87958", "id": "424405437", "user": {"username": "Rita K", "user_location": {"name": "Saint Louis, Missouri", "id": "44881"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Great hotel experience ", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r424228624-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review424228624", "text": "The staff at the Mark Twain Hotel in Peoria are extraordinarily friendly and efficient. The atmosphere is very nostalgic, warm and inviting. With your stay, they include a free drink coupon to the bar and a lovely breakfast in the morning. The breakfast included omelettes made to order, waffles & pancakes, bagels, scrambled eggs, bacon & sausage fruit, etc. It was delicious! They also give you a discount if you have a family member in one of the nearby hospitals. The hotel is only a mile and a half away from St. Francis. The View on the Southside overlooks the river and the bridge. It was a wonderful experience and I would definitely stay there again!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for providing such positive feedback regarding your recent stay at the Mark Twain Peoria, Il.  We are glad to hear that you found our staff extraordinarily friendly and efficient.  We take pride in exceeding our guests expectations and I will be sharing your feedback with my team.", "title": "Owner Response", "published_date": "2016-10-03T13:01:03-0400", "id": "424817221"}, "trip_type": "Family", "published_date": "2016-10-01T16:13:43-0400", "location_id": "87958", "id": "424228624", "user": {"username": "srohrdaus4", "user_location": {"name": "Peru, Illinois", "id": "36544"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Teacher", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r423922200-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review423922200", "text": "Our stay was great. Jay, our shuttle driver was exceptional. He was friendly and informative. He also helped us out with any questions we had about the area. The rest of the staff, including Rebecca at the desk, and Shane in the restaurant, were very professional, friendly and helpful. The room was clean and well turned out. The amenities were also very much appreciated. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "It is always gratifying to know that our performance was effective and appreciated. I am grateful you took the time to let us know of your satisfaction.\n\nI am passing your comments, knowing that it will serve as an inspiration to our staff to continue their efforts.\n\nWe appreciate your patronage and hope you will stay with us at Mark Twain Hotel the next time you are in Peoria, Illinois. We look forward to your return.\n\nSincerely,\n", "title": "Owner Response", "published_date": "2016-10-03T13:17:04-0400", "id": "424821546"}, "trip_type": "Business", "published_date": "2016-09-30T13:16:11-0400", "location_id": "87958", "id": "423922200", "user": {"username": "annepierce", "user_location": {"name": "Champaign-Urbana, Illinois", "id": "3511549"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "great location food price", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r419780952-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review419780952", "text": "my husband and I stayed here during Octoberfest  we had the complimentary cocktail - a craft beer in the 225 restraunt on Sat eve It was a good way to see the restraunt - nice quieter place small combo set up a patio to take your drink   Room was great and ony 3 blocks from the riverside park \nbreakfast Sun am was a full buffer with omletes etc and you could also eat on the patio or in the restraunt we did not bring our dog but this is a pet friedly hotel \nbest place I have stayed in Peoria \nclose to attractions easy to get to and our rate at 129 for a festival Sat was very reasonable", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for posting such kind comments on Trip Advisor regarding your recent stay at the Mark Twain Hotel in Peoria, Il.  We strive to exceed our guests expectations  and I will be sure to pass your complimentary words on to the rest of my team!", "title": "Owner Response", "published_date": "2016-09-22T06:59:25-0400", "id": "421178189"}, "trip_type": "Couples", "published_date": "2016-09-18T06:16:27-0400", "location_id": "87958", "id": "419780952", "user": {"username": "DoctorSally510", "user_location": {"name": "Tuscola, Illinois", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Very nice hotel.", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r417634749-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review417634749", "text": "I came to the Mark Twain hotel as part of a job interview and I had a very nice stay. The staff was very friendly on check in. The lobby was beautifully decorated with very comfortable furniture and an expressive portrait of Twain. The room was impeccably clean, including the bathroom. The bed was large and comfortable. The restaurant Two25 had an excellent breakfast buffet (and the dinner I had there was very good as well).\n\nMy only minor complaint, though not enough to give me a bad experience at all would be the wifi seemed a bit slow at times.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you so much for taking the time to review our hotel, we really appreciate it.  We are so glad that you enjoyed the hotel.  We hope that if your travels brings you back to Peoria, IL that you will stay with us again!", "title": "Owner Response", "published_date": "2016-09-14T06:36:02-0400", "id": "418443592"}, "trip_type": "Business", "published_date": "2016-09-12T14:15:48-0400", "location_id": "87958", "id": "417634749", "user": {"username": "Andrew W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Mark Twain is turning over in his grave", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r417533134-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review417533134", "text": "Very disappointed with stay. Hotel tries VERY hard to impress guests as a 5 star stay, but it really is a 2 star at best.\nCarpet stained, faded & worn. Halls poorly lighted. Windows not sound proof (heard traffic all night long). 5 very small uncomfortable pillows for a king size bed. 1 desk chair for a \"deluxe room,\" meaning NO additional seating other than bed. Lights burnt out in bathroom. Bathroom door didn't even shut.....this list isn't even half of it.\nWe won't go back, nor will be recommending it to people.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "I would like to apologize that we did not meet your expectations.  I want to thank you for posting your comments so we know where we can improve and fix.  I hope that you would consider staying with us again in the future.", "title": "Owner Response", "published_date": "2016-09-22T06:55:03-0400", "id": "421176832"}, "trip_type": "Family", "published_date": "2016-09-12T09:32:53-0400", "location_id": "87958", "id": "417533134", "user": {"username": "Dawn M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Very Nice!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r416453448-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review416453448", "text": "I visited for Blues Fest Weekend!! My Husband and I had an excellent time.  We were very impressed with the friendliness of the staff! Rooms were very clean , breakfast are very clean and excellent food! We loved the river view and nice location everything within walking distance !! Will be booking again next yr !!! Thank you or the wonderful weekend:) ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for taking the time to review us on TripAdvisor.  I am so happy to hear that you enjoyed your stay.  We look forward to seeing you again when you are in Peoria, Il\n\n", "title": "Owner Response", "published_date": "2016-09-14T06:22:22-0400", "id": "418438340"}, "trip_type": "Couples", "published_date": "2016-09-09T05:37:49-0400", "location_id": "87958", "id": "416453448", "user": {"username": "missmichelle21", "user_location": {"name": "Orlando, Florida", "id": "34515"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Old World Hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r415382612-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review415382612", "text": "This property has been acquired by Hilton who has refurbished the hotel in keeping with an old school environment.  Very nice staff!  The rooms had modern conveniences but were fashioned as they may have been several years ago. Very enjoyable stay.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you so much for taking time to post a review.  We appreciate the feedback.  We always want to hear form our guests so we can continue to provide the best experience for our guests.   \n\nThank you again!  We hope you will return to our hotel when you would be traveling to Peoria, Illinois again.\n\nRebecca Siltman\nGeneral Manager\n", "title": "Owner Response", "published_date": "2016-09-07T06:27:05-0400", "id": "415687290"}, "trip_type": "Family", "published_date": "2016-09-06T08:57:06-0400", "location_id": "87958", "id": "415382612", "user": {"username": "Noel S", "user_location": {"name": "Austin, Texas", "id": "30196"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Pleasant Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r415115549-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review415115549", "text": "On first impressions this is a good hotel but there are a few little things that could be done to make it a great hotel.\nOn entering the lobby it is beautiful and you feel you're going to have a welcoming experience but alas no. Not the friendliest receptionist in the world by any means. Not rude but very flat and disinterested in helping. One of those people who talks \"at you\" rather than \"to/with you\", hearing you but not listening. Fortunately most of the other staff I came in contact with later in my stay were not the same. Maybe some training is needed in hospitality. There were complimentary cookies during the day. Unfortunately on my second day they were all burnt on the bottom - but the thought was there.\nRoom - Lovely with great view over the Illinois River. Quite stylish, loved the decorative mirror. Bathroom good size. Discovered the iron and board purely by chance behind a proper mirror. Practically falling apart though. Simple repair job but I'm guessing they simply forget to check for wear and tear.\nBreakfast - Good but rather limited in options on buffet. There was a lovely lady making fresh omelettes or waffles though. I had a waffle one morning which was good but not great. Have had better in hotels where you do it yourself. I guess that is more to do with the waffle batter than anything else.\nDinner Restaurant - Excellent variety and food was great.\nOverall the hotel was very good. They just need to fine tune a few things and it would be wonderful experience.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for providing your feedback on TripAdvisor regarding your recent visit.  It is your feedback that gives us the opportunity to make changes where needed.  It is our goal to exceed all of our guests expectations!  Again, thank you for your feedback.\n\nRebecca Siltman, \nGeneral Manager", "title": "Owner Response", "published_date": "2016-09-06T13:37:57-0400", "id": "415490068"}, "trip_type": "Solo travel", "published_date": "2016-09-05T13:39:32-0400", "location_id": "87958", "id": "415115549", "user": {"username": "Andrew D", "user_location": {"name": "London, United Kingdom", "id": "186338"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Very Nice Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r415113041-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review415113041", "text": "Second year staying at the Mark Twain while in town for a Blues Fest.  As last year, everything was great.  Rooms and public areas are very clean.  Staff very helpful, bar and restaurant were top notch.  We will be back next year.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for taking the time to write a review on Tripadvisor regarding your recent stay at the Mark Twain Peoria, IL.  \n\nWe take great pride trying to exceed all of our guests expectations!  I am happy to hear that all our staff where very helpful and that you enjoyed the bar and restaurant.  \n\nWe look forward to seeing you again!\n\nRebecca Siltman\nGeneral Manager\n\n", "title": "Owner Response", "published_date": "2016-09-06T13:32:48-0400", "id": "415488559"}, "trip_type": "Couples", "published_date": "2016-09-05T13:31:03-0400", "location_id": "87958", "id": "415113041", "user": {"username": "Joann F", "user_location": {"name": "Justice, Illinois", "id": "36190"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Awesome Hotel on riverfront", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r408984614-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review408984614", "text": "Mark Twain Hotel is friendly, clean very clean! And just really nice. Free drink coupons w ur room a nice free hot breakfast w ur room for each person as well! Our studio was just right for us w river view loved it   bar and resteraunt too! Yum", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Thank you for taking the time to fill out a review on TripAdvisor regarding your recent stay at our hotel.\n\nWe very much appreciate and value your feedback and will share it with our team.  Your review responses will serve as encouragement to all of our staff as we strive to continuously improve the quality of our services to provide an exceptional experience for our guests.  It is always a pleasure to receive positive feedback.  \n\nThank you again for sharing your experience, and we hope your next visit will be even more pleasant then the previous one.\n\nSincerely,\nRebecca Siltman\nGeneral Manager", "title": "Owner Response", "published_date": "2016-08-24T05:47:43-0400", "id": "409994448"}, "trip_type": "Couples", "published_date": "2016-08-22T16:16:07-0400", "location_id": "87958", "id": "408984614", "user": {"username": "angowens78", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Boutique bliss", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d87958-r408277726-m11068-Mark_Twain_Hotel-Peoria_Illinois.html#review408277726", "text": "Checked in yesterday for a four night stay. Very courteous staff. Wilma at reception is awesome. Delicious breakfast, fresh, and hot. Room was very clean with an awesome view of the Illinois river and lake. This hotel lives up to the expectation. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Rebecca S, General Manager at Mark Twain Hotel, responded to this review", "text": "Dear Jason,\n\nThank you for your kind comments, and taking the time to write a review on TripAdvisor regarding your recent stay at the Mark Twain Hotel in Peoria, IL.  The kind comments mentioned about Wilma will be passed along.  We take great pride in exceeding our guests expectations! And we are pleased that was accomplished with your recent stay!  We hope that if your travels bring you back to Peoria we hope you choose us again!\n\nKind Regards,\nRebecca Siltman\nGeneral Manager", "title": "Owner Response", "published_date": "2016-08-22T05:16:11-0400", "id": "408670267"}, "trip_type": "Family", "published_date": "2016-08-21T07:16:53-0400", "location_id": "87958", "id": "408277726", "user": {"username": "Jason L", "user_location": {"name": "Fort Collins, Colorado", "id": "33423"}}}]}