{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Amazing ride & bikers👍", "url": "https://www.tripadvisor.com/ShowUserReviews-g31308-d7314020-r373734032-m11068-Wind_Therapy_Rides-Peoria_Arizona.html#review373734032", "text": "Shana & Jim made my day. Their experience, patience and love for what they do is impressive. I took the short ride to White Tanks State Park, every minute was worth it. Hopping on the backseat was easy, Jim took good care of stop signs, street jumps and traffic while I was enjoying Arizona scenery and crowned cacti,  swerving up and down the park's roads was thrilling and therapeutic. I felt like a celebrity escorted by Shana on her bike throughout the ride making sure I was comfortable. These experienced riders provided me with a helmet, paid for the park entrance fees, had cold water and stopped midway at the park's restrooms. You need sun block, wear long sleeves and pants with low heeled boots. My ride was 4-6 pm so it wasn't really hot, but rather nice breezy and cool wind added to such a memorable experience. If you always had an urge to be on a bike but don't have one, nor the endorsement or someone to ride with, these are the bikers with whom you're never strangers even before the ride starts. It was so worth it, short, but Sedona is next! I highly recommend it. Kudos to Shana & Jim.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-05-17T09:09:51-0400", "location_id": "7314020", "id": "373734032", "user": {"username": "TetaSusu", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-03", "title": "Sit back and enjoy the ride", "url": "https://www.tripadvisor.com/ShowUserReviews-g31308-d7314020-r265548441-m11068-Wind_Therapy_Rides-Peoria_Arizona.html#review265548441", "text": "So I had a few days to explore AZ on my own while out west and thought this would be cool to try.  So glad I went through with it!  Shana and Pat were great.  I called before hand to find out what I should wear and who I could ride with and they were nothing but helpful and accommodating. Being alone I was nervous about riding with total strangers out in the desert and once I met them all my worries were gone.  The ride out to the White Tank Mountains was awesome and I would totally recommend this service to anyone who is literally trying to just sit back and just enjoy the view.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-04-13T13:54:40-0400", "location_id": "7314020", "id": "265548441", "user": {"username": "Cristina A", "user_location": {"name": null, "id": null}}}]}