{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "It's  a cook your own steak dinner!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r437744943-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review437744943", "text": "They let you pick out your own steak! Depending on the size cut and meat type, you can go to the grill and cook it yourself! Then you can go to the salad bar and make your own salad! It's a little pricey!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-11-16T03:01:20-0500", "location_id": "2353727", "id": "437744943", "user": {"username": "139mike139", "user_location": {"name": "Peoria, Illinois, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Very good.", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r436695131-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review436695131", "text": "Had the filet, bone in, was excellent. Tomato Basel soup was great. Scallops was cooked a little different, and was a little sweeter than my liking, but no reason not to try the place. Just a taste preference on that. Definitely will return. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-12T15:08:08-0500", "location_id": "2353727", "id": "436695131", "user": {"username": "Nicholas R", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Dinner before play Wicked ", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r432622757-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review432622757", "text": "We chose this resturant based on the reviews and that many famous people were listed on the website.  \n\nIt is in the basement of a building so it is dark and they have worked it into the decor.  It it very large and the wait staff was very friendly and very accommodating.  \n\nIt is a great location walking distance from the Civic Center if in town for an event.  \n\nI had the filet and shrimp.  It was cooked perfectly although a little over priced. The Waitress asked if we wanted to try their garlic bread.  We incorrectly assumed it was bread before dinner and was included.  We were surprised when the bill came and it was $11!  It was good not $11 good. \n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-29T04:38:00-0400", "location_id": "2353727", "id": "432622757", "user": {"username": "Lynn834", "user_location": {"name": "Wilton", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Friday Night 'Date Night' experiance at Jim's - A Peoria standard for years", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r430564822-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review430564822", "text": "My wife and I celebrated her birthday with dinner at Jim's.  It has been several years since we last ate there and nothing has changed decor-wise, it probably hasn't had an update since they moved there in the 80's, but the establishment IS clean and the waitstaff very friendly and thorough.  There was a harpist there and she did a wonderful job entertaining diners with a good selection of music both contemporary and classic.\n\nAfter checking the menu (the steak prices are a bit excessive, $40 and up for a steak?), we opted for the Friday 'Date Night' special for two that costs $59.95 and included a Calamari for Two appetizer, soup or salad (with bread/rolls), 6 ounce Filet or Shrimp Scampi, baked potato or Mosticolli, bottle of wine and Cherries Jubilee prepared tableside for dessert.\n\nWe both ordered the Filet, wife had salad, I had cheese soup, we also had the baked potato and Mosticolli which we shared.  The Calamari appetizer was a generous portion with a tomato based dipping sauce and while my wife is not a Calamari fan, she did comment that it was well-prepared.\n\nWife liked her salad (very generous portion) and my cheese soup was in a large bowl, a little bland but still good.  Bread/rolls were served warm with a cinnamon flavored butter and were delicious. We selected the Merlot wine.\n\nBoth steaks were done properly and had good taste.  The baked potato was huge and even though we shared it we could not finish it.  The Mosticolli was O.K., I'm not a fan of tomato based sauces.\n\nThe Cherries Jubilee was prepared tableside by the staff and was delicious although a more generous portion of ice creme would have made it excellent rather than good.\n\nOverall meal was good, atmosphere good (if you go for formal dining) and the price very reasonable (provided you select the special)  We will definitely return there again and recommend this establishment.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-22T05:36:35-0400", "location_id": "2353727", "id": "430564822", "user": {"username": "Carl H", "user_location": {"name": "Sparland", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Probably best steakhouse in Central IL", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r430282607-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review430282607", "text": "If dry-aged steaks are your game and you have some wiggle room in your budget, you will have no regrets coming downstairs for a steak and drinks at Jim's.\n\nI came with an appetite and ordered the 16oz dry aged NY Strip cooked medium rare. They aced this steak, served it perfectly. This steak requires absolutely nothing to be put on it. Just sit down, say Grace, eat your steak and be happy.\n\nThis steak has the perfect crispy-and-not-overly-salted outer layer with a tender, juicy, nutty and slightly cheesy flavor on the inside. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-10-21T05:42:26-0400", "location_id": "2353727", "id": "430282607", "user": {"username": "retacSBoy", "user_location": {"name": "Carol Stream, Illinois", "id": "35772"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Very disappointed with food and presentation", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r425668627-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review425668627", "text": "We walked in on a Sat, night without a reservation and were a little surprised to find that the restaurant was not very crowded.  The decor is kind of dark, formal and a little dated but the restaurant seemed clean.\n\nThe hostess (who was about 15 feet away) pointed to a table across the room and said \"How about that one?\"  We said fine and paused thinking she would grab some menus and lead us over.  Wrong. It became clear that a \"Seat Yourself\" sign would have been appropriate.\n\nA server did bring some menus.  The by-the-glass wine list was pretty decent and we ordered a couple of glasses.\n\nWe started with salads.  My wife got hers with Blue Cheese dressing.  When it arrived, we both gasped.  The dressing was layered so thickly across the bowl that the salad itself was practically invisible.  It looked like a dish of spackling paste.  Mine was floating in dressing (Italian I think) and was pretty soggy.\n\nOn to the steaks.  I ordered mine medium rare and it came out raw.  My wife like hers butterflied and medium-well.  It came out very rare.  Both went back to the kitchen.  Mine came back and it was fine. My wife's had to go back a second time.  I know a lot of chefs don't like to cook a steak anything close to well or medium-well and that's fine but if you agree to do it, it shouldn't take two attempts.\n\nOur baked potatoes were huge.  When my wife asked for some more sour creme, the server brought her a cereal bowl full.  The potatoes were cooked perfectly and were the best part of the meal.\n\nWe did not order dessert.\n\nOverall, we were very disappointed.  Given the other reviews on TA, maybe we just caught them on a bad night.  Unfortunately, it was bad enough that we won't go back.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-06T12:13:23-0400", "location_id": "2353727", "id": "425668627", "user": {"username": "Bill M", "user_location": {"name": "Frederick, Maryland", "id": "60903"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Neiborhood Gem", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r421562005-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review421562005", "text": "This is a little hard to find, but well worth it.  Look on the corner for the Janssen Building and then take the elevator down.  We were here for the noon buffet for under $12 each.  I was not even charged for my ice tea which never went empty.  The tables had white table cloths.  I had the spinach pork loin and the lemon catfish.  My wife had the chicken.  There were more meat selections.  There was an excellent selection of salads.  The dessert table was fantastic.  I believe they had six varieties of pies and chocolate mousse.  My wife got the chocolate mousse so she could put whip cream on her pecan pie.  There was a charge for my wife's coke.  Wish we had this restaurant in our area.  Look in the bar at the autographed guitars and pictures!!", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-23T11:54:29-0400", "location_id": "2353727", "id": "421562005", "user": {"username": "Wheels282", "user_location": {"name": "Noblesville, Indiana", "id": "37389"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Special Exhibits", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r417661640-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review417661640", "text": "Take the extra time to enjoy our local museum--it is as good as any we've visited in Chicago or St. Louis!!", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-09-12T15:49:55-0400", "location_id": "2353727", "id": "417661640", "user": {"username": "Danny S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "The finest dining available in Peoria!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r417659679-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review417659679", "text": "Jim's Steakhouse is easily the finest restaurant's in Peoria. While casual corporate restaurants and fast food dominate the mainstream of American fare, Jim's is the place to go when you want classy. If you're planning to propose, you want Jim's. If you really want to impress someone, you want Jim's. If a famous musician is in town, there's a good chase they'll be eating at Jim's.\n\nThe atmosphere is elegant as its adorned with dark hardwood, frosted glass, live harp music, and excellent service (especially the bus boy). Later in the evening the harpist is traded in for a piano player where you can make a special request to hear your favorite tune.\n\nMy wife and I have eaten steak and many restaurants and Jim's in hands-down the best. I would put it on-par with any of the best in New York City or Chicago! They have aged beef, and that makes all the difference in the world if you're in search of the best flavor available.\n\nIt's hard to believe, but Jim's actually has a very reasonably priced steak when compared to other local restaurants including Alexander's Steakhouse or Lariat Club, yet significantly better tasting and more elegant.\n\nWhile it's not (entirely necessary), you should dress-up if you plan on eating in the dining room. Not even so much for the sake of the restaurant, but for the other patrons. However, if you're not too dressed up and want to eat there, the bar is certainly casual and they serve food there as well.\n\nI suggest ordering a Caesar Salad, where they will hand make the salad -- including dressing -- on a special table that's carted to-and-from your table. It's around $12-15, and well worth the experience (if only you try it once). This sort of thing is \"old school\" and some may want to see this for their first time.\n\nJim's is perfect for romantic engagements, anniversaries, or birthdays!", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-12T15:45:02-0400", "location_id": "2353727", "id": "417659679", "user": {"username": "ericpollitt", "user_location": {"name": "Peoria, Illinois", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Wonderful Meal", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r413472576-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review413472576", "text": "If there are 7 better restaurants in Peoria, then Peoria is the mecca of the Midwest of culinary experiences.  \n\nWasn't expecting much when we walked in as the dinning room was empty at 630.  Granted it was a Wednesday, but I was still surprised.  It was all uphill from there.\n\nFrench Onion soup was very good and it was the worst thing I had.   My dining partner had the Cesar Salad.  They made it right at the table from scratch.  Thought this was a nice touch.  He also had the Smoked Pork chop and it was very good.  A little brown sugar and pineapple to top it off\n\nI had the House salad and they had a incredible blue cheese dressing that had a very good garlic flavor.  I also had the chopped sirloin steak.  Only $15 for this monster that was wrapped in bacon and topped with a blue cheese sauce and grilled  onions.  It was very very good.\n\nThe best think I had was the creamed spinach.  Best I have ever had.  Creamy, lots of spinach and a great portion.  \n\nI can't recommend this place enough.  I like to try new places when I travel, but it will be hard for me not to go there again.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-09-01T04:50:13-0400", "location_id": "2353727", "id": "413472576", "user": {"username": "dukeebear", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Everything Perfect Except Steak", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r411390422-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review411390422", "text": "We love Jims Steak House, and anytime we want a great meal we think Jims is the place to go.  Parking was easy, no waiting the night we were there.  Our waitress was very nice, service was perfect, and the support staff was amazing as they kept our drinks full.   The delivery timing of the amazingly delicious calamari, the great salads and the meal was perfect !   The steak this time was just not very good.  We both were disappointed in the quality of the steak.  This is the first visit to Jims that we were ever let down with the quality.   Please give Jims a try, as I am sure we will return to give them another chance.  The setting is amazing in a romantic dim light environment with cloth table cloths and I must emphasize the amazingly great service.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-27T05:36:39-0400", "location_id": "2353727", "id": "411390422", "user": {"username": "Vacationer9898", "user_location": {"name": "ILLINOIS", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Business Meeting", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r410607275-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review410607275", "text": "I met with customers at Jim's to get caught up and had a great time.  The food was very good and the service was as well.  I had the halibut, but everyone else had the bone in ribeye, and it was all good.  The cocktails at the bar were excellent and a nice way to start the night.  Check it out when you are in town.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-08-25T07:41:48-0400", "location_id": "2353727", "id": "410607275", "user": {"username": "wheatonnitz", "user_location": {"name": "Chicago", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Always an excellent experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r409084299-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review409084299", "text": "I have been going to Jim's for years and unfortunately, it has been way too long since I have been there last. I have never once had a bad experience or bad meal at Jim's and this time, was no exception. We settled into the so comfortable leather chairs at our table. Our service was very prompt and efficient. A glass of wine and a couple of ribeyes later.....heaven. The steaks were melt in your mouth. They were cooked to perfection with just the right amount of char. The potatoes were enormous and well dressed. The salad very large, cold, fresh, and crispy. A real treat. So many restaurant salads are just seemingly thrown together and taste \"bagged\". Not these. Delicious. I hope I can go back very soon!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-22T21:30:39-0400", "location_id": "2353727", "id": "409084299", "user": {"username": "sarah k", "user_location": {"name": "illinois", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Nice lunch buffet", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r406818510-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review406818510", "text": "The lunch buffet today included beef tips, sliced roast beef, sliced polish sausage, chicken with spinach, Cobb Salad, Greek salad with hearts of palm, tuna salad, chicken salad, she crab soup, dinner rolls and crackers. The dessert table had 2 or 3 kinds of cake, apple, cherry, coconut cream and chocolate mousse pies and three puddings. The drink is included for $12.95. The lunch was good and the atmosphere and wait staff are great. The dinners are much better but this was still very enjoyable.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-17T16:04:35-0400", "location_id": "2353727", "id": "406818510", "user": {"username": "MarthaIllinois", "user_location": {"name": "Peoria, IL", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "A+ All the way!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r404123742-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review404123742", "text": "After searching top restaurants in Peoria on Trip advisor we decided to try Jims Steakhouse. I printed the coupon off of their website, small steak and 2 prawns. WOW!  The prawns were great, approximately 5-6 bites on each and the steak, cooked Pittsburgh style by request, was melt in your mouth deliciousness! The ambiance is super and they had a lady playing the harp. We had plans to go to a play so we had to leave but this is definitely a restaurant that you could relax with an after dinner drink. Treat yourself!! A little pricey if you don't use the coupon but worth every bite! We had to walk away from food due to the portion size.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-11T07:52:13-0400", "location_id": "2353727", "id": "404123742", "user": {"username": "dh64", "user_location": {"name": "Springfield,IL", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "A Great Steak.  But The Drunks At The Table Near Me...", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r404067105-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review404067105", "text": "I may be old fashioned, but when I am spending $70 or $80 per person for a meal, I want a \"fine dining\" experience.\n\nJim's is located in downtown Peoria.  It's on the lower level of a building.  Dark wood paneling, elegant setting.  Looks a lot like a private club.\n\nBar service was good, and the wine by the glass selection more than adequate.  Salad course was fine, and the filet was truly one of the finest cuts of beer I have ever had.  That's saying something, since I'm from Chicago and have tried a lot of our great steakhouses here.\n\nThe rice side was a disappointment.  Bland and tasted like something that came from a box.\n\nBut my biggest concern was the noise.  Several times during the evening, my server literally had to lean over and talk right into my ear.  There was a table of eight several tables away, and they were well into their fourth or fifth round of drinks.  And unbelievable loud.  Screaming!  I mentioned this to the server several times, but nothing changed.\n\nIt's hard to enjoy a meal -- and feel that you got your money's worth -- when you are constantly jarred by a crowd that's more appropriate to a sports bar than a fine dining establishment.  I can't understand why the host didn't do something about this.\n\nSo, four stars for the steak.  Two stars for the dining experience.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-08-11T05:38:05-0400", "location_id": "2353727", "id": "404067105", "user": {"username": "Smudgecats", "user_location": {"name": "Chicago", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-08", "title": "Sim Ghost", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r401770251-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review401770251", "text": "This place sucks! the food was so blend and the place was so dark I can't see what I was eating. BTW, not very friendly staff.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-05T09:59:14-0400", "location_id": "2353727", "id": "401770251", "user": {"username": "Jovy L", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Small buffet with big flavor.", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r397421387-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review397421387", "text": "Fresh and delicious. 3 different pies and other options for dessert. Meat, fish and pasta choices. Two choices leafy salad.Quiet atmosphere. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2016-07-26T06:31:50-0400", "location_id": "2353727", "id": "397421387", "user": {"username": "Cindlr", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Jim's Revisited-still the best !!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r396411387-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review396411387", "text": "Atmosphere: unique (piano player or harpist) always there Friday and  Saturday.\nMood lighting, fine art on the walls, quality food and service. \nA special restaurant for special occasions.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-24T16:49:52-0400", "location_id": "2353727", "id": "396411387", "user": {"username": "DBLasaine", "user_location": {"name": "Peoria", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Only place open on Sunday night", "url": "https://www.tripadvisor.com/ShowUserReviews-g36538-d2353727-r391571038-m11068-Jim_s_Steakhouse-Peoria_Illinois.html#review391571038", "text": "We were visiting and staying in a downtown hotel. When we went looking for somewhere for dinner nothing was open but Jim's. We were pleasantly surprised with the restaurant that served a good selection of steaks and seafood. Prices were reasonable.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-11T18:45:57-0400", "location_id": "2353727", "id": "391571038", "user": {"username": "Bruce_and_Valerie", "user_location": {"name": "Eden Prairie, Minnesota", "id": "43028"}}}]}