{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "A Journey to the Great Restaurants Era", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r437239330-m11068-Dal_Rae-Pico_Rivera_California.html#review437239330", "text": "Fabulous Food, Ambiance and Service. For my wife's 75th birthday, we chose a Great Restaurant from our past to dine in elegance. The Dal Rae is the epitome of dining elegance.  The valet took over our car on arrival and we entered into the Walnut paneled inner sanctum.  The Hostess immediately seated us at our rich leather booth and the Maitre'd welcomed us to the Dal Rae.  The Wait Staff was all dressed in black and white and our waitress arrived in seconds with a delicious relish tray and bread selection.  She explained the menu and took our drink orders.  When she returned with our drinks, we asked a few questions about the menu selections, and my wife chose the Signature Peppered Steak  while I selected the Chilean Sea Bass.  For starters, we selected the \"Original Caesar Salad\", which was prepared at our table by the Matre'd.  Nectar of the Gods.  The Waitress kept track of our progress on the salad and placed our order to arrive at the perfect temperature along with our baked potatoes and asparagus.  On completing our dinner, we ordered coffee and it arrived with an outstanding Lemon Cake with Lemon Frosting and a birthday candle.   \nThe flavor of our entrees and our remarkable celebration still linger after a week from dining.  A truly memorable evening.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-14T15:09:36-0500", "location_id": "341595", "id": "437239330", "user": {"username": "Grandpagolf1", "user_location": {"name": "Mission Viejo, CA", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Love the atmosphere", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r435726430-m11068-Dal_Rae-Pico_Rivera_California.html#review435726430", "text": "Went there with my family to celebrate my birthday. This is my favorite place for fine dining. It's great! The food is wonderful and the service is OLD SCHOOL. So nice being treated like royalty here. I definitely recommend to all...although it is pricey. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-11-08T17:19:55-0500", "location_id": "341595", "id": "435726430", "user": {"username": "Lilaliez", "user_location": {"name": "Whittier, California", "id": "33268"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Great dining experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r430319071-m11068-Dal_Rae-Pico_Rivera_California.html#review430319071", "text": "Always a good dining experience we go there to celebrate special events in our life's\nService and food always excellent.  The decor takes you back in time to the 50 - 60's.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-21T07:46:15-0400", "location_id": "341595", "id": "430319071", "user": {"username": "Linda S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-12", "title": "Impeccable Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r430186811-m11068-Dal_Rae-Pico_Rivera_California.html#review430186811", "text": "Came here for the Lobster but was blown away by the service and attention to detail.   I also come here for drinks after work and they have a great bar and they really know how to make drinks. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-20T20:46:55-0400", "location_id": "341595", "id": "430186811", "user": {"username": "Jorge M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Old time Steakhouse..", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r427451213-m11068-Dal_Rae-Pico_Rivera_California.html#review427451213", "text": "It is my birthday tradition.. OLD style steakhouse... and this one did not disappoint. I that been a round for 50 + years.. .and it deserves to be.  Great steaks.. but great apps.. and dessert ... and of course wine.. and service.. .just a fabulous old school experience.. .", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-12T18:19:02-0400", "location_id": "341595", "id": "427451213", "user": {"username": "Jerry P", "user_location": {"name": "Culver City, California", "id": "32272"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Amazing ", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r426561730-m11068-Dal_Rae-Pico_Rivera_California.html#review426561730", "text": "Food was fantastic had our server was very attentive and made sure we were well accommodated friendly and well mannered belive me that goes a long way in my book ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-10T00:36:15-0400", "location_id": "341595", "id": "426561730", "user": {"username": "lissasanrs", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "One of the last remaining \"continental\" restaurants", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r421519294-m11068-Dal_Rae-Pico_Rivera_California.html#review421519294", "text": "If you are nostalgic like me for the old-school \"continental cuisine\" restaurants of the 50s and 60s (or are too young to remember but want to experience it), Dal Rae is one of the last remaining restaurants of its kind in Southern California. It is definitely a \"special occasion\" restaurant in regards to the style of food, prices, etc., but the prices are fair (I have spend as much and often more at other high-end restaurants).\n\nWe last dined at Dal Rae for our anniversary in July 2016. As another reviewer mentioned, reservations are essential. A couple of slightly sourer notes when we first arrived. We intentionally arrived 30 minutes prior to our reservation so that we could enjoy a cocktail in the bar (a Martini or Manhattan is a good cocktail choice befitting the ambiance). We checked in at the front desk and told them we were early so that we could have a drink in the bar. We were handed one of those beep and light up things like you might get at a mid-level chain restaurant that doesn't take reservations. You know what I mean - you go to PF Changs, put your name in, and they hand you the device - when it goes off, your table is ready. I don't mind the devices in that situation, but it seemed really weird at a restaurant like Dal Rae when we already had reservations.\n\nThe second off note was that, just moments after we sat down in the bar (still roughly 30 minutes until our reservation), the device went off. When my husband went to the front desk to mention that our reservation wasn't for 30 minutes, the woman at the front desk was rather curt and told him \" you requested a booth and one is available now - if you don't take it, you'll have to take a regular table or wait longer after your reservation time until another booth is available.\" As this was our anniversary, we really wanted to stick with the plan - drink in the bar, a leather booth for dinner - so we said we'd wait until the next booth was available.\n\nAs it turned out, I think we waited in the bar roughly 30 minutes after our original reservation time, but that was OK. When our buzzer went off again and we went to the front desk, the woman was much more pleasant and apologized for the wait. We were seated in a lovely booth, and the rest of the evening went well.\n\nWe wanted the true \"old school\" experience, so we planned our dinner accordingly. We started with Oysters Rockefeller, followed by tableside Caesar Salad and Chateaubriand for two. Warning - depending on the location of your table and how crowded it is, \"tableside\" items (such as the Caesar Salad and Chateaubriand) are sometimes prepared away from your table, out of sight (such as in the bar) - which, while the food still tastes just as good, doesn't give you the fun experience of watching the preparation. Make sure you ask when ordering a tableside item if it will truly be tableside.\n\nAll of the food was wonderful. We made sure that the Caesar Salad and Chateaubriand would both be truly tableside. The Caesar Salad was especially good - most Caesar Salads that you get these days, even in high end restaurants, used pre-made dressing that just aren't as good. The Caesar Salad at Dal Rae is completely from scratch - coddled egg, anchovy paste, parmesan, garlic, olive oil - the entire dressing is made right there in front of you before being tossed with the romaine and croutons.\n\nWith the Chateaubriand, it is carved tableside and then plated along with potatoes and vegetables, and served with Bearnaise Sauce. A nice show, and so good! \n\nWe ended our meal with a Grand Marnier Souffle, served with creme anglaise - again, one of those items you don't see much anymore, but one of our favorites. It was the perfect end to our dinner.\n\nWith the exception of the initial curtness of the front desk woman, service was impeccable. Friendly but not overly-friendly (I hate the recent trend of servers trying to act like your best friend), professional - everything you'd want in a fine dining restaurant.\n\nI love Dal Rae and hope it sticks around for another 50 years.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-23T09:35:11-0400", "location_id": "341595", "id": "421519294", "user": {"username": "Lynda V", "user_location": {"name": "Long Beach, California", "id": "32648"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Step back in time to a REAL Old School restaurant with Amazing Food", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r411888502-m11068-Dal_Rae-Pico_Rivera_California.html#review411888502", "text": "Had a friend take us here for dinner. Hidden away in Pico Rivera.  When you first walk in the place is very busy. Must have reservations.  Very friendly staff and one of the owners (brothers) is walking around and greeting tables AND does some of the cooking, for Steak Diane. Once you sit down they bring you a wonderful Relish Tray- cannot remember when I had seen that last- and some bread. I ordered the New York Pepper Steak with baked potato. I like my steak med-well, which usually makes it a bit tougher- but not here- tender as can be and cooked to perfection!!  I mentioned to our waiter that with an old school restaurant, I was surprised to see they did not have Steak Tartare. To my surprise, he said they did- it is just not on the menu. You can get it as a side or as an entree. That one is for next time. Also split a Caesar Salad, which they make on a cart at your table. Again, real old school and fantastic.  Everyone's dinner, from the filet mignon and lobster tail was perfect in every way. The place is a bit pricey but well worth every penny-even if not just for the experience.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-28T09:14:49-0400", "location_id": "341595", "id": "411888502", "user": {"username": "Jeff S", "user_location": {"name": "Huntington Beach, California", "id": "32513"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Enjoyable dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r411469096-m11068-Dal_Rae-Pico_Rivera_California.html#review411469096", "text": "Nice ambiance with excellent steak and fish. I was not aware of the split dish charge, but was satisfied with the dinner. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-27T08:43:48-0400", "location_id": "341595", "id": "411469096", "user": {"username": "epicure5", "user_location": {"name": "Salt Lake City, Utah", "id": "60922"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-06", "title": "So disappointed", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r404511056-m11068-Dal_Rae-Pico_Rivera_California.html#review404511056", "text": "When we lived in Los Angeles, Dal Rae was one of our special-occasion favorites.  Returning for a visit in June, I made a reservation 5 days in advance for a special trip to Dal Rae to celebrate several family events.  \n\nWhen we got there, we were not seated in the main dining room but in an 'overflow' room at the back. I asked to be seated in the main dining room, but was told in no uncertain terms that we would have to wait for 90 minutes for a table in there. There was no atmosphere at all in the back room, and the service was mediocre, not at all what we expected based on previous experience.  \n\nOnce seated, things did not improve. We had two different waitresses serving our table, and as a result service was slow and we had to ask for things such as additional drinks several times. Dal Rae is known for their complimentary pickle selection, but despite a request for more. only one small bowl was provided for a party of six. Then an order of duck was so poorly prepared that it had to be sent back and replaced.  While we were not charged for it, five of our group had finished their meals before the sixth even arrived.\n\nAll in all, this was a disappointing experience.  Dal Rae is an expensive restaurant, and one expects much better.  I don't think we will be returning...", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-12T06:19:11-0400", "location_id": "341595", "id": "404511056", "user": {"username": "SandJinLA2011", "user_location": {"name": "Houston, Texas", "id": "56003"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "A Fine Dining Throwback", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r398164320-m11068-Dal_Rae-Pico_Rivera_California.html#review398164320", "text": "I love this place.  The best steaks and seafood in the area.  Great ambiance, always clean, with great service and prices.  A hidden gem in an otherwise food wasteland.  My personal favorites are the Sea Bass ala Ben (a house specialty) and the Poorman's Pepper Steak.  It's a ground sirloin \"football\" shaped meal topped as the higher priced Filet and New York Pepper Steaks.  Mmmm.  \n\nGreat wine list too. \n\nOne more comment on the ambiance.  This is the type of place three martini lunches took place back in the 60s, and if you go for lunch, you'll find they never went out of style here.  Enjoy!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-07-27T14:38:50-0400", "location_id": "341595", "id": "398164320", "user": {"username": "Dan S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-11", "title": "Dal Rae", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r397375300-m11068-Dal_Rae-Pico_Rivera_California.html#review397375300", "text": "1950s style upscale restaurant. Excellent food and service, elegant table. Prices high but reasonable for quality. Full bar. Valet parking. Ambience reminds one of boom times affluence and executives, attorneys, the country club set, post WW2. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-07-26T05:23:37-0400", "location_id": "341595", "id": "397375300", "user": {"username": "chascarrillo", "user_location": {"name": "Whittier, California", "id": "33268"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Who knew this restaurant was so great?", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r388560955-m11068-Dal_Rae-Pico_Rivera_California.html#review388560955", "text": "My friends of been talking about this restaurant for many years and I finally gave it a try. I would actually put the food on the same level as Ruth Chris or Morton's. \n\nThe filet mignon was wonderful, as was the sea bass,  grilled scallops for an appetizer,  and of course we tried the flaming bananas flambé for dessert.   Another specialty was their cottage fries it was like a scallop potato baked in a pan served like a pizza and each person had one wedge of the potatoes. Give it a try but allow 35 minutes for them to make it so order right away\n\nTheir wine selection was very good and service was top-notch. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-07-02T16:09:07-0400", "location_id": "341595", "id": "388560955", "user": {"username": "swimdiva", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Must have money", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r386768148-m11068-Dal_Rae-Pico_Rivera_California.html#review386768148", "text": "Great food place brought me back to the 20's. Drinks are unbalivable, the service is awesome. It a must try👍🏼👍🏼", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-06-27T18:05:24-0400", "location_id": "341595", "id": "386768148", "user": {"username": "Elena G", "user_location": {"name": "Pico Rivera, California", "id": "32879"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Excellent", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r386459438-m11068-Dal_Rae-Pico_Rivera_California.html#review386459438", "text": "Maria and I first met here, and a year later we returned to celebrate our anniversary.  As was the case a year ago, the restaurant is a destination unto itself. The ambiance is impressive, the food is excellent, and the service is superb.  The attentiveness begins with the valet parking, and that attention continues throughout.  \nThis is the place to come for your special occasion.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-27T08:08:33-0400", "location_id": "341595", "id": "386459438", "user": {"username": "Charles V", "user_location": {"name": "Los Alamitos, California", "id": "32651"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "5 STAR RESTAURANT WHERE YOU WOULD NEVER EXPECT TO FIND ONE", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r382612323-m11068-Dal_Rae-Pico_Rivera_California.html#review382612323", "text": "The building and sign are old.  The neighborhood is not up-scale.  One would expect this to be an old neighborhood eatery.  WRONG.  When you walk in, you feel like you are in an old fashioned, high-end luxury restaurant.  Big plush booths, lots of red decor, rich table cloths, and elegant place settings.  They start you off with a complimentary relish tray (really tasty one) and the menu has everything to satisfy your gourmet appetite.  All impeccably served, and all with tastes to melt in your mouth.  Their fillets and peppered steaks are unequaled, and the lobster thermadour is the most delicious dish I have ever had.  Even if you want to just stop in for a romantic drink and listen to the music (sometimes live entertainment) in their cozy bar, you will not be disappointed.  We have been dining here since the early 60's and it is always a treat....even though it is a bit pricy.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-14T16:34:20-0400", "location_id": "341595", "id": "382612323", "user": {"username": "Ron K", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "My sons 16th bday", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r379681604-m11068-Dal_Rae-Pico_Rivera_California.html#review379681604", "text": "I have been going to the Dal Rae for over 20 years. This place never disappoints. From the owner Loren and his brother to Marcy at the front desk they make you feel like family. The food is perfection. The\nPrime rib is a must and never disappoints. The Sea Bass is also another favorite that is amazing. All of their dishes are prepared to perfection. Great restaurant for a date, family outing , or party. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-04T09:10:26-0400", "location_id": "341595", "id": "379681604", "user": {"username": "jimstravel2016", "user_location": {"name": "Los Alamitos, California", "id": "32651"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "A Hidden Gem in Pico Rivera", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r373496269-m11068-Dal_Rae-Pico_Rivera_California.html#review373496269", "text": "Driving by this restaurant near the corner of Washington Blvd and Rosemead Blvd In Pico Rivera, I never thought the  much of the place with it's old style neon sign and faded exterior paint. I noticed the parking lot was always jam packed and when a vendor came to town I noticed that the yelp reviews were great so we decided to check it out. The quality of the food was great; the caesar salad is prepared table side and they allow for some options on the preparation of the dressing (I don't care for Anchovies). I had the bone in ribeye and my wife got the parmesan and onion crusted salmon. I don't know if they age their own beef but the flavor was great and the meat was tender and cooked to my liking (Medium Rare). Topped with some mushrooms and onions I salted and peppered to my liking, no steak sauce needed. I took a bite of my wife's salmon and it was sumptuous. The parmesan and onions added to the richness that paired well with my house red wine. The price is a bit steep, but my wife and I will be coming back for a few special occasions, I am sure. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-05-16T14:01:36-0400", "location_id": "341595", "id": "373496269", "user": {"username": "Adam F", "user_location": {"name": "West Covina", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "Old School Dining Experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r371609537-m11068-Dal_Rae-Pico_Rivera_California.html#review371609537", "text": "Our family enjoyed a Mother's Day dinner at Dal Rae.  Service is top notch, the booths allow for private conversations and good cheer, and the food is quite good.\n\nNice wine selection, excellent martini menu, classic entrees.  For me, this restaurant is all about the ambiance of old school classic dining. At some point during dinner we enjoyed Frank Sinatra in the background.... I expected Tony Soprano and his crew to walk in at any moment!\n\nPrices are on the high end, but worth it.  Enjoy!\n\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-09T15:56:33-0400", "location_id": "341595", "id": "371609537", "user": {"username": "SuburbanWife", "user_location": {"name": "Lake Oswego, Oregon", "id": "51939"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-02", "title": "A modernized throwback:   continental dining!", "url": "https://www.tripadvisor.com/ShowUserReviews-g32879-d341595-r368466891-m11068-Dal_Rae-Pico_Rivera_California.html#review368466891", "text": "When I was a child growing up in nearby Whittier, the Dal Rae was our go-to restaurant for fine dining.   We knew the menu inside/out, knew the staff by name, and loved being there on weekend nights when a little jazz trio played in the bar.   \n\nIt's a different restaurant now.   Gone are the lobster thermidor and Diamond Jim Brady cut prime rib of my childhood, but still there is the stately ambience of 'Continental Cuisine' and all that might stand for.  Creative food expertly prepared, great cocktails and wine list, attentive service by someone who is making a career out of waiting tables, and a sense that each customer is special.     \n\nAn evening at the Dal Rae is truly a special evening out.  ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-04-28T07:42:33-0400", "location_id": "341595", "id": "368466891", "user": {"username": "UnrepentantFoodie", "user_location": {"name": "Bellingham, Washington", "id": "58350"}}}]}