{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Nice Venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r433982486-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review433982486", "text": "Saw Sleep recently at The Roseland and thought it was an efficiently run venue. I'm used to venues in Detroit, and Detroit concert goers so the politeness of Portland was somewhat of a surprise. People waited in lines at the merch booths and the bars, there wasn't any crowding around. The venue itself is a great place to see a show, and the sound was great this particular night. Bathrooms were clean. If I see another show that doesn't make it to The Great Lakes touring, I would visit this venue again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-11-02T07:24:12-0400", "location_id": "605208", "id": "433982486", "user": {"username": "noxiousburrito", "user_location": {"name": "Ann Arbor, Michigan", "id": "29556"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "My Favorite Portland Venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r387488896-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review387488896", "text": "This is a dark and dank little rock and roll venue, which is why it is the best! Although it is a smaller venue the sound is great and the drinks are strong! They get some of the best music acts no mater what the genre. The staff is great and I always feel safe here! It is one of Portland coolest spots for sure! The food downstairs is yummy too!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-06-29T09:50:28-0400", "location_id": "605208", "id": "387488896", "user": {"username": "Jaime B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Decent Small Venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r382756872-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review382756872", "text": "Came here with a few friends for a show, had a blast. Not the fanciest place in the world but when you're here for a show it doesn't matter! Staff seemed mostly helpful. Would come here again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-15T06:53:07-0400", "location_id": "605208", "id": "382756872", "user": {"username": "arielp1127", "user_location": {"name": "Crescent City, CA", "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-05", "title": "dissapointed", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r378474052-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review378474052", "text": "I actually drove all the way down here from Seattle to see a show I really wanted to see. It was scheduled to start at 9....which was when the opening act started....cool. They lasted 30 minutes....and then they started to play rap club music while they set the stage for the main show? The show I paid to see was Ambient/Electronic music. So I stood and waited patiently among a bunch of drunk couples grinding on each other for about 45 minutes to an hour before the show finally began at about 1030. By that time I had so many drunk people near me that I had to constantly keep pushing off a drunk girl that was trying to lay on me. \n\nThe acoustics were nice and the performance I paid to see was great. But I will most likely never pay or make an effort to see a show in that venue again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-05-31T19:11:50-0400", "location_id": "605208", "id": "378474052", "user": {"username": "Dannie H", "user_location": {"name": "Bellevue, Washington", "id": "58349"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-04", "title": "Hot burlesque action in a period venue", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r372931031-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review372931031", "text": "I see a lot of reviews that refer to the Roseland as being in a bad part of town, and that they felt unsafe.  Perhaps it's my age (mid-50s), but I have been in far worse places than the Roseland to see bands and shows.\n\nIt is what it is--an old-time theatre that now hosts punk shows, rock bands, etc., and the slightly grungy feel of the old girl is part of the experience. Embrace it, Portlanders, and take it in while you can! Too many classic venues have been bought out and gentrified (or torn down altogether).  \n\nWe were there for the Dita von Teese show, and lined up outside for an hour or so before the doors opened. Sure, there was some locals working the line for spare change, but they were more or less polite and orderly (Portland PD were checking out the scene from time to time--I never felt uncomfortable;  probably a bit safer than in Vancouver, BC!)\n\nI wasn't expecting to have to show ID at the door (which we had to do a number of places, even though we were clearly old-ish. Must be some kind of American thing. My date didn't have hers on her, but the security let us through in good humour after I vouched for her.\n\nWe were on the floor, right by the stage for what was an amazing show.  Loved the crowd--very cosmopolitan with goths, LGBT+, young people in '40s dress, old farts...a big crowd, but in a good mood, and a neat cross-section of humanity.\n\nGot some good craft beer at the bar, reasonably priced, and sloshed back to the stage.  Used the bathroom, and sure, it's not like a Starbucks or McDonald's bathroom--but this is a good old-fashioned live venue.  Took me back to the 70s/80s. Take it all in, young people of Portland.  You'd miss it if it's gone!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-14T15:32:36-0400", "location_id": "605208", "id": "372931031", "user": {"username": "postcardwallah", "user_location": {"name": "Victoria, Canada", "id": "154945"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Awesome venue for live music", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r369121919-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review369121919", "text": "This is a great place for a concert. It is not too huge and the sound is fantastic. The upstairs balcony (for 21 and over) has great viewing & sound, and is not too far back. We got front row seats in the balcony for James Bay, and it made for an incredible show. I would love to attend another concert at this venue. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-30T20:34:20-0400", "location_id": "605208", "id": "369121919", "user": {"username": "halterl77", "user_location": {"name": "Bend, Oregon", "id": "51766"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Pretty decent", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r355896029-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review355896029", "text": "Besides all the people that don't know what a bar of soap is, the venue is actually upstairs, which is different. Good parking near by. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-15T19:03:18-0400", "location_id": "605208", "id": "355896029", "user": {"username": "Derick D", "user_location": {"name": "Shelton, Washington", "id": "58739"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "best place for small concert feel", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r351130277-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review351130277", "text": "Only venue I look forward to attending in Portland. I would recommend the upper level (adults only) if you dont want to stand during your show. The drinks are well priced. I have never eaten food here. The best thing about Roseland, you never have a bad seat. Staff was also super helpful last visit.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-02-26T09:33:31-0500", "location_id": "605208", "id": "351130277", "user": {"username": "Jesse B", "user_location": {"name": "Portland OR", "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-12", "title": "Be careful", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r333641837-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review333641837", "text": "I came here for my first event and it was very uncomfortable. The bathrooms were terrifying, the nasty writing all over the stalls, the holes that looked like peep holes were just the cherry topping to it all and it made the whole place even more uncomfortable. Security was a joke, when you enter the theatre you walk through those things like at the airport and it's pathetic. It feels very unsafe there.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-12-17T23:50:38-0500", "location_id": "605208", "id": "333641837", "user": {"username": "Hannah J", "user_location": {"name": "Corvallis, Oregon", "id": "51817"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-08", "title": "Intimate experience!", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r291572331-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review291572331", "text": "I've been coming here since I was in high school (im 43 now) back then it was called the Starry Night, so for me it holds nostalgia. Its not in the best part of town and its a really old building slightly on the divey side,. Once your in you'll find that no matter where you sit you really are up for an intimate experience with your fave bands!. We like to sit in the balcony with most bands because the floor area usually turns into a ginormous mosh pit. They have a huge variety of local and big bands. Tons of bands play there, all different kinds of music from Jackson Browne to Hank 3. There is a bar for all your beverage needs. I would much rather go to the Roseland than a coliseum. So I guess if you can hang with out being a snob and just enjoy the experience you will have a great time.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-07-22T14:48:44-0400", "location_id": "605208", "id": "291572331", "user": {"username": "Aliloohoo", "user_location": {"name": "Salem, Oregon", "id": "52053"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-06", "title": "Rival Sons Live", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r278991501-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review278991501", "text": "My wife and I saw Rival Sons perform here last night. They were fantastic. The venue is a lot like the typical Long Beach rock sites, so the band was comfortable here. They travel the world now, so Portland was as close to our home as they get. The theater was hot, noisy, dark and crowded. We had a great time.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-06-09T07:23:49-0400", "location_id": "605208", "id": "278991501", "user": {"username": "Tapetseb22", "user_location": {"name": "Ashland, Oregon", "id": "29998"}}}, {"lang": "en", "rating": 2, "travel_date": null, "title": "Poor acoustics, poor ventilation", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r251389999-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review251389999", "text": "We felt like cattle being lead into a too small pen for the concert we saw at The Roseland.   Several bands played and the words to only one could be understood...because the audience sang them.   \n\nThe acoustics are so poor that songs melt into noise, hot, loud, uncomfortable noise.    Earplugs helped considerably and a guy near me was nice enough to offer an extra pair to me.    I later noticed lots of people with them in.   \n\nIn the general admission area the heat and humidity quickly became horrible.   It was hot enough that two bands mentioned it on stage.  \n\nThe sad attempts at cooling people down were squirting water from bottles randomly over the audience between sets.  If your were near the stage, you may get a cup of water from security between sets.   It got so warm that people began passing around community cups and water bottles... nasty!\n\nFour acts were on stage for this show, there was a 30 - 45 minute set change between each one. No prior warning to the crowd about the nearly two hours of stand around time for the night.   The stage is so small that one act can't pre-stage their gear.   And unless you have balcony seating, you are on your feet the entire time.    We got in line at 6pm and left the theater after 11pm.   5+ hours of standing.   \n\nWe were nervous more than once during our show.  Bands would encourage the sold-out crowd to jump to their music.   When they did, the floor would noticeably bend under the weight.   It was kinda nerve wracking.   \n\nI can't see us coming back to The Roseland no matter who is playing.   It was not a good concert experience.   ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-01-27T22:44:35-0500", "location_id": "605208", "id": "251389999", "user": {"username": "sp4301", "user_location": {"name": "Medford, Oregon", "id": "51965"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-09", "title": "One of the best places to see Big Bands at a Smaller Venue in Downtown Portland Oregon", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r228368819-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review228368819", "text": "I have been going to this place for years and I am never disappointed !  It was called the Starlight back in the day and big bands have been playing there ever since.  Sure most of the time its smaller local and touring bands but a few times a year someone big plays here because the really big venues in Portland pretty much stink for music (The Rose Garden / Moda Center) so thankfully some big bands play here. Its a small place that has two different spots for music but the main venue is upstairs.  There is a balcony with reserved seats and the FLOOR (My favorite spot)  I can tell you how many times I have been right on the stage feet or inches from the musicians.  No need for binoculars EVER you can see everything which is usually just a blur at some big stadium.\n\nJust some of the names I have seen there over the years.  Rob Zombie, Joe Satriani. Blue Oyster Cult, Lynyrd Skynyrd, Godsmack, George Thorogood, Foghat and more !\n\nI will address the other reviews regarding security.  Yes they are surley, rude and generally unhelpful until you really need them. The last show I was at the mosh pit was forming just behind the first rows of people standing. There was a guy just randomly slamming into people which is pretty normal until until he started picking on the women.  people started pushing him towards the back and the idiot threw a punch.  He missed because he was drunk and next thing you know security had this guy well secured and on his way out which drew cheers from the people in the front.  So go ahead and complain just as I have in the past about their rudeness but we had more fun because security was there.  Just ignore their attitude when you enter and all will be fine.    Oh yeah.  If you have not graduated mosh pit 101 stay on the balcony or well in back on the stage level.  Or dive in and have some wild fun !  Your Choice !\n\nI urge you to support your local bands at clubs like this also !  Lets have some fun !  support Music and the local clubs !  All of them including the Roseland !.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-09-11T15:03:49-0400", "location_id": "605208", "id": "228368819", "user": {"username": "Tom H", "user_location": {"name": "Portland, Oregon", "id": "52024"}}}, {"lang": "en", "rating": 4, "travel_date": "2012-11", "title": "It's a music venue. Not a hotel.", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r178007968-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review178007968", "text": "I spent many a weekend evening at this place growing up. It's a good spacious enough venue for a show and it usually brings in a good crowd of people. I don't really have much to say about the staff. The staff are everything you'd expect from a venue. Indifferent, uncaring and not there to provide customer service. They're there to get you in, get you out, make sure you don't wander around anywhere you're not supposed to be, or act like an idiot. What do you want? A mimosa at the door? Silly.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-09-21T06:23:11-0400", "location_id": "605208", "id": "178007968", "user": {"username": "CaptainAwethume", "user_location": {"name": "Hyattsville, Maryland", "id": "41199"}}}, {"lang": "en", "rating": 2, "travel_date": null, "title": "Sterile & uncomfortable", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r176383732-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review176383732", "text": "Roseland Theater is everything but RocknRoll. A security-check that resembles the ones at airports is only the uncomfortable beginning. Once you're in you can't get out, and the access to the different areas is just riddiculous. Endless queue for the bar area on the balcony floor, pretty much no sound from the show at the downstairs bar. They broadcast a videostream from the stage, but the quality couldnt be poorer. Beers are 6 dollars, you can't take any drinks - including tap water - outside the bar areas. On top of that the tickets are rather expensive. In combination with the poor service, the sterile atmosphere and the annoying structure the Roseland is guaranteed to diminish your concert experience. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2013-09-08T17:23:42-0400", "location_id": "605208", "id": "176383732", "user": {"username": "themeanduck", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2013-04", "title": "Rip off Artist", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r174246102-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review174246102", "text": "I went to my first concert ever at the roseland. Security was very pushy and rude going through the metal detectors and the ticket girl was on a power trip. The girl who stamps hands wasn't doing her job and I didn't get a stamp. During the concert I left the upper bar and no one was on the stair entrance. I went to the lower bar because of the air conditioning. When I went to return to the upper concert hall. The ticket girl that was on a power trip was very rude and demanded my ticket or a stamp. I showed her my ticket,which she took earlier that day. She told me my ticket was no good and I wasn't aloud back into the concert. I never left the building and who knew that to go up and down the stairs you needed a stamp in a small building like the roseland. I went to talk to the manager who was  a big a-hole. When I asked if he was the manager he asked me \" what do you want\" I told him the situation and he talk to the girl and believed her. I couldn't believe it!!! I told him that no one stamp my hand before the concert. I also showed him the date and time of the ticket. It was for the date and time of that concert. Then he said your ticket is bad. Wasn't listening to reason, basically I was consider a con artist. The only good thing out of this was the upper bar girl  saw what was going on and told the manager that I had been in the concert because she had check my ID. Then he got pissed and yelled at me to go. The power trip ticket taker had to get her final thought in as,I walked passed her as I told her not to speak to me. My first and last time at the roseland theater. I won't put money into a place that has unfriendly, unprofessional Staff that will take your money and then try to rip you off.They really need to come up with a better system. Also I tried to contact an owner or corporation for the roseland twice and was never contacted back. Don't Support The Roseland !!  :/", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-08-26T22:53:00-0400", "location_id": "605208", "id": "174246102", "user": {"username": "110Jenna", "user_location": {"name": "Portland", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2013-04", "title": "fire hazard", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r158996934-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review158996934", "text": "shoulda known the place was a dump when I had to walk over people sleeping in the sidewalk and then go thru metal detectors at the front door.  Was excited to see Rodriquez but the sound system was so lousy, I left early.  The place is a dump, smelly, bad acoustics and a fire hazard waiting to happen.  Might be fine for a boxing venue, but music, forget it.  Only good thing was the bar.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2013-04-27T22:53:15-0400", "location_id": "605208", "id": "158996934", "user": {"username": "george s", "user_location": {"name": "Palm Springs, California", "id": "32847"}}}, {"lang": "en", "rating": 2, "travel_date": "2013-04", "title": "Worst Venue yet", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r156618102-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review156618102", "text": "Be prepared for a extensive and thorough search by security before you even  get to will call. Be prepared to potentially be ejected for so much as an aspirin in your purse. The little security girl told me I needed a prescription for some generic naproxen that she kept calling something I'd never heard of. When I argued, she tried to eject me from the premises for quote 'disrespecting her'. Fortunately, her more level headed partner let me through. Be prepared to wait in a very slow beer line and to be sequestered to a dank dirty basement bar. You cannot take your drinks into the show. Be prepared to potentially have your view blocked by floor to ceiling support poles. The sound quality is so-so. I will not return to this theater unless they resurrect Jimis' ghost and I'm pretty sure that'll never happen and if it did, he would never sign on to play the Roseland.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2013-04-04T11:17:53-0400", "location_id": "605208", "id": "156618102", "user": {"username": "Dewbaum", "user_location": {"name": "Portland, Oregon", "id": "52024"}}}, {"lang": "en", "rating": 2, "travel_date": "2013-03", "title": "\"Peter's Room\" theater is poor", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r155523188-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review155523188", "text": "I attended a show in the downstairs theater (\"Peter's Room\") of the Roseland Theater last night.  Although the bands were fine, the theater was a poor experience.  First, I saw that the website said that \"There is also a first class restaurant and bar in Peter’s Room\", so I planned to have dinner there.  When I got there I found they were only serving snacks (e.g. nachos, tater tots, etc.) and pizza.\n\nIn the theater, there was only seating for about 35, though the room had capacity for more if they'd wanted to put out chairs.  The room is essentially divided into quarters.  The stage only takes up half the width of the room (in front of the house-right side).  That's a little weird, but visibility from the front house-left side seems fine if a little angled.  It gets weirder in the back half.  The bar takes up the house-right quarter giving the bartender but no one else a great view of the stage.  The seating back there is on the house-left side, leaving the audience there to look diagonally across the room to the stage through a collection of pillars.  If they'd only swapped the bar and the seating back there (or put the stage in the middle or on the house-left side), it would have been much better for the audience.\n\nOverall, this feels like a barely-making-it theater that can't afford to do much for the customers.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2013-03-24T10:35:13-0400", "location_id": "605208", "id": "155523188", "user": {"username": "Brian234", "user_location": {"name": "Portland, Oregon", "id": "52024"}}}, {"lang": "en", "rating": 5, "travel_date": "2012-12", "title": "MAA Fight", "url": "https://www.tripadvisor.com/ShowUserReviews-g52024-d605208-r147811846-m11068-Roseland_Theater_Grill-Portland_Oregon.html#review147811846", "text": "Ive been to the Roseland twice for Rumble at the Roseland.  Good location, small place so where ever you sit you get a good view of the fights.  General admission means you have to stand the whole time, for $10 more you get assigned seats its the way to go.  Only alcohol bar is at the top.  Pretty packed last time I was there.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2012-12-20T12:19:34-0500", "location_id": "605208", "id": "147811846", "user": {"username": "MagnoliaCapomo", "user_location": {"name": null, "id": null}}}]}