{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2015-06", "title": "Strange & Fun Performance, But more of the Same.", "url": "https://www.tripadvisor.com/ShowUserReviews-g40827-d7694604-r280688705-m11068-Mayo_Street_Arts-Portland_Maine.html#review280688705", "text": "I really DO like Mayo Street Arts performances: they are edgy, strange, odd and fun.  But I think after this one,  I'm done for awhile.  I went recently to see Dark Follies (mostly belly dancing, some story telling, with a street-type musical band, and an excellent hoops dancer).... most with peculiar stage names.   The current performance I'm writing about is for Bread & Puppet Theater, of northeast Vermont.  They've been around for several decades and do story-telling through use of mostly large, grotesque-type puppets, seemingly made of paper mache.  This show, called \"The Situation\" used varying puppets, some worn by the actors, to tell a story about the state of our planet and specifically our U.S. capitalistic economy from a left-wing, disapproving, yet humorous, point of view-  a viewpoint which I share personally.  7 actors did the characterizations, and also each performed in the musical ensemble throughout- which for me, was the best part.   It was mostly adult-themed, yet there were children in the crowded audience (about 130 patrons).  It was poorly edited (long, excruciating wait periods between scenes) with an occasional miking, sound or technical glitch.  I did enjoy it on some level, though my patience ran thin, and I was relieved when it was over, and that they did not provide an intermission.  And it was hot in there.       I like Mayo Street Arts, but think I'm done for awhile, as the type of programming they offer is  less diverse and more of the same.  My favorite recent activity here was in February, when I went square-dancing here with a live fiddle band, and callers.   That was a total blast.  I will, of course, mostly likely go back to Mayo Street, eventually.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-06-16T11:57:34-0400", "location_id": "7694604", "id": "280688705", "user": {"username": "James F", "user_location": {"name": "Portland, Maine", "id": "40827"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-02", "title": "Cool & Welcoming Small Performing/Interactive Arts Center", "url": "https://www.tripadvisor.com/ShowUserReviews-g40827-d7694604-r253079800-m11068-Mayo_Street_Arts-Portland_Maine.html#review253079800", "text": "I've been to Mayo Street Arts a number of times in their short existence.... 3 years?  They have artist studios in this converted small church turned performance arts space.  It consists of a small foyer, box office and main room...  though it appears they are expanding to the upper level to create a small balcony.  This place is accessible to the community, a bit \"crunchy,\" affordable, friendly and low-barrier.  They do some kids' programming and their focus seems to be on the unusual: lots of puppet theaters, dance classes and performance, and musicians and bands from near and far.  \n\nOn this night I signed-up with a friend to attend,  of all things,  Square-dancing.  They began with a clog dancing instruction (though we missed it due a later than expected arrival).  Then we donned our dancin' shoes and the square-dancing began: with two live callers and an eclectic mix of musicians on the small stage, playing Appalachian fiddle music, combining several different instruments.  Pete Winne, of the Tumbling Bones band was an especially good  caller,  though \"John\" was very good in and of his own right.  \n\nAbout 70 peeps showed-up: about 2/3 women (which is what I would have expected from my past square-dancing experience....  nearly 40 years ago...  Yikes !).  But there was definitely bearded handsome male presence, too !  Pete and John provided instruction to the group and were sometimes hard to hear because everyone was having such a good time laughing and socializing....  but it made it hard to hear them despite being \"miked\".  Women and men both were encouraged to dance in either of the traditional \"male\" or \"female\" positions within the square....   like John said:  \"this is 2015-  get over it. \"   The age range of dancers was 20-'s to 60's, with a lot of younger peeps,  especially women, in attendance.  Many had never square-danced before.  We also did some line dancing toward the end.\n\nWhat a fun night this was !   It brought me back to my years square-dancing in the mid-1970's in Andover, MA.  I even wore my \"Twilight Twirlers\" badge I had  kept all these years..... and although a bit rusty,  many of the dance moves 'came back to me' once I got going.  And it was a good aerobic work out to boot.   You can order liquor here, too....  and some generous soul anonymously had Otto pizzas delivered for all to enjoy.  My only critique of the space is  that they need to provide more than only one unisex bathroom,  especially given the size of the crowd on this particular night.  \n\nI love Mayo Street Arts,  and will go back.   I plan to attend some puppet theater \"for adults\" in June, and have already bought my tickets.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-02-07T11:52:10-0500", "location_id": "7694604", "id": "253079800", "user": {"username": "James F", "user_location": {"name": "Portland, Maine", "id": "40827"}}}]}