{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2015-04", "title": "It's a Small Urban Park", "url": "https://www.tripadvisor.com/ShowUserReviews-g40827-d7786446-r267225223-m11068-Lincoln_Park-Portland_Maine.html#review267225223", "text": "Lincoln Park was built after Portland's great July 4, 1866 fire that destroyed most of the downtown area with the intention that it would be a fire break.  It's been decreased in size since the with a 4 lane divided highway that took about a quarter of its original size.  It has a nice late 1800 fountain in the center.  People from the federal and county courthouses which are across the street often eat lunch there.  It was the camping ground for Occupy Portland a couple of years ago.  It's not much to look at but I like it.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-04-21T17:27:51-0400", "location_id": "7786446", "id": "267225223", "user": {"username": "pwdt", "user_location": {"name": "Portland, Maine", "id": "40827"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Historic Park in Portland ", "url": "https://www.tripadvisor.com/ShowUserReviews-g40827-d7786446-r265952644-m11068-Lincoln_Park-Portland_Maine.html#review265952644", "text": "Located in the heart of downtown Portland, is Lincoln Park. Beautiful large shade trees, pathways, and benches...with a large beautiful seasonal fountain in the center of the park. Surrounded by historical buildings...the Federal Courthouse, the County Courthouse and the famous Central Fire Station...Lincoln Park is a diamond in the heart of the city.  Years ago, it was nearly twice the size (now part of Franklin. Arterial) with a large playground and a ball field. Even though it is smaller, Lincoln Park is still a refuge from the hustle and bustle of the city. Local office and city workers can be seen having lunch...as well as mothers and nannies strolling with their charges. Lincoln Park is so peaceful...you will even see birdwatchers here. A very well-maintained city park, where we have sat and walked many times...well worth your time to check it out.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-04-15T16:34:29-0400", "location_id": "7786446", "id": "265952644", "user": {"username": "BeeMelissa", "user_location": {"name": "Portland, Maine", "id": "40827"}}}, {"lang": "en", "rating": 3, "travel_date": "2014-07", "title": "Small Park on Portland's Freedom Trail", "url": "https://www.tripadvisor.com/ShowUserReviews-g40827-d7786446-r258258475-m11068-Lincoln_Park-Portland_Maine.html#review258258475", "text": "This old, 2.5-acre (1 ha) park in Portland’s Government District was at Congress Street, Pearl Street, and Federal Street. Metered parking was nearby. Its best side faced the stately architecture of the Federal Building. Its other sides faced a fire station, a parking lot, and a highway arterial. A rod iron fence surrounded it and paved paths crossed it diagonally in an X. The place had some welcome shade trees and a working granite water fountain (built 1871). The benches on its perimeter sidewalks offered us rest from our trek along Portland’s Freedom Trail. For an urban park, Lincoln was fairly clean and felt quite safe during daytime. We only wished it had more to see and do for those who visited it.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-03-07T09:40:17-0500", "location_id": "7786446", "id": "258258475", "user": {"username": "mainemountainbear", "user_location": {"name": "Portland, Maine", "id": "40827"}}}]}