{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Charming restaurant with nice ambiance", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r433817308-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review433817308", "text": "We visited Vero early on a Friday evening.  Only one other couple dining, however, by the time we left, restaurant was much busier.  Service was rather slow, however, food was very good.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-11-01T18:43:02-0400", "location_id": "3722319", "id": "433817308", "user": {"username": "travelgirl4045", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Be Sure You Have Some Time", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r411402315-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review411402315", "text": "There are some dinners that you have a schedule to keep and others that you don't. If you come to Vero, make sure it's the latter. My wife made reservations for 7:30 pm on a Friday. We arrived 10 minutes early and realized no reservations were needed. \n\nFirst thing I have to say is the staff was very friendly and chipper. Makayla - our server checked in on us just enough. After we ordered drinks, she came back to let me know my wine selection was no longer available. She suggested another and it was very good. When it comes to dinner the menu is limited, which is nice if you don't want to spend a ton of time trying to make a decision.  However it becomes problematic if three of the entrees are not available.   We split the crab cake appetizer, which was good. We both ordered the ginger salmon - very flavorful, presented well and a very generous portion.  If you are a chocolate lover, then the rum cake is for you. \n\nNow to the speed of things. It reminded me of some of the all inclusive resorts we have been to in the past...there is definitely time between the drinks arriving, appetizer, entree and dessert. If you enjoy a leisurely meals with time to spend with your significant other, you will enjoy Vero. If you are someone checking Facebook during your meal - you will probably come away disappointed. Our experience lasted just over two hours. \n\nWill we go back - probably. I just hope that they have all of the entree selections next time - they sound pretty good. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-27T06:06:48-0400", "location_id": "3722319", "id": "411402315", "user": {"username": "Jim B", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Good but could be more organized and better", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r403812948-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review403812948", "text": "Went here the evening of Aug 5, 2016, made a reservation via Internet for 7:15 p.m., no one replied by 6:15 so I called and was given a confirmed reservation for 7:15.  Upon arrival at 7:15 sharp there was not room downstairs so we had to wait in a holding area for about 25 minutes.  Since down stairs was full we were escorted upstairs and seated at a side table.  I asked to be moved to the table that faced the street, 6th. Street and Monument Square.  A fine view of the goings on down below.  The waitress had to go up and down to serve us but she did very well considering the circumstances.  There were no wine samplers for the wines we wanted but we were offered a half glass to try and we agreed this was the wine we wanted.  We ordered our meal which took at least :45 minutes to arrive however, as I say, it was busy downstairs and everything had to be brought up from down below.  I want to add that this was First Friday in Downtown Racine which means many folks head for the central district, thousands in fact, 'twas nice to see downtown hopping and busy.  We were there for over 2 hours but it was nice to just relax and enjoy the food and ambiance.  Bill came to $155.95 plus tip.  A nice if harried evening.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-08-10T13:50:33-0400", "location_id": "3722319", "id": "403812948", "user": {"username": "packersbacker", "user_location": {"name": "Dallas, Texas, U.S.A.", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Amazing experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r394175248-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review394175248", "text": "We stopped in for dinner last week because so many are talking about the recent changes they are making, The staff were very professional and attentive, I believe our server was Michaela. The new General manager even took the time to stop by our table, introduce herself and inquire about our experience. I highly recommend visiting this restaurant. The restaurant offers lunch Tuesday thru Friday and dinner Tuesday thru Saturday. We are hoping to stop in for lunch next week as the lunch menu looked great, See you soon!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-18T23:35:00-0400", "location_id": "3722319", "id": "394175248", "user": {"username": "rockinms", "user_location": {"name": "Lake Geneva, Wisconsin", "id": "60022"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-02", "title": "A surprising serene and luscious restaurant in Downtown Racine", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r345256945-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review345256945", "text": "We had been intending to visit Vero International for either lunch or dinner, but until today, we never had an opportunity. But by having lunch at Vero International today, we discovered an amazingly lovely and intimate restaurant on 6th Street very close to Monument Square. My husband and I shared an order of fried plantains with a wonderful light cocoanut rum sauce and every bite was pure bliss. I then had the Jerk Chicken Wrap served with an order of french fried sweet potatoes. My husband ordered the Vegetarian Eggplant Parmesan. Both of our choices were delicious with portions large enough to take some home. We were well served by Jerry, the manager. The ambiance was subdued and very comfortable with ecclectic decorative touches and a fireplace fitting the Afro-tropical fare. The menu includes Caribbean, African, and specialties of the Islands and the tropics but nothing we ate was too highly seasoned.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-02-05T12:02:33-0500", "location_id": "3722319", "id": "345256945", "user": {"username": "watercolorist", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Vero International needs to focus on there current location", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r333133653-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review333133653", "text": "I visited Vero International for the first time l on a Saturday evening at 7:00 pm with reservations. The restaurant was almost vacant with only two other customers seated as we arrived. We were greeted by the manager who was surprised we had made reservations. Our waiter came and asked for drinks which we ordered.  He came back after a wait and offered the daily specials while explaining that two of the items on a very limited menu were currently not available. Two of the items were one of the entrees that my wife had wanted. So we went back over the menu and specials and decided on other choices. They offered either soup or salad and when I asked about the salad dressings we were told that they only offered one choice. After a quite long wait we received our salads with no bread offering. I asked for some pepper as there was no salt or pepper on the table. They brought me a pepper grinder but it was empty and no offer to grind it for me. I sent the pepper grinder back asking for one with pepper. The salad was OK but with no other choices I thought it was average. Said to have walnuts although I did not get any. After a 15 minute wait after the salad I received my steak special which I ordered medium rare and came well done. I called the busboy  who at this point was doing all the serving, ( I had not seen my waiter for 20 minutes and another server came over and stated that the steak was well done and would order me another. My wife's entrée was there and she was almost done before I received my steak. (Medium rare+ 6 8 minutes). The steak came back fine. I did have to ask for salt which was also not on the table. I asked if they had any bread which they sent three pieces with about a table spoon of butter. I asked for more butter for my potatoes and they brought anther table spoon in a very cute little tray that is small. We ordered crab cake appetizer's which came as three with a dark color and in my opinion no crab. A little greasy and heavy breading. (Not cheap). In our 2 hour meal I saw my waiter twice although he was seated at the bar area. This is not a cheap place where you expect this kind of SERVICE or entree's. Two other couples came in during our experience and the couple next to us ordered only appetizer's after viewing the menu. It is a beautiful place and could be a nice romantic venue if they would update the menu and food and mostly the service. I would not likely return. ", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-12-15T12:58:07-0500", "location_id": "3722319", "id": "333133653", "user": {"username": "Snickman", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-12", "title": "Nice quiet lunch", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r331679184-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review331679184", "text": "My husband and I went out for lunch. What a treat! The food was delicious, I had steak and it was melt in your mouth perfect!! My husband had me try his curry ketchup with sweet potatoes wow it was awesome! I highly recommend it. Nice ambiance.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-12-09T11:26:02-0500", "location_id": "3722319", "id": "331679184", "user": {"username": "Gina P", "user_location": {"name": "racine", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "Great food and atmosphere.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r326727356-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review326727356", "text": "This is a fine dining restaurant for those willing to try new things. It is not large but it is nicely done and the food is always delicious. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-11-14T09:57:58-0500", "location_id": "3722319", "id": "326727356", "user": {"username": "RMonks", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-07", "title": "I've tried and tried....", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r326131292-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review326131292", "text": "I SO want this place to be successful but just not feeling it....the food has been good, not great but good. It's a lovely space. No complaints about the wait staff. But, the time it takes to get a meal is just unacceptable. I've tried dinner and lunch and unless they can figure out how to speed things up I fear they won't last. However, if you've got all the time in the world, go for it. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-11-11T17:40:49-0500", "location_id": "3722319", "id": "326131292", "user": {"username": "Dlm_Racine", "user_location": {"name": "Dlm_Racine", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "terrible management", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r322410208-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review322410208", "text": "This was the first time my wife and I had been herefor dinner service.  The hostess was nice, kind of shy and didn't say much but kind.  We got sat and were poured waters right away and a few moments our waitress greeted us and was very informative.  She offered her suggestions of her favorite app and guests favorite app and informed us of the specials as well. My drink took a while and she came back to the table to tell us that she had forgotten to ring in our drink right away, apologized and that she had informed the manager and that he would be out with it ina short moment.  I appreciated her honesty and didnt mind waiting a minute more.  My drink arrived shortly just like she had said but there was a fly in it and when I brought it to the managers attention he swiped it off the table and didn't say a word and walked away.  Moments later the server came back and apologized again and said she would find out what was going on after i told her he didn't say a word before he left.  My wife and I felt like she kept apologizing for his mistakes and attitude. My wife made a comment and said that our server should be managing..I can't say i don't agree, my wife has been in customer service for a long time.  She was very professional and did her best to comfort us and to ensure we had a pleasent evening.  The food was excellent, service was great but I have a feeling that the manager needs to go through communication and customer service training.  With a manager like that the restaraunt won't last long or succeeed.  We will be back because the food and service was amazing, but hopefully we don't need to see the manager again.      ", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2015-10-27T10:07:18-0400", "location_id": "3722319", "id": "322410208", "user": {"username": "Michael s", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Very nice restaurant", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r321742032-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review321742032", "text": "We were brought here by our inlaws for our anniversary. Food was excellent, i had pumpkin curry soup to start which was one of the best soups ive had. Then i had chicken tikka, which was also excellent. Staff was really attentive and friendly", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-10-25T18:12:27-0400", "location_id": "3722319", "id": "321742032", "user": {"username": "Kevin P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-10", "title": "excellent", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r320533332-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review320533332", "text": "We were invited for a dinner program at Vero International. It was the second time that I have been there. I cannot comment on the prices, as our meals were included in the program, but i can say that the food is excellent! We were given choices of bone in ribeye, salmon, chicken curry, and eggplant parmesan. Im not a big salad eater but I ate every last bit, it was so good, it had mango, pecans and goat cheese with a subtle dressing. The people that had the eggplant parm said it was the best they have ever had. Our ribeyes were done to perfection. Those who had the salmon were equally impressed. Didn't talk to any one who had the chicken.Our 2 choices for dessert were a chocolate rum molten cake with vanilla ice cream and mango cheesecake. Everyone loved desserts! The servers worked very hard. the food was at the right temperatures. The owner came up to talk to us at the end of the meal. He told us that they would be changing the menu over for winter. We all told him we will be back to try his menu!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2015-10-20T18:18:33-0400", "location_id": "3722319", "id": "320533332", "user": {"username": "conphuzer", "user_location": {"name": "wisconsin", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Must visit", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r310317902-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review310317902", "text": "This is my 4th visit and things only get better. My first visit was great except for the heavy hand on the salt. The ambience is superb. The service is friendly and efficient . My most recent visit was dead on. The salad was superb and the filet was one of the best ever. The fried Plantains were off the hook good. I told the server the price was to low for what you get ( she thought I was nuts).  I still don't know why there isn't a line out the door. This place deserves more support from our community!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2015-09-14T15:53:03-0400", "location_id": "3722319", "id": "310317902", "user": {"username": "Patrick O", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Pleasant surprize for racine", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r308897360-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review308897360", "text": "This restaurant should probably be in the 3rd ward of milwaukee. Very classy big city feel, great ambiance, small bar but seperated nicely from dining area. 4 star food quality, great service and very professional staff. Dont miss it!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-09-10T04:23:57-0400", "location_id": "3722319", "id": "308897360", "user": {"username": "jeff v", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "ok food nice bartender", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r302703069-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review302703069", "text": "The food is alright. We found out that the old chef Matthew is gone. It isn't as good with the new chef and new menu. The service is good! We stayed for drinks after dinner our bartender Jonah was nice! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-08-23T21:30:10-0400", "location_id": "3722319", "id": "302703069", "user": {"username": "april c", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 3, "travel_date": "2014-11", "title": "Less than expected:(", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r302686992-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review302686992", "text": "The space was great. It felt like a Milwaukee or Chicago class restaurant with the decor and lighting. The lit up bar was fun and the fireplace in the wall reminded me of Ramsey's Burger joint in Vegas. The flatware and glassware were perfect for the decor. The service was awesome!\n\nI wish the food would have been something exciting to write about but sadly, it was not. I ordered the elk with berry glaze and my wife ordered the special Spinach with palm oil stew. I was not delighted with the food. The meat was really tough in both entrees. The dessert (pumpkin pie topped with streusel ) was really dense and gritty. All of the other aspects of a great restaurant were present except great food. I will say the lollipopped jerk chicken wings were tasty and the purple cauliflower soup was also good. But our entrees were lacking. I will remain open to the idea of another visit because of the potential.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-23T19:01:21-0400", "location_id": "3722319", "id": "302686992", "user": {"username": "Ted B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-10", "title": "Great food.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r301540121-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review301540121", "text": "Wonderful place for a romantic dinner! Loved the Lamb. The grilled zucchini was one of the best dishes I have had. Our waiter was knowledgeable and friendly. We had been at a party at bar close by and the food at the party was terrible. We tried Vero because it was near our parked car. We were so impressed we stayed at the bar after dinner to enjoy an after dinner drink.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-20T09:42:51-0400", "location_id": "3722319", "id": "301540121", "user": {"username": "sweetman473", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-11", "title": "Great place", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r299010425-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review299010425", "text": "Vero has great food and a great atmosphere.  There are other places with similar pricing in Racine, but this is the only place I did not feel I was being overcharged.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-08-13T17:31:51-0400", "location_id": "3722319", "id": "299010425", "user": {"username": "Brian S", "user_location": {"name": "Racine, Wisconsin, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-08", "title": "Terrific Entrées and Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r298952859-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review298952859", "text": "This was my first trip to Vero's at the recommendation of a Racine local.  We were very pleased with the evening's dinner including the service, the food and the atmosphere.  We visited mid-week when the traffic was light and it was easy to carry on a conversation and enjoy the evening.\n\nI had a perfectly prepared veal chop of generous size and the house salad and dressing was perfect.  Others in the party had filets and ribeyes they were very satisfied.\n\nWe will eat here again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-08-13T13:14:06-0400", "location_id": "3722319", "id": "298952859", "user": {"username": "TGNWIUSA", "user_location": {"name": "Racine, Wisconsin", "id": "60218"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-06", "title": "Another Winning Dinning experience at ", "url": "https://www.tripadvisor.com/ShowUserReviews-g60218-d3722319-r277974300-m11068-Vero_International_Cuisine-Racine_Wisconsin.html#review277974300", "text": "From our delicious crab cakes and citrus shrimp appetizers, to our petite filets with roasted cauliflower, to mango cheesecake and Jamaican chocolate rum cake we couldn't stop praising the quality and delicious taste of our food. \n\nBen our server was also excellent. Friendly, attentive and knowledge about the menu. Tonight was another win win at Vero's!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-06-04T19:31:49-0400", "location_id": "3722319", "id": "277974300", "user": {"username": "Lilly L", "user_location": {"name": null, "id": null}}}]}