{"paging": {"total_results": "4", "skipped": "0", "previous": null, "results": "4", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "A General Robert E. Lee Historical Photo Op!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60893-d7147429-r434943529-m11068-Stewart_Lee_House-Richmond_Virginia.html#review434943529", "text": "This was really just a quick photo op with some historical significance. General Robert E. Lee briefly lived here with his family after surrendering at the Appomattox Court House. There are a couple of historical markers at the site to give you some information but a business occupies the building so it is largely off-limits, though I understand tours can possibly be arranged (804.643.2797).\n\nThe building is a fine example of antebellum Richmond architecture and is a must-see for Civil War history buffs. There are photos of The General at the doorway of this very house. We found parking right in front, though we had our hazard lights on (darn tourists). Go see it on your Richmond tour!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-11-05T19:09:01-0400", "location_id": "7147429", "id": "434943529", "user": {"username": "John S", "user_location": {"name": "California", "id": "28926"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "If only you could see \"The Door\" as we once did", "url": "https://www.tripadvisor.com/ShowUserReviews-g60893-d7147429-r327838255-m11068-Stewart_Lee_House-Richmond_Virginia.html#review327838255", "text": "The Stewart-Lee House at 707 East Franklin Street in downtown Richmond, only a short walk from the State Capitol, is where Robert E. Lee's wife lived during the Civil War, the home that Lee returned to after surrendering his Army of Northern Virginia at Appomattox in April, 1865. Years ago, it was a restaurant called Traveler's, in honor of Lee's horse. We dined there and asked only one question: \"Is the door still there?\" The door we were referring to was the back door to the three-story house that was made famous in photographer Matthew Brady's post-war images of Lee and his staff. A few years later, we visited again. The restaurant had been closed but the inhabitants allowed us to enter. \"Is the door still there?\" we asked. \"Yes, it is,\" was the response. They were aware of the connection. Today, the Home Builders Association of Virginia owns the building and the interior has been converted to office space. Tours are available only by appointment. But during our most recent visit, we walked to the back of the house and noticed that, indeed, the door is still there. It is a part of history. Brady's image of Lee sitting or standing in front of the door with or without two staff members is frequently included in books relating to Lee and the Civil War. If you haven't seen it, you're not paying attention. The Greek Revival style brick townhouse was built in 1844. The Lees left the house in June, 1865, and moved to Lexington, Virginia, where Lee assumed a position as President of then Washington University (now Washington and Lee) until his death in 1870. In 1893, the building was given to the Virginia Historical Society and was conveyed to the Confederate Memorial Literary Society in 1961. It was listed on the National Register of Historic Places in 1972. It originally was part of a group of five houses built by tobacco merchant Norman Stewart between 1844 and 1849. The Stewart-Lee house is the solitary survivor of what once was one of Richmond's finest residential blocks. When Stewart died in 1856, he left the building to his nephew John Stewart, who rented it to General George Washington Custis Lee, Robert E. Lee's son, and a group of young Confederate officers, who used the house as a \"bachelor's mess\" until Robert E. Lee's wife and daughters took up residency in 1864. Abraham Lincoln personally ordered a sentry stand on duty in front of the house on a 24-hour-a-day basis as long as Mrs. Lee was in residence. A plaque embedded in the wall on the front of the building, between the first and second floors, notes that the house was used by Lee and his family for a short period of time. The building is a part of history. So are Brady's photographs of the general and \"the door.\"", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-11-19T07:16:05-0500", "location_id": "7147429", "id": "327838255", "user": {"username": "Taylor B", "user_location": {"name": "Chicago, Illinois", "id": "35805"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-04", "title": "Nice Home", "url": "https://www.tripadvisor.com/ShowUserReviews-g60893-d7147429-r279832722-m11068-Stewart_Lee_House-Richmond_Virginia.html#review279832722", "text": "We were doing a walking tour and stopped outside this home and as the people who work there were leaving, they offered to let our group tour it.  Of course we did!  It was really something to think we were inside the home that Robert E. Lee resided in after the Civil War.  ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-06-12T18:35:14-0400", "location_id": "7147429", "id": "279832722", "user": {"username": "Lois42", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2014-10", "title": "Only if you happen to be in the area", "url": "https://www.tripadvisor.com/ShowUserReviews-g60893-d7147429-r234122992-m11068-Stewart_Lee_House-Richmond_Virginia.html#review234122992", "text": "It was recommend that we visit the Stewart-Lee house in Richmond to see the residence of Robert E Lee just after the civil war.  Apparently after Lee surrendered at Appomattox  their actual home called Arlington was confiscated.  So Lee, his wife and daughters moved to this house in April 1865.  This home is the site of several famous photographs of Lee.  \n\nSo this home is interesting to see but it is just a house containing offices.  You can not enter the home even though you may be able to arrange a tour.  Not sure why someone would do this since it has been converted to offices.  Still it is interesting if you happen to be in the area.  I would not make a special trip to see the house.  You stand on the side walk and look at the home…..good for a few minutes as you walk by. \n\nThe Stewart-Lee House has been documented by the National Park Service’s Historic American Buildings Survey.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2014-10-13T07:26:26-0400", "location_id": "7147429", "id": "234122992", "user": {"username": "BCollyer", "user_location": {"name": "Midland, Georgia", "id": "35111"}}}]}