{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Great Mongolian Grill with MANY Gluten Free Options", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r430183114-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review430183114", "text": "I love a good Mongolian Grill.  To me this place was fabulous because of all of the Gluten Free options they offer in their sauces, and even offer a GF noodle. To top it off the server asked if there were any food allergies, to which we responded.  They use a special bowl (blue) to use for allergies, and the cooks clean the grill a little extra and use a fresh set of utensils for your food.  It was reasonably priced at 13.99 for adults.  Great value.  The only thing I saw that could use improvement was the space around the grill stacks up a bit when it gets busy, with no place to really line up the guests while they wait..", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-10-20T20:01:17-0400", "location_id": "1013138", "id": "430183114", "user": {"username": "Randy T", "user_location": {"name": "Gladstone, Missouri, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Healthy, delicious, fast", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r429359934-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review429359934", "text": "I was in Rochester by myself and wanted a fast lunch that wasn't fast food and found this attached to a mall. The food was delicious and the waitstaff very helpful on how to go thru the line and pick your ingredients and sauces. Added bonus I haven't seen at other Mongolian restaurants, they had every ingredients calorie count listed (and more info that I didn't pay attention to), even the sauces which did help make up my mind on which ones to take. I had a very filling lunch for under 300 calories! (I did not take noodles or rice). I will eat there again next time I'm in the area. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-10-18T09:53:04-0400", "location_id": "1013138", "id": "429359934", "user": {"username": "leewilly33", "user_location": {"name": "Mankato, Minnesota", "id": "43286"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Yummy on my Tummy!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r417943623-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review417943623", "text": "This is one of our utmost favorite places to eat lunch and dinner. We always buy at least two gift cards at Sam's Club and save a bit. You choose your own food, they throw it on their grill and BAM!, you have a delicious meal. The service people and the cooks are always friendly, and they handle food allergies very, very well. Dessert is great too!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-09-13T05:38:20-0400", "location_id": "1013138", "id": "417943623", "user": {"username": "MNcouple58", "user_location": {"name": "Rochester, Minnesota", "id": "43466"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Good food, nice variety", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r412926602-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review412926602", "text": "We tend to forget about this place but it is good.  There is a nice variety of items to choose from to add to your dish.  It is fresh and you can watch it being cooked.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-30T16:18:15-0400", "location_id": "1013138", "id": "412926602", "user": {"username": "Jennifer A", "user_location": {"name": "Anonymous", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "A different style of cooking", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r409537414-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review409537414", "text": "We were coming back to Minneapolis after visiting Mystery caves and were in hurry to find a place for lunch. After travelling around the city of Rochester, we thought of tasting different kind of food and hop into this restaurant which provides Mongolian style of foods. After about 15 minutes of waiting time we were allocated a table. The waitress was very kind enough to explain the arrangement in the restaurant and we quickly moved along with others to select our mix of ingredients and hand over it to chef to cook. It is very interesting to see how they make the food. Several chefs put several plates of ingredients given by visitors to a large pan and going round the pan  and fry those stuffs. Within few minutes I was given my plate and the food was tasty. This is a new experience to me and none of us were disappointed by the food taste. One can go several rounds if it has the appetite. At last we had a good meal fora reasonable price.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-23T09:44:41-0400", "location_id": "1013138", "id": "409537414", "user": {"username": "nihalwicks", "user_location": {"name": "Colombo, Sri Lanka", "id": "293962"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-08", "title": "The worst", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r403796346-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review403796346", "text": "\nCan I give less than zero stars?\nWe were in Rochester for a visit to the Mayo Clinic and having trouble finding places to eat. We got a suggestion from a friend, as we were looking at Yelp, etc, who occasionally goes to a Hu Hots in Indiana. It sounded good; at least better than what we had found earlier in the week. \nWe walked in and and it was way crowded with a line waiting. I guess this is popular. We were seated and it all went downhill from there. The distracted waiter explained how the concept worked and it was all you can eat.  We ordered our beverages and rice/soup that came with the meal. I had signed up for the email which was supposed to get us a free appetizer so I told the waiter. He wrote down the phone number from the account and we ordered appetizer egg rolls. Next we went up to the first bar area. This contained the proteins and noodles. There are small salad sized bowls to which you are asked to take one and fill it. I put in my noodles and they took up half the bowl. How the heck was I supposed to fill it with other items? I saw the Mystery meats in front of me and even though there were signs I had to have my wife assure me they were what they said they were. All the proteins were frozen. I understand the need to keep them cold and the need for thin slices for stir-fry but it still kind of bothered me. Bothering me more was watching the little boy in front of us over fill his bowl with long noodles that didn't fit and stretched back to his bowl from the serving bowl. No he didn't, yes he did - he grabbed the noodles with his hand and put the remaining noodles in his bowl. Gag! On to the veggies - frozen veggies! Huh! Why? I have been to many buffets/salad bars -why frozen? Just keep fresh iced in a cold table. I was further grossed out here. There were veggies all over the place- on the floor, on the bar, mixed with others all being bounced around with tongs that people continuously touched with their hands all over the tongs tops and bottoms as they served themselves in high stacks of food like they were trying to build a tower or playing Jenga.  I saw no staff try to clean it up. We did the best we could to fill our bowls without spilling any. Oh well, lets hope the cooking process kills the transferred germs. Now to the sauces. I thought the veggie and protein areas were bad - gross at the sauces as people slurped ladles onto their already teetering mounds of food. I put 5 ladles of the Szechuan sauce on my food as the number suggested by the waiter. On to the cooking area. I have to admit the cooks work hard and fast. There weren't many people in front of us so we could keep track of our food on the circular grill. Now the spice bar at the end. What another mess as people elbowed to get pepper, Sambal, etc which was all over the place and probably never cleaned. Finally to the table as the noise level was increasing and the frenetic atmosphere was annoying as patrons continually passed back and forth to the  cooking/food area (why couldn't seating be set up away from the cooking area?). Our dry white rice and cold soup were at the table. The rice was dry and the soup blah. Our appetizer still wasn't there. Now to try the stir-fry. It was tasteless and I had used the hottest sauce. My wife's was a little better as she mixed a few sauces together. So basically I had cooked veggies and dry chicken. The corn was the worst having an odd taste.  I figured maybe I didn't put enough sauce on my food so I decided to give it another try and get  a small second. Now going up the line had increased from manageable to about 40 people in front of us. We went up while grin and bearing the process . I added about 8 ladles of the sauce. Up to the grill. The line went round and round...wait was that my dish, huh, no, yes, maybe...I took it hoping it was mine as several patrons looked confused too. The result was the same- flavorless. I didn't finish and asked for the check. The distracted waiter came by and asked for the account phone number again and ran off. He came back indicating there was no free appetizer on the account. I said OK as he ran off again. I looked at the bill and he wrote the phone number wrong.  I was totally disgusted and told my wife I didn't care to bring it to his attention as I just wanted to get out of there and absorb the loss. We paid then left, in my opinion, one of my worst dining experiences ever.\n\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-08-10T13:16:25-0400", "location_id": "1013138", "id": "403796346", "user": {"username": "Stanley S", "user_location": {"name": "Winter Garden,FL, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Good food", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r395637834-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review395637834", "text": "Excellent food, busy place and loud too. Service ok, cooks work hard and do a great job! I will likely go back many healthy choices", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-22T17:09:04-0400", "location_id": "1013138", "id": "395637834", "user": {"username": "Brianna F", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Good food but . . .", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r381917629-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review381917629", "text": "Myself and wife (seniors) visited Saturday evening.  Previously long timers in Anchorager, AK which has several similar Mongolian grills.  This review is a comparison.  Food quality was similar.  However our favorite locations in Anchorage offered additional entrees, such as salads, cake, prepared Asian entrees such as sweet and sour beef, mongolian beef, wings, various chicken dishes, noodles, fried rice, . . .    The grill was not showy at all, since they have a donut shaped grill with several people mixing th4e customer selected meats and accompanients.  (Anchorage had a more showy arrangement, with a solid grill and one or two cooks wielding long \"chop sticks\" used to mix food as it cooks and swooshing the cooked results into a large bowl  (HuHot uses a much  smaller bowl)\n\nWe were seated at a booth which was somewhat uncomfortable as we had to reach upwards somewhat to eat from the table.  There are tables with chairs in the facility -- jusr our luck of the draw.\n\nThe 8-10 sauces are premixed with an adequate description of each.  One can pass through the line more than once without additional charge.\n\nThe variety of meats and vegetables were sufficient.\n\nOverall we were were slightly disappointed as Hu Hot did not live up to our expectations.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-12T09:38:40-0400", "location_id": "1013138", "id": "381917629", "user": {"username": "Allen B", "user_location": {"name": "Rochester, Minnesota", "id": "43466"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "A good place to choose.", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r377681300-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review377681300", "text": "One of my lovely wife's favorite place to eat when we come to Rochester.\nShe really like's stir fry style of food and here the have a lot of tasty food to choose from.\nMeat's and veggie's and more.  And white rice.\nIt is fun to pick your own meal and then watch as they cook it up for you.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-29T11:18:16-0400", "location_id": "1013138", "id": "377681300", "user": {"username": "FLYTOANYWHERE", "user_location": {"name": "Austin, Minnesota", "id": "29612"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "Do not go around 5-6pm!! Long Lines!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r374524417-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review374524417", "text": "We came around 5pm, it was our first time eating there, after the waitress explained to us what to do and options for bowl size, the lines to get food were very long and you stood and waited for 15-20 minutes. Once getting food and back at the table, I was enjoying my bowl, when I got a bite of crab, as someone who does NOT handle sea food it was a very very unpleasant surprise. I know as a fact I did NOT put any crab in my food, so I am assuming that when they were cooking my food on the grill I got someones crab from their planned bowl. I pretty much lost my appetite after that, thus why I could only rate a 4 for this place. My husband LOVED his food  and I probably would have too if that stray crab hadn't made it into my mouth.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-19T07:19:01-0400", "location_id": "1013138", "id": "374524417", "user": {"username": "Sarah F", "user_location": {"name": "Albert Lea, Minnesota", "id": "29584"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Just ok", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r373397522-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review373397522", "text": "We have dined her a number of times and when we first went it was AMAZING.. did not even mind waiting in line.. however... the last few times we've been there it's been ok at best.\nWhy?  For me, it's all around the service. Two times now no one was at the front to check us in and we waited.. we saw dirty tables and empty tables with people waiting.  Our server was not interested in us and did not listen when we ordered drinks.. mind you.. that was ALL she had to do because you get your own food.\nThe food was still good but just not worth the bad service and uncaring people working .  Too bad, had a bunch of potential.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-16T08:17:54-0400", "location_id": "1013138", "id": "373397522", "user": {"username": "voltech2", "user_location": {"name": "Minneapolis", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "Best buffet in Rochester", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r371047279-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review371047279", "text": "Huhot Mongolian Grill is a buffet restaurant where you prepare your ingredients and give them to the cooks to stir-fry them on a giant griddle while you watch.  Unlike many buffets, Huhot has high quality ingredients including seafood and fresh vegetables.  You grab a bowl (or 2) of uncooked meat, fish, and vegetables and then move to the sauce area to add ladles of specialty sauces or others like ginger, soy, etc..  Finally you take your bowls to be cooked.  The cooks take your bowls and cook them while you wait.  When it's done you pick them up, add a few final ingredients as desired (sunflower seeds, etc.) and go to your seat.\n\nHuhot is located in the Apache Mall.  It can be busy during the weekend meal times so avoid them if possible.  Sunday nights are good, especially after the mall is closed.\n\nHuhot is a fun restaurant for the whole family and the food is very good.  I recommend stopping here when you are in the area.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-07T19:07:00-0400", "location_id": "1013138", "id": "371047279", "user": {"username": "rmpeterson2", "user_location": {"name": "Mantorville, Minnesota", "id": "43287"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Continually Good!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r367626833-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review367626833", "text": "Pricey, but good food and service.  Options continue to increase, mandarin oranges and Tilapia are now included.  Watch out when you grab a bowl, we often find that they are dirty.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-25T19:07:31-0400", "location_id": "1013138", "id": "367626833", "user": {"username": "MinnesotaRandy", "user_location": {"name": "Minnesota", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Great atmosphere, good party place", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r363738731-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review363738731", "text": "HuHot is great for big parties.  The food choices are limitless, each trip up is as different and exciting as your creativity will allow.  I rarely overeat, but this is the place that I might leave a little stuffed.  The meat, veggies, and sauces are bountiful and provides customers an array of healthy eating options.  I like it hot and this is the place for heat!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-04-12T14:22:55-0400", "location_id": "1013138", "id": "363738731", "user": {"username": "Christopher S", "user_location": {"name": "Abilene, Texas", "id": "30138"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Fun place to eat out!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r359585275-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review359585275", "text": "Stopped by here for lunch, visited with some friends that had been before, and some that hadn't. This was my first experience at \"HuHot\", and it was a really fun and tasty place to eat out.\n\nFilling a bowl with all the ingredients (noodles, meat, veg & sauces) that you want in your meal is a fun concept. There are some basic recipe suggestions written by the sauces - so if you're worried about creating some horrible flavor combination you can rest easy - if in doubt, just follow one of the 'recipes'.\n\nThe range of ingredients was impressive, and the line at grill moved through pretty quickly. Tried two different combos and both worked out well! I would definitely come back here if I was in the area again!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-03-28T22:12:55-0400", "location_id": "1013138", "id": "359585275", "user": {"username": "dream2explore", "user_location": {"name": "Central Coast, NSW", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Little different food in the mall", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r359033954-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review359033954", "text": "This is buffet with extras. You can order food and pay for it, or wait in long line to have your part of 'all you can eat' prepared by the 'grill warriors'. This is big attraction, though. I made 3 rounds and enjoined it. They cook about dozen of meals, assembled by the customers themselves. This is kind of art of cooking.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-27T08:48:18-0400", "location_id": "1013138", "id": "359033954", "user": {"username": "Mariy V", "user_location": {"name": "Akron, Ohio, United States", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-03", "title": "Oh no!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r353955262-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review353955262", "text": "This place has really gone down hill. The food and service is not good anymore. The food bar is always filthy. The booths have holes on them. Management doesn't care? Oh and my food always gets mixed on the grill! They need to have consistency", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-08T14:22:31-0500", "location_id": "1013138", "id": "353955262", "user": {"username": "bwc130", "user_location": {"name": "Rochester, Minnesota", "id": "43466"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Great Place For A Fun Meal", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r353440335-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review353440335", "text": "I love building your own stir fry and watching them cook it on the big grill. They are very careful about allergies and it's just a fun place to be. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-03-06T15:36:28-0500", "location_id": "1013138", "id": "353440335", "user": {"username": "Courtney E", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-02", "title": "Very unique experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r344325768-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review344325768", "text": "We took a group of 10 year old girls and parents their last Saturday and I was impressed. I didn't know if I was going to like it, but it was a fun experience. They have a variety of noodles, fish, or meats and a Large variety of veggies you choose from at the buffet. Then you add various layers of sauces and hand your dish to a chef that grills it in front of you on a large round flat grill the chefs chop and with flare cook your food. It was quite a show and the food was very good, all the girls went back for more.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-02-01T09:49:57-0500", "location_id": "1013138", "id": "344325768", "user": {"username": "Vern T", "user_location": {"name": "Albert Lea, Minnesota", "id": "29584"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-12", "title": "Mongolian at the Mall", "url": "https://www.tripadvisor.com/ShowUserReviews-g43466-d1013138-r340289363-m11068-HuHot_Mongolian_Grill-Rochester_Minnesota.html#review340289363", "text": "Chain restaurant at the Apache Mall in Rochester. You get to select how much and what sauces you want. Typical Mongolian place in selections of food available. Have some gluten free options. When it is busy it can take a while to get through the line and get your food cooked. Overall pleasant and fun dining experience. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-01-15T10:49:48-0500", "location_id": "1013138", "id": "340289363", "user": {"username": "CougRN", "user_location": {"name": "Richland, Washington", "id": "58708"}}}]}