{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2015-05", "title": "Great post arena stop", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d8092242-r272387226-m11068-Kryptonite-Rockford_Illinois.html#review272387226", "text": "We were given this suggestion by our Uber driver. Nice ambience from the outside. They have a tailgate tent up for the people who want to smoke. No smoking inside. We sat at the bar. Greeted by the early night bartender he offered us some suggestions and we each went with a beer he suggested. The backbar is loaded with different choices. Anything from mini mule shots, whiskey, scotch to any mixed drink you can think of. They have little buckets available for mixed drinks which is loaded with sugar but a very popular drink with many patrons. A bad was playing upstairs which surprisingly was not too loud. They have lights strung up between the first and second floor which sort of gives an outdoor feel to the main level. Fairly busy for a Thursday night and pretty decent clientele until the, not so original, 20 something enters screaming at the top of his lungs Woooooo. Once he notices no one really cares if he is there or not he calms down. So there is him and the polar opposite patron who is quiet and just wants to sit and have a few drinks. As the night winds down some others show up and drop there drinks on the floor shattering their beer bottles. A quick cleanup and you would never know it happened. Bartender closing down was friendly and absolutely great at his job. We would definitely return.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-05-16T11:55:55-0400", "location_id": "8092242", "id": "272387226", "user": {"username": "Suzan H", "user_location": {"name": "Ankeny, Iowa", "id": "29360"}}}]}