{"paging": {"total_results": "6", "skipped": "0", "previous": null, "results": "6", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Great food, friendly staff!", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d6198708-r390759834-m11068-District_Bar_and_Grill-Rockford_Illinois.html#review390759834", "text": "We went here on a random Saturday for lunch with our two young kids.  They have mainly high top tables, but we sat at the regular tables near the stage which is also conviently away from the bar for families with kids like us.  We have visited here several times and always love the food, particularly the wings.  The manager stopped over to talk with us and was extremely nice.  The kids have several choices of normal favorites on the kids menu and even get a cookie for dessert.  We'll certainly be back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-07-09T10:16:14-0400", "location_id": "6198708", "id": "390759834", "user": {"username": "Tracy W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Good Food", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d6198708-r390189018-m11068-District_Bar_and_Grill-Rockford_Illinois.html#review390189018", "text": "Ate at the District Bar on July 4 prior to fireworks.  They were not as busy as I thought they might be.  I have eaten here in the past and always enjoyed the good.  Again, the food was good, but yet again, I believe they are understaffed.  The waitress was very nice and pleasant but we had to hunt her down for drink refills and to get the check.  The last refill order she took, but never came.  Our cue it was time to leave.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-07-07T12:43:23-0400", "location_id": "6198708", "id": "390189018", "user": {"username": "jomary27", "user_location": {"name": "Illinois", "id": "28934"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "We Will Return on our Next Visit to Rockford", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d6198708-r388296948-m11068-District_Bar_and_Grill-Rockford_Illinois.html#review388296948", "text": "We visited during lunch time and it was not busy.  The server was very friendly and stopped by frequently to make sure that our food tasted good and that our drinks stayed full.  The veggie burger that I ordered tasted homemade and very good.  I loved that it was not a premade frozen patty.  The restaurant was very clean and looked recently updated.  We noticed that there was a stage.  We would definitely love to visit again without our kids in the evening if they offered night time entertainment.  We are from Michigan so we made a mental note of this place so we can come back the next time we visit Rockford.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-07-01T18:25:39-0400", "location_id": "6198708", "id": "388296948", "user": {"username": "CursedInMichigan", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Nice Bar & Grill Downtown Rockford", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d6198708-r385634548-m11068-District_Bar_and_Grill-Rockford_Illinois.html#review385634548", "text": "We were in Rockford to meet some friends and join them for a concert at the Coronado Theater.  Our friends suggested we could meet at the District Bar and Grill to grab a quick bite before heading over to the theater.  Access to this downtown location was easy.  There was ample parking in the back.  We arrived around 6:00 PM and were able to secure a nice table.  We ordered a round of drinks, which arrived in short order.  You get your money’s worth when ordering a mixed drink.  They have plenty of beer selections too.  The menu has a wide selection of items to choose from including pizza.  About halfway through our drinks, we figured out what we wanted to eat.  The wait staff are very nice and attentive.  We ordered our meals, which arrived in a reasonable time.  The food was good and portion sizes were more than enough.  The place fills up fast on nights that have events going on downtown.  If you happen to be in the downtown Rockford area, I suggest you stop by the District Bar and Grill for a drink or something to eat.  Based on the advertising, apparently they have live entertainment on weekends, which would also be worth checking out.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-24T12:39:53-0400", "location_id": "6198708", "id": "385634548", "user": {"username": "billhV8285JU", "user_location": {"name": "Chicago, Illinois", "id": "35805"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-08", "title": "A good spot for a quick lunch", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d6198708-r298103450-m11068-District_Bar_and_Grill-Rockford_Illinois.html#review298103450", "text": "Lunchtime is crowded with the downtown office workers and is a good option downtown for a quick meal. Efficient service paired with a decent, if slightly pricy, meal. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-08-11T17:27:28-0400", "location_id": "6198708", "id": "298103450", "user": {"username": "John D", "user_location": {"name": "Illinois", "id": "28934"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-02", "title": "Great place for dinner when at the Coronado", "url": "https://www.tripadvisor.com/ShowUserReviews-g36619-d6198708-r196529157-m11068-District_Bar_and_Grill-Rockford_Illinois.html#review196529157", "text": "We were at a dance competition at the Coronado and had a couple hours to kill for dinner so we walked here on a Sunday late afternoon.  The inside is large and they were very friendly and easily moved tables together so our group could sit together.  They seemed a little short on wait staff but they had a couple large groups of dancers so overall I think they did great.  Food was typical bar and grill.  The chicken tenders and onion rings looked like the frozen variety.  The salads were amazing though.  Very large and fresh.  The owner or manager stopped by and checked on everyone to make sure we had everything we need.  Very fun & comfortable place for adults and teens and probably children too.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-03-07T05:11:43-0500", "location_id": "6198708", "id": "196529157", "user": {"username": "Lavaford", "user_location": {"name": "Northern Illinois", "id": null}}}]}