{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Interesting", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r437940791-m11068-The_Rest-Salt_Lake_City_Utah.html#review437940791", "text": "Was visiting from the East Coast, friends were able to get a reservation.  I liked the ambiance from the fireplace to the taxidermy to the show the bartenders provide while mixing up the latest cocktails.  We were a group of 5 girls, so instead of ordering an entree each, we opted for multiple smaller plates, and two entrees to share.  None of the appetizers were impressive, but both entrees were amazing.  We had the pork belly and grits as well as the hot chicken with collard greens and mac and cheese.  Both were phenomenal.  Everyone was satiated, enjoyed the eclectic cocktails, and the environment.  Go if you can!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-11-16T16:32:32-0500", "location_id": "6407181", "id": "437940791", "user": {"username": "maepetrson", "user_location": {"name": "New Jersey", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "THIS PLACE IS FANTASTIC!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r437267205-m11068-The_Rest-Salt_Lake_City_Utah.html#review437267205", "text": "This place is quite the hidden treasure and it is not your typical Salt Lake establishment.  What a treat it is!  Food and drink amazing, atmosphere unparalleled...it is memorable and wonderful and FUN!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-11-14T17:39:36-0500", "location_id": "6407181", "id": "437267205", "user": {"username": "Lori K", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Go for the cocktails, starters and shared plates. Don't waste your money on the entrees.", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r403811486-m11068-The_Rest-Salt_Lake_City_Utah.html#review403811486", "text": "We had reservations for 3 during the very busy week of the Outdoor Retailers Show.  We were seated on time and had great, very efficient service and a knowledgeable server.  We ordered two cocktails off the menu and I ordered a Blind Pig, which is basically bartenders choice based on the spirit you like.  All of the cocktails were wonderful and unique.  We had the grilled peaches and cheese starter and it was divine.  Two of our party ordered entrees, while the third ordered 2 small shared plates as a meal.  The gnocchi entree was very good and unique, but quite small for a $19 entree dish.  The seafood stew was overpriced and not particularly good.  There were two pieces of crab in the entire thing and the crawfish were mushy and blah.  The shared plates were fried green tomatoes - wonderful, and the grilled vegetable plate - some items great, some not so much.  We will return for cocktails and small plates some night when we are eating dinner at one of the other amazing dinner spots in Salt Lake.  0ne last tiny suggestion for the restaurant - place small, theater style flashlights on each table so that patrons can read the menus.  It's too dark to read the menus with the light in the restaurant and it takes away from the wonderful ambiance when everyone at the table is using the light on their cell phone to read.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-10T13:47:16-0400", "location_id": "6407181", "id": "403811486", "user": {"username": "Michelle L", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Best little secret", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r401125193-m11068-The_Rest-Salt_Lake_City_Utah.html#review401125193", "text": "Was trying to find a cool place to catch-up with a friend. She suggested Bodega, which is fine but didn't have much energy. When I started asking for other options, a local told me to ask about \"the rest.\" Glad I did, it was the perfect ambiance and a great few hours spent talking with a friend. We will be back!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-03T21:20:38-0400", "location_id": "6407181", "id": "401125193", "user": {"username": "zaggagal", "user_location": {"name": "Seattle", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "One of the coolest bars in the West", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r394877163-m11068-The_Rest-Salt_Lake_City_Utah.html#review394877163", "text": "I live in SF and have a lot of experience frequenting cocktail bars (most people that live here do).  And I've done my fair share of checking out cool spots across the country, especially Williamsburg and Manhattan.  But this bar located below \"Bodega\" in SLC of all places, would give any cocktail bar in the country a run for its money.  Great cocktail list, super cool space, sophisticated...a beautiful bar set up.  If your in SLC and your looking for a great place to grab a drink, make this your number one spot.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-07-20T15:07:36-0400", "location_id": "6407181", "id": "394877163", "user": {"username": "MarkSF100", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-03", "title": "Great drinks, average food", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r380425278-m11068-The_Rest-Salt_Lake_City_Utah.html#review380425278", "text": "Make a reservation! The atmosphere is really cool and cozy at the same time. Plan on staying for a while because you need to sample a few drinks. If you don't know what you want, just tell the bartender or server what type of alcohol and flavor profile you want (sweet,sour, etc), and they will make something for you. I have never been disappointed in a drink at the Rest! Food is hit or miss. The cheese/charcuterie plate is wonderful and so are the bengiets, but stay away from the spätzle because it is very limp, almost raw, and the gnocchi as it is very bland. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-06T18:04:19-0400", "location_id": "6407181", "id": "380425278", "user": {"username": "Michelle K", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Gimmicky \"Speakeasy\" Style Bar That Doesn't Deliver on Quality", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r379138233-m11068-The_Rest-Salt_Lake_City_Utah.html#review379138233", "text": "The concept is new and retro -- you approach the upper bar's barkeep, utter the secret phrase, and he/she leads you down a stairway behind the bar into the basement where a very cool and time-forgotten underground bar awaits you.  The experience up to this point is worthy of mention -- it's cool and exciting and prepares you for a sense of \"what's next\"?  The bartender we had was a younger man who approached mixology with a theatrical flair and an encyclopedic knowledge of liquors, their origins, their properties -- the way a sommelier would talk to you in the nuanced language of wine tasting.  The actual drinks he served, however, were a bitter letdown.  It was an example of tantalizing ingredients by themselves not yielding a delicious cocktail when blended together.  To make sure I didn't get a bad starter drink, I ordered to other, different drinks.  Both were equally bad with a bad aftertaste.  The idea of creating a new drink on the spot sounds fun and interesting, but where the rubber hits the road, it doesn't translate into something you would want to try twice.  If you go, do it for the experience and not because you have high expectations for the cocktails.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-06-02T11:55:53-0400", "location_id": "6407181", "id": "379138233", "user": {"username": "TracyWfromWA", "user_location": {"name": "Granite Falls, Washington", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Better than average, but not quite fabulous", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r370798468-m11068-The_Rest-Salt_Lake_City_Utah.html#review370798468", "text": "OK--I'm from NY and nothing about the downstairs/lock-down/speak-easy set-up spoke to me. Actually a bit creepy. Once seated, we found the service pleasant and attentive (counter to some previous reviews) and the food generally good. We tried the cheese board (nice selections), the beet and creme fraiche salad was super while the fennel and apple salad was just okay. Main courses: three blackened scallops (really?) that took me roughly two minutes to down while my husband had a very tender half-chicken with peppers and queso fresco which he enjoyed quite a bit. The beignets (the only dessert choice) were just okay, rather dry. That said, we enjoyed the meal overall and were glad we went. By the time we left, there was quite a crowd in the bar upstairs--the appetizers they were serving there looked delicious.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-06T18:10:38-0400", "location_id": "6407181", "id": "370798468", "user": {"username": "Brooklyn-ish", "user_location": {"name": "upstate New York", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-11", "title": "Hidden", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r368268150-m11068-The_Rest-Salt_Lake_City_Utah.html#review368268150", "text": "The R est is a nice place to go and have a drink and a bite in the evening.  The menu is limited to a 4 or 5 mains.  Food is good but needs a little change up now and then.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-04-27T13:25:40-0400", "location_id": "6407181", "id": "368268150", "user": {"username": "Ray H", "user_location": {"name": "Salt Lake City, Utah", "id": "60922"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-04", "title": "You need more than ambiance", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r365614490-m11068-The_Rest-Salt_Lake_City_Utah.html#review365614490", "text": "After searching for a new restaurant to check out, my husband and I saw some great reviews on Rest and decided to check out what all the hype was about. I noticed there were reservations available on open table for 8:00, 8:15, 8:30, 8:45 and on and on so we decided to take a chance and not make a reservation. No big deal if we can't get in. When we arrived we asked the host if there was anything available, he glanced at a book and said only at the bar. We were cool with that.\nSo the door was opened and we were not \"led\" by the host, but rather had the door shut right behind us as we slipped through, weird, but we get it.....\nSo, we walked downstairs and hit up the bar. The ambiance is really cool. A nice dark bar area made to resemble an old speak easy. We're feeling it. \nWe take a seat at the bar. A young gentleman hands us menus right away and we begin to decide.... After one bartender explains that he will be leaving he lets us know that someone else will be right with us. Ok cool. We look around and notice there is only one table with guests at it and all the others are empty. After about 10 minutes our drink order is taken and we casually ask if we are able to sit at a little coffee table to order dinner or are they reserved...\"you have to ask the host, I have no idea\". Fair enough.  We get our drinks and my husband heads back upstairs to ask the host about a table. He is now a she and she tells him she doesn't know, ask the bartender downstairs.....ok the run around. So, we will eat at the bar, no big deal, we are very much bar people. \nWe decide on 2 starters and 2 main dishes....... We wait. We try to get one of the 5 employees attention so we can order, we are so hungry. We close our menus and look ready......nothing. We try to make eye contact, but we are ignored. We start to question things.... Are we not hipster enough? Do we look awkward? What's the deal? We finish our drinks.....we wait. What is going on? There were more employees at the end of the bar then there were patrons in the restaurant....NO JOKE! We even walked to the back library to see if maybe they were busy in another area of the restaurant and we just weren't seeing it...nope! \nour total time spent at Rest was an hour. ONE HOUR for a beer and a martini. The most expensive item in a bar or restaurant is an empty seat guys and you had plenty. Our bill was $20, with any kind of service it would have been over $100 after we ordered food and drinks, but we were never given the opportunity. A note to the owner, teach your staff about taking care of the guest. The service was non existent. And your tables were empty. We left hungry and confused. Went to Eva's.....had an awesome time as usual. We will not be recommending Rest to anyone we know. We wish you the best of luck and sincerely hope that this review can make the next guests experience a better one.\nDon't act bothered by your guests, they pay your bills.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "salslc, Owner at The Rest, responded to this review", "text": "Kristy,\n\nI wanted to apologize profusely, and also thank you for taking the time to write about your experience. I am so disappointed to hear that your first visit to The Rest was not a positive one, and please know, that your feedback has already been discussed with the General Manager and the employees that were on staff last night (4/20). As an owner of a small business, I value any feedback I receive, and rely on it to continue improving the customer experience.\n\nI hope that you will give us another chance to earn your business, and if you do, I would love to be able to personally arrange the dinner reservation and service. \n\nPlease feel free to contact me directly, at sal@bodega331.com if you choose to return. I hope you have a great day.\n\nWarmly,\nSara \n", "title": "Owner Response", "published_date": "2016-04-21T12:02:54-0400", "id": "366146579"}, "trip_type": "Couples", "published_date": "2016-04-20T05:31:01-0400", "location_id": "6407181", "id": "365614490", "user": {"username": "Kristy I", "user_location": {"name": "Cottonwood Heights, Utah", "id": "1009691"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Simply Outstanding!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r363362363-m11068-The_Rest-Salt_Lake_City_Utah.html#review363362363", "text": "We were not sure what to expect.  The place is in the basement under a bar, hard to figure out what is on the menu, all very mysterious (which I guess is what they are shooting for)!  My wife was a little leery about going, but we decided to give it a shot and were very glad we did.\n\nThe ambiance is very unique; they play old vinyl records, the place is dark, but overall very comfortable. Not too noisy. The food itself is mostly tapas, and everything has its own unique take. Nothing is routine, but everything was excellent.\n\nThey also have a great beer list including quite a few imports that are not the \"usual\" suspects.\n\nGreat night out.  Definitely go (and definitely make reservations as seating is very limited!)\n\nPS: I had to ask about the little birdhouses with a strange sculpture inside at each table.  Supposedly they represent the seven deadly sins, and whatever sin you think of when you look inside is what you suffer from....", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "salslc, Owner at The Rest, responded to this review", "text": "Thank YOU! I was thrilled to read your review and hope we have the opportunity to see you again soon.\n\n-Sara", "title": "Owner Response", "published_date": "2016-04-21T12:04:27-0400", "id": "366147028"}, "trip_type": null, "published_date": "2016-04-11T08:06:47-0400", "location_id": "6407181", "id": "363362363", "user": {"username": "AAndTMD", "user_location": {"name": "Maryland", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "A hidden gem ", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r359543870-m11068-The_Rest-Salt_Lake_City_Utah.html#review359543870", "text": "Some friends and I went out last week and had dinner at the Rest. The atmosphere is wonderful and so different from anywhere else in Salt Lake! The cocktails are expertly crafted to order (I highly recommend the \"blind pig\" option where you choose a spirit and a flavor profile and the bartender makes something for you), and the cheese tray was phenomenal. Stay away from the Spätzle...it's pretty soggy. Overall, a great place to go with a group of people!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-03-28T16:52:29-0400", "location_id": "6407181", "id": "359543870", "user": {"username": "Michelle K", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Superb food and drink", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r354301386-m11068-The_Rest-Salt_Lake_City_Utah.html#review354301386", "text": "I really enjoyed my surprise visit, unexpected and highly enjoyable.\nDrinks service was a bit slow and confused (forgotten orders etc) but the quality of the food made it worth it!!\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-03-10T04:01:37-0500", "location_id": "6407181", "id": "354301386", "user": {"username": "Aifric W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-01", "title": "Fun little place. ", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r338675961-m11068-The_Rest-Salt_Lake_City_Utah.html#review338675961", "text": "Glad we went in. Wasn't sure what the deal was with the \"secret\" nature of this place, but cool nonetheless. Had a great screwdriver and buddy had an IPA. Cheese tray was great. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-01-09T06:13:10-0500", "location_id": "6407181", "id": "338675961", "user": {"username": "Gaweezinack", "user_location": {"name": "Muskegon, Michigan", "id": "42499"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "NYC COOL IN SALT LAKE CITY? SURPRISE! SURPRISE!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r314042697-m11068-The_Rest-Salt_Lake_City_Utah.html#review314042697", "text": "While basement speakeasy bars are a rather prolific sight in cities like New York, Seattle, Portland, Denver, Boston etc.  Finding one that delivers a convivial ambiance, inventive drinks, and creative tasty food, is an arduous task.  Bodega/Rest, in of all places Salt Lake City, delivers on all three.  Since I am originally from NYC, and have that inherent chauvinistic NYC attitude inherent to all New Yorkers, I wasn't surprised that both the owner and manager are from the Big Apple.  They brought that New York savvy to SLC and have the city's best bar and one of its best restaurants.  \nA locked door located in the back of the nondescript Bodega reveals a staircase taking you downstairs to a trendy, hipster decorated room that has just the right amount of panache.  With a staff that is warm and accommodating, I wasn't surprised that the Pimm's Cup my spouse ordered was just superbly crafted, and my rum was premium.  Our chick pea and trout tartare small dish appetizers were uniquely presented and tasted special.  The Rest would be \"cool\" in any city in the world and should be treasured in SLC.\nAlas, the word is out.  We tried to return the following two nights, and the line stretched out the door.  Thus, be smart, and make easy reservations online.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-09-27T08:40:00-0400", "location_id": "6407181", "id": "314042697", "user": {"username": "Philip G", "user_location": {"name": "Salt Lake City, Utah", "id": "60922"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "My favorite bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r300740670-m11068-The_Rest-Salt_Lake_City_Utah.html#review300740670", "text": "The interior is exquisite. Even though this is no longer much of a secret bar, it is still feels that way. They play vinyls, but not too loudly. I can actually hear other people talk which I like. The cocktails are superb. Also, the beignets. Get the beignets. If you can choose a place to sit, the library section is my favorite. You are surrounded by vintage furniture, wood paneling, and books.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-08-18T10:00:26-0400", "location_id": "6407181", "id": "300740670", "user": {"username": "Lenner2015", "user_location": {"name": "Salt Lake City, Utah", "id": "60922"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-05", "title": "Awesome Salt Lake Speakeasy", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r276401707-m11068-The_Rest-Salt_Lake_City_Utah.html#review276401707", "text": "The Bodega in it's own right is a fun place to go for a quick drink before visiting \"the Rest\". Make sure you get reservations prior to your visit to the rest. Attire is dressy casual and the atmosphere is electric - it's a really fun space! They have a backroom that they use for larger groups - it would be perfect for a birthday celebration dinner.\n\nThe drinks are superb in both the Bodega and the Rest - the bartenders really know their craft here and can concoct specialty drinks for you. If you're trying out the Rest for your first time, try out one of the Absinthe fountains for a fun experience. The food is awesome - we went for a late night meal, so we just got apps : ceviche, Scottish duck, and the chicken wings. All of them were awesome, but the chicken wings were my favorite.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-06-01T01:38:10-0400", "location_id": "6407181", "id": "276401707", "user": {"username": "knpage88", "user_location": {"name": "Saint Louis, Missouri", "id": "44881"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-02", "title": "Hidden Gem!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r264234923-m11068-The_Rest-Salt_Lake_City_Utah.html#review264234923", "text": "Love this restaurant and the fun atmosphere! Fun music, good vibes and a great place to sit down and enjoy a meal. If you order the Beer Can chicken, expect to wait at least 45 minutes as it is cooked to order but it is worth the wait! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2015-04-07T07:47:54-0400", "location_id": "6407181", "id": "264234923", "user": {"username": "Blakely H", "user_location": {"name": "Murray, Utah", "id": "57078"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-02", "title": "Best hidden gem in the US!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r261906766-m11068-The_Rest-Salt_Lake_City_Utah.html#review261906766", "text": "I am obsessed with hidden speakeasy themed restaurants and after deciding to visit park city with some friends i decided to do some research. We had to wait until 5 when Bodega opened, once we walked in there was a little \"hipster\" douche talking on his cell phone. He didn't appreciate our enthusiasm to visit \"The rest\". Once we trekked our luggage downstairs we approached a dimly lit long bar with old timey seating and by far the best atmosphere I have ever encountered. The barista Zade is one of the most memorable people i have ever met and would go back in a heartbeat just to visit him. The cocktails are phenomenal and the food is just as good. We had various drinks and food off the menu, everything was wonderful. My boyfriend said that the old fashioned was probably the best one he's ever had. From the record player to the decor I loved every minute of visiting this place and am so glad we did not miss it!\n\nI would recommend making reservations. Try the pork belly, duck nuggets, and scallop fritters. ALL the drinks are great!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-03-26T08:26:39-0400", "location_id": "6407181", "id": "261906766", "user": {"username": "katie l", "user_location": {"name": "Tampa, Florida", "id": "34678"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-02", "title": "Delicious, delightful and sublime", "url": "https://www.tripadvisor.com/ShowUserReviews-g60922-d6407181-r256543728-m11068-The_Rest-Salt_Lake_City_Utah.html#review256543728", "text": "Executive chef Brandon Cagle really can make a silk purse out of a sows ear!  What a great meal.  Comfort food satisfying that basic need, and elevated to titillate gastronomic sensibilities.  Yes, dining at The Rest is \"a dining experience\" but once you sit down and get past the attention the experience demands, you will be in for a real treat.  First tell the server that you are in the mood for something effervescent that packs a punch and see what the bartender delivers.  That was fun.  Then relax and order most anything on the menu (except the pickled onion rings-not to my taste, but hey...) and be prepared to be surprised and very pleased.  At last, duck confit that actually is delicious.  A Scoth Egg with a soft center, best egg ever!  Grits, beans, eggs, who'd a thought! Yum.  Go.  Have fun.  The food is really good.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-02-26T07:01:11-0500", "location_id": "6407181", "id": "256543728", "user": {"username": "Divawing", "user_location": {"name": "Santa Barbara, California", "id": "33045"}}}]}