{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Prices are good and portions are large, better than expected", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r434670345-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review434670345", "text": "This location has been a number of restaurants through the years - Lark Creek, Asteria - but I think Three may have some legs in being here a bit longer.  \nPrices are good and portions are large.  \nWe started with the friend calamari - spiced style.  You have option of spiced, garlic and one other.  Nicely done.  Crispy and not greasy.\n\nOn this night, my friend had the chicken ratatouille over risotto.  We could have split this as the portion was very good size.  The veggies were cooked perfectly and so was the risotto and chicken. \nWe shared a beet and goat cheese salad.  This too was a good size for $11.  We could have ordered the meal size for $14.  Beets were fresh, arugula was perfect and it was nicely dressed.  Interesting fried, shredded beats were served on top.\nI ordered the salmon pizza.  This was again large enough for two and would have been perfect to share with a table.  Smoked salmon over dressed arugula, on pizza crust and drizzled with creme fresh.  \nLots of families here the night we were in.  I could see this as a great brunch spot, casual to grab a burger and beers too.  Very comfortable and low key.  Wait staff was good, and moderately attentive.  \n\nParking: street or lots in the area.\nHandicap access: entrance and through restaurant no problem, but restrooms are downstairs and not sure if elevator.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-11-04T14:45:20-0400", "location_id": "5073404", "id": "434670345", "user": {"username": "Tiny_Bubbles007", "user_location": {"name": "San Mateo, California", "id": "33031"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Varied menu can satisfy many tastes, maybe too many items.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r432013144-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review432013144", "text": "We 4 ordered beverages as soon as we were seated. 3 arrived quickly but it took a 2nd request to get the 4th drink.  Sweet potato chips were soggy.  Skirt steak, pasta, chicken, BBQ pulled pork tacos, desserts made up an early dinner. Lots of craft cocktails & beers.  The kitchen loves mangoes & sweet potatoes, so expect them in odd places. \nI've also been here for brunches, where service can be quite slow.  \nStaff is friendly but not always as efficient or service as polished as one might like.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-26T20:57:04-0400", "location_id": "5073404", "id": "432013144", "user": {"username": "carol22b", "user_location": {"name": "menlo park ca", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "I think we found a new keeper!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r431323053-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review431323053", "text": "We don't eat out often near home.  So when we do the food has to be worth eating. My experience around these parts is pretty just ok food.  Last night we tried some place new and it was a winner!  This is a new place, I am not sure how new but has opened within the past 3 months?  This is located in the pleasant but getting more crowded San Mateo downtown. This particular block has been kind of sleepy but business is picking up, parking is pretty ridiculous so be prepared to hunt for parking, use one of the ramps and walk, it is safe to walk by ones self here, not really a prob, just be forewarned. \nThe restaurant is lucky enough to have a curb cut out so you can drop off your crew in a safe spot before running off to find parking.  \nWe had called for reservations, it opens at 5:30 so if you call before then you go to voice jail, but you can use Open Table on line. When we walked in every single seat at the long winding bar was taken and all the bar tables, with the tall  chairs were also occupied and all were eating!  We later informed by the waiter that dishes are intended for one an there if there are 2 prices listed, 2 sizes are available, more on this later. \nThe place is brand new and the atmosphere is joyous!  Nice lighting with twinkle lights and two walls with colorful chalk menu items.  They were extremely accommodating to families with children, we were seated nest to several adults with 4 kids under the age of 5.  Rather well behaved but they were still small kids!  \nThe menu is a paper menu folded up into 4s and packed with items.  It took us a long time to look over everything and as I sit here now, a day later, I see so many things I missed last night!  (There is generous lighting and the menu is written in bold typeface so people who need readers can read the menu) There were so  many items we wanted to try but we were under a time constraint of picking up high school student later in the evening.  So we skipped dessert! When we ordered it the duo pricing on the menu was explained! After I gave my order, I asked the waiter that I also wanted, but did not see on the menu, the, what looked like, sweet potatoe chips on the table next to us!  IT comes instead of bread!!  OH and they were good!  Hot to the table with a dash of cinnamon and sugar!!  The waiter kindly brought us out several serving of chips!! We age them.I had 3 onion soup.  It was delish, not the best every but good.  What I liked is that it came in a small bowl, with a small crouton, bread piece, covered by a THIN slice of cheese.  I love french onion soup, I have it nearly every time I can, but most of the time, it comes in a caldron, with a hugh piece of bread  and 1/2 of cheese.  So this was just a perfect size for a normal person and I was delighted!  Even with Several passings around the table to share, it was a goodly portion. I also had the BBQ Pulled Pork tacos, gluten Free!  The corn  tortillas themselves were only the small side, maybe 3-4 inches but they were mounded with a lovely spicy pulled pork, with pickled onions,  I didn't think I could eat all three but I took one for the team!  I had more success picking them up to eat once I ate half the meat with a fork!  Good to great!  \nTwo of our party shared the large size Briased lamb Shepherd's pie.  This came in what I would call a soufflé dish, it was huge and mounded to the rim with mashed potatoes.  This was given rave reviews!  Lamb was lamb, not mutton, nicely seasoned, much enjoyed and much taken home for leftovers!! \nAnother shared dish was Seafood Cioppino with Fresh Pasta.  The two who shared this could not stop raving about the actual pasta!  They had a double order and it was large it was not as large in proportion to the Sheperd's pie.  Much enjoyment was had.  \nWE also had Blue Gnocc -n- Cheese with the skirt steak.  Big pillows of Gnocchi with lots of Blue Cheese sauce.  Pretty gooey to satisfy the blue cheese/mac-cheese among us.  The Skirt steak was requested as well done and it was, nice char, nice flavor and satisfying.  We also ordered the cheesy garlic foccacia, thought it would be a nice accompaniment to the sheperds pie.  When we were served 4 small triangles of cheese smothered toast, it seemed a bit tiny.  However each little square was packed with cheesy garlicky goodness. Because all the food was abundant, we actaully didn't manage to eat the 4th piece.  Really packed a punch!  \nService was very attentive. Waiters as well as servers and busers abounded. \nThe place was a little too lively in sound for me.  I personally don't like when I have to struggle to hear or be heard.  I enjoyed my time and my meal there and like I said this is a keeper, because the food was so good, the menu so varied and there is so much to try, we be going back!!    \nThey also have round tables,  I think round tables are more conducive to conversation!!!  They also had a section where they could put long tables together for large parties!!  \nPretty amazing and amusing drink menu.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-24T13:30:20-0400", "location_id": "5073404", "id": "431323053", "user": {"username": "PaulaM549", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Food is to die for.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r431274985-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review431274985", "text": "Went there on a business trip in September (we went for lunch). Given the number of people in our group, we got to try a variety of different items on the menu:\n\nStarters:  Wild Mushroom Stogies, Artichoke Cheese Dip - VERY good\nMy main course:  Blue Gnocc -n- Cheese (thought I'd died and gone to heaven on first bite - YUM!!!)\nFlank steak salad: Co-workers had and really liked, I didn't try them.\nDesserts:  Ho-Ho chocolate cake, Vanilla Bean Crème Brûlée - also very good\n\nThe food was all very good to excellent and they had a good selection of different items to choose from. \n\nThe service was also very good. All the servers were very nice, polite, attentive, and  very accommodating. The manager even stopped by to see how we were all doing. \n\nBased on some of the questions TripAdvisor asks, I'm not sure this would be the best restaurant to take kids since it IS a bar/restaurant and as such, aimed at an adult clientele. It is also a bit on the smaller side, so I'm not sure how well they could accommodate a really large group of people, but given the quality of the food I'd call and ask anyway if you were interested in taking a larger group of folks there. :-)\n\nThis is one of the best restaurants food-wise I've eaten so far in the San Mateo area. Can't wait to go back again!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-10-24T10:47:41-0400", "location_id": "5073404", "id": "431274985", "user": {"username": "CBtph", "user_location": {"name": "Denver, Colorado", "id": "33388"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "Top of My Blacklisted Restaurants", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r417810946-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review417810946", "text": "How does a restaurant who was on my top 5 favorites move to my top blacklisted ones? Very RUDE customer service!! Went there for brunch with my friend who has a medical condition requiring constant hydration and some diet restriction. He ordered a Coke immediately when we're seated in spite of bringing his own beverage due to his hydration issue. He also requested if he can have his bacon freshly made. Before we know it, we have the manager telling us that we should not be bringing in our own beverage. First we don't see any sign that says that and if it's our intention to scrimp on beverage we would not have ordered a Coke once we got seated. Then she said by requesting the bacon freshly made we are implying they're not doing that. My! My! She accused us also of disrespecting her server by these actions. That TOTALLY ruined our mood for brunch!!!! What kind of restaurant treats their customers this way? HORRIBLE!!!! DEFINITELY never coming back!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-13T00:33:42-0400", "location_id": "5073404", "id": "417810946", "user": {"username": "V4c4t10n3r88", "user_location": {"name": "Foster City, California", "id": "32405"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Excellent brunch and service", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r411840843-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review411840843", "text": "I'm really glad we came back to give Three a Second try. On the previous visit the food was good but our server was very unpleasant. On this visit everyone was very friendly and the service was first class. \n\nWe had various eggs Benedict dishes and really like them. \n\nThe Lavazza coffee was very good. \n\nBe sure to save room for dessert. They offer a lot of decadent choices. We went for the S'more Baked Alaska and it was a work of art on the eyes and tastebuds.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-28T07:28:00-0400", "location_id": "5073404", "id": "411840843", "user": {"username": "RobLK", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Very very good", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r400175854-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review400175854", "text": "Went with a big group for Sunday brunch.  Quality was very good.  Also some interesting dishes like salmon pizza, lamb burger... etc.\n\nRecommend reservation first.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-01T15:33:06-0400", "location_id": "5073404", "id": "400175854", "user": {"username": "catsladder", "user_location": {"name": "Mountain View, California", "id": "32761"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "A nice surprise", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r396952266-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review396952266", "text": "Friday night with no plans.  Checked OpenTable for San Mateo restaurant and found Three Restaurant and Bar with some great reviews.  Did not realize that it had formerly been Astaria until we arrived.  Friendly service, somewhat loud, good variety on the menu, and a decent value.  We'll hang on to this one for a return visit.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-25T14:40:08-0400", "location_id": "5073404", "id": "396952266", "user": {"username": "Tony J", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Casual and eclectic", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r388363648-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review388363648", "text": "Had a light Sunday dinner there recently.  Good selection of beers and wines - not overpowering.  Had a pear hard cider that was refreshing after a hot day.  Good menu is unusual but has interesting choices.  Mushroom cigar butt appetizer was light and tasty.  Individual peach and prosciutto pizza was unusual but very well done and hit the spot - good match of sweet and salty and just the right size.  Salad entrees were fresh and filling.  Carrot cake was fine but kind of ordinary and a bit heavy - have had better.  Service was attentive but not intrusive.  Could be a bit noisy when room is full - many hard surfaces.  Fortunately, not too packed on Sunday night.\n\nOver all, an interesting place with good food that is well worth trying.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-02T02:29:37-0400", "location_id": "5073404", "id": "388363648", "user": {"username": "cstotter", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-06", "title": "Not bad", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r387546128-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review387546128", "text": "Sweet potato chips are great, service is wonderful. I had the Blue Shroom, which is portobello mushroom sandwich with blue cheese and arugula. It could've been great if it weren't so salty. The dessert Ho-Ho was not bad but definitely not impressive.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-29T12:14:02-0400", "location_id": "5073404", "id": "387546128", "user": {"username": "Westye", "user_location": {"name": "California", "id": "28926"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Service was good, food was so so", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r370459526-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review370459526", "text": "Four of us had dinner there last night, and it was not as good as our previous two visits.  The service was quick and courteous, but the food was only so s0  in general and the music was too loud for a site with a lot of ambient noise from diners and bare walls.  Two had the French onion soup and one had the carrot tarragon soup and all three were well-satisfied.  The Caesar salad and Thai salad were only so so.  The Thai salad in particular was quite large but devoid of distinctive flavor. This is a town with a lot restaurants, and I hope that management will step up its game to be competitive.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-05T09:54:19-0400", "location_id": "5073404", "id": "370459526", "user": {"username": "tultrip", "user_location": {"name": "Dixon, California", "id": "32301"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Fantastic food and great service", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r368147429-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review368147429", "text": "We had a family dinner to celebrate our granddaughter's performance in The WIZ.  Everything was perfect.  Everyone's meal was delicious and Stephanie provided great service.  The bacon bits appetizer was quite a treat.  The restaurant provided a special \"Congrats\" dessert for our granddaughter, which made her feel very special. They offer their meals in a regular size or a larger size for sharing.   We highly recommend this restaurant.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-27T07:25:01-0400", "location_id": "5073404", "id": "368147429", "user": {"username": "NOJORV", "user_location": {"name": "Sacramento, CA", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Good food, poor service", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r352960617-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review352960617", "text": "Had brunch here with friends. Stood at least five minutes at the host stand with no one there to help. Throughout the meal, the service was friendly but laxidaisical and inattentive. The menu had some interesting and innovative items, and the food was generally good. It was relatively quiet at 11:00, but got quite busy and loud once we hit the peak hour. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-03-04T13:29:34-0500", "location_id": "5073404", "id": "352960617", "user": {"username": "Travelhui", "user_location": {"name": "Washington DC, District of Columbia", "id": "28970"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-02", "title": "Disappointed in the fried chicken but great bar", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r348013105-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review348013105", "text": "I always want to support local businesses and especially any women owned business. On the hunt for good fried chicken, my friend and I both ordered the same thing, except she ordered all white meat and I ordered dark meat. Mine was dried and super crusty. It was over fired that I asked the nice waitress if they were freshly made or re-fried? She assured me that it was freshly made but I am a good cook, I know what a re-fried meat looks like. I took the leftover home and peel the crust off to see how much chicken was actually underneath all that crust. Turned out, the meat is cut very thin, 1/2\" or even less. Perhaps for fast cooking but the batter was coated so thick to increase the thickness of chicken, it made it horrible because it's all over-fried crust and very thin and little meat. Even if the chicken was organic or whatever, it's pointless by the time it's done. I wish I have taken a photo to show you the cut open chicken on my plate. It was so dark and ugly, I didn't bother. \n\nWith all that being said about one dish, I have to say this place is great for bar food and happy hour. Excellent appetizers and drinks. It's one of favorite gather places in San Mateo. I only wish it's isn't so noisy when the place is full of people. I'll still go back there but just not for fried chicken. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-02-15T12:42:46-0500", "location_id": "5073404", "id": "348013105", "user": {"username": "TeaHsu", "user_location": {"name": "San Mateo, California", "id": "33031"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-02", "title": "Favorite Place in Town, Very Good Consistently", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r345094593-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review345094593", "text": "A casual but trendy place with good food and drink. Recent weekday dinner for four was delicious! After a few custom beverages we dove into the meat loaf (ample and tasty serving), the cod, and chicken apple salad. All were very tasty. We shared a small sundae for dessert and good coffee. We'll be back and back. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-02-04T20:00:29-0500", "location_id": "5073404", "id": "345094593", "user": {"username": "John G", "user_location": {"name": "Afton, Minnesota", "id": "29579"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-11", "title": "Best burger on the Peninsula ", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r342942018-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review342942018", "text": "Really, it's ground in house from 3 cuts of meat. How I love it with a Brother Thelonius ale. My husband has had lots of the different sandwiches, all good. My only complaint is they have become so popular that it is very difficult to get bar seating now. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-01-26T14:39:47-0500", "location_id": "5073404", "id": "342942018", "user": {"username": "AnnetheRaven", "user_location": {"name": "Burlingame CA", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Very Accomidating", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r286753653-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review286753653", "text": "This place has a great menu and gluten free and vegan options as well. My grandson wanted a grilled cheese and it was not on the kids menu. They made him one with marble rye and it was fantastic. I had the pear cider, it was so very good and a salad. Everything was great. Really enjoyed our experience there. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-07-08T07:45:45-0400", "location_id": "5073404", "id": "286753653", "user": {"username": "Halfwhit", "user_location": {"name": "Kennewick, WA", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-06", "title": "Good food, variety, small plates, brews", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r285348971-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review285348971", "text": "Always  nice spot and well run by the management. A variety of small plates, entrees and beverages. Creative and tasty. Not expensive for a good meal. Good service, too. You can have a conversation here, something that you cannot say about many restaurants in the area. This is a popular place, so do consider reservations.\nParking in San Mateo has become a challenge, but this is not the fault of this restaurant; they're all going to struggle with it in this location.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-07-03T11:21:17-0400", "location_id": "5073404", "id": "285348971", "user": {"username": "Bart C", "user_location": {"name": "Foster City, California", "id": "32405"}}}, {"lang": "en", "rating": 3, "travel_date": "2014-10", "title": "Very rushed service", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r264542726-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review264542726", "text": "Our dining experience was ruined by staff that seemed rushed to turn tables. Food was average, but we probably would not be back as we felt that it wasn't worth it to endure sub-par service.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-04-08T13:50:12-0400", "location_id": "5073404", "id": "264542726", "user": {"username": "Avrilx", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-03", "title": "Great promise, spoiled", "url": "https://www.tripadvisor.com/ShowUserReviews-g33031-d5073404-r262569855-m11068-Three_Restaurant_and_Bar-San_Mateo_California.html#review262569855", "text": "What started really nicely with excellent starters was spoiled by a poor quality NY Strip main, which was about 20% gristle, and two frozen solid Baked Alaska lemon meringues, with inedible sponge cake. What was worse is that we mentioned the problem with the NY strip steak to the waiter, who said he'd speak to the kitchen... then for the rest of the meal we were sheepishly ignored and no-one bothered to speak to us or engage with us again. Very disappointing because the venue could have great atmosphere and the menu is interesting and different.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-03-29T20:26:54-0400", "location_id": "5073404", "id": "262569855", "user": {"username": "Martin G", "user_location": {"name": "Folkestone, United Kingdom", "id": "190749"}}}]}