{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Love these massages", "url": "https://www.tripadvisor.com/ShowUserReviews-g33037-d9851371-r408962152-m11068-Mill_Valley_Massage-San_Rafael_Marin_County_California.html#review408962152", "text": "I've been getting massages at Mill Valley Massage in San rafael for a couple of years now -- always good and I highly recommend it.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-08-22T15:31:35-0400", "location_id": "9851371", "id": "408962152", "user": {"username": "balihi2047", "user_location": {"name": "sausalito, california", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-02", "title": "Fantastic Massage with Stephen", "url": "https://www.tripadvisor.com/ShowUserReviews-g33037-d9851371-r346777924-m11068-Mill_Valley_Massage-San_Rafael_Marin_County_California.html#review346777924", "text": "I was visiting my sister in San Rafael and experiencing intense neck pain and could no longer turn my neck.  My sister recommended I call Mill Valley Massage in San Rafael and they were able to work me in after asking if I had a preference for a male or female massage therapist.  \n\nThe location is central to downtown San Rafael, in a nondescript storefront, but once entering, the facility was calm and well-designed and the receptionist kind and welcoming.  I was assigned to Stephen, a new, young LMT who has talent beyond his short time as an LMT. Stephen was in the reception area waiting for his client to come out and when he did, he complimented Stephen on a wonderful massage.  That was good news and promising!\nI've had hundreds of massages over the past 50 years, but rarely had I been in as much pain and stiffness as I was at the time.  We walked to the massage room where Stephen asked me my concerns and we figured out a plan of attack, and he left me to disrobe.  The table was heated and comfortable.\n\nStephen worked the offending muscles for a full 90 minutes, taking care to ask about the level of pressure.  He knows his stuff!  Stephen's prior work involved caregiving for memory-care elders, and his compassion and kindness and love of people shone through during our conversation.  He's a very intuitive young man, and over the course of our wide-ranging and enjoyable discussion diagnosed - properly I believe - the root of my tension and pain.  Also, as a female, I never felt uncomfortable as I have at times with other male therapists.  Stephen's techniques provided excellent privacy and coverage at all times.\n\nI left feeling better and continue to improve, thanks to Stephen's excellent deep tissue work.  The pain is gone, and I can finally turn my neck again.  This wonderful man understands musculature well, and he truly customized the massage for my particular needs.\n\nI cannot recommend Stephen highly enough.  If you live in this area, or if you're visiting, you deserve to have Stephen provide you with a world-class massage.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-02-10T22:07:32-0500", "location_id": "9851371", "id": "346777924", "user": {"username": "LegacyPlanner", "user_location": {"name": "Salem, Oregon", "id": "52053"}}}]}