{"paging": {"total_results": "3", "skipped": "0", "previous": null, "results": "3", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Overpriced and trendy", "url": "https://www.tripadvisor.com/ShowUserReviews-g33055-d10717101-r424153859-m11068-Seed_to_Leaf_Organics-Santa_Rosa_Sonoma_County_California.html#review424153859", "text": "This was a bad idea on a hot day, this small place has no AC. We ordered water and juice and it took them over 15 minutes. We ordered two appetizers, they were extremely small, no more then a couple bites and over priced. The juice was small and bottled and over $8, they said it would take 30mins for fresh juice. The service was extremely slow, and very pretentious when answering questions, pretty much awful. It took almost 2hours from ordering to leaving, 2 waters, 2 bottles of juice, a veggie and humus plate, 2 salads and 2 micro bowls, with tip over $100. The server came to the table twice to apologize for how long they were taking, they kept going on their phones, there were ONLY 2 tables being helped the place was pretty empty, it was like an episode of Portlandia. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-01T10:34:36-0400", "location_id": "10717101", "id": "424153859", "user": {"username": "Sarai4me", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "This gets a \"Very Good\" just because it's vegan", "url": "https://www.tripadvisor.com/ShowUserReviews-g33055-d10717101-r405084247-m11068-Seed_to_Leaf_Organics-Santa_Rosa_Sonoma_County_California.html#review405084247", "text": "This is a casual, little vegan restaurant in the heart of downtown Santa Rosa, right on the square. The menu has a decent array of entree choices and quite a few healthy beverages (I was there for dinner). The food is fresh and tasty for the most part. The purple nachos stand up to traditional nachos, and I would recommend them if you're craving classic Mexican done vegan.  The stacked lasagne was also savory and worth a try. The pizzettes, unfortunately, I would avoid, as it's essentially just a chubby hors d'ouvre - -  greens piled on a cracker. It was cold and crunchy and not what the name \"pizzette\" conjures at all (at $11 also poorly priced for the bite).  The ambience is a mixed bag - visually comfortable, but the wooden bench seating has no cushions (and the comfort of a puritan church pew) and there are large TV's/monitors hanging over the bar which were irritating (and do nothing to compliment the healthy vibe). The staff was super friendly and attentive.  Despite a few criticisms, I would return and recommend this restaurant if for no other reason vegan restaurants are a rare thing and these guys do it OK. It's also in a great spot for coming or going to the movies, the mall or strolling downtown. Try it.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-13T18:19:20-0400", "location_id": "10717101", "id": "405084247", "user": {"username": "SonomaTrekker", "user_location": {"name": "Northern Cal", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Giving it a \"Very Good\" for being 100% vegan, as these are hard to come by", "url": "https://www.tripadvisor.com/ShowUserReviews-g33055-d10717101-r403181583-m11068-Seed_to_Leaf_Organics-Santa_Rosa_Sonoma_County_California.html#review403181583", "text": "Seed to Leaf is a cute, casual 100% vegan restaurant right on Courthouse Square in downtown Santa Rosa. The menu has a decent list of meal options and a quite a few beverage options. When the food came it was colorful, fresh, nicely presented and tasty, though \"average\" in flavor. The \"purple nachos\" were definitely up to traditional nachos standards, and the \"stacked lasagne\" offered a tower of juicy veggies in a decent sauce. Both worthy of re-order, The pizzette I would avoid - it essentially comes on a cracker (a tasty cracker, but not what one expects from the word \"pizzette\"). Moreover, the pizzette is served cold and is about the size of a hors d'ouevre (at $11) . The staff was friendly, a definite A+. The ambience is a mixed bag - - attractive decor for the most part, but their bench seating needs cushions (they have all the comfort of an Amish church pew) and I could have done without the giant TV screen/monitor over the juice bar (incongruous design element for a place trying to offer a natural, healthy dining experience).  But the bottom line is, this is a VEGAN restaurant which makes it an oasis for those who want healthy, vegetarian dining, and I would go back again. It also get bonus points for location - walking distance to everything, including the movie theatre!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-08-09T05:24:47-0400", "location_id": "10717101", "id": "403181583", "user": {"username": "SonomaTrekker", "user_location": {"name": "Northern Cal", "id": null}}}]}