{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Nice Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r437248144-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review437248144", "text": "We got to the hotel and the girl at the front desk was very nice and we did get the room we booked and it was clean and had nice view to Bay St. The only complaint would be the carpet at the end of the tile entryway was missing a corner but I did find out that they are replacing all the carpet in the rooms but did not get to our floor yet. The king size bed was comfortable along with the pillows. Breakfast comes with the stay and it's your normal chain quality which was ok. We decided to go off site after a couple days to get a different type of breakfast We used the rooftop hot tub almost every morning which was clean and nice we didn't use the pool because it was quit chilly out. I want to give a shout out to Sonja she is the concierge at this Holiday Inn and she is the most pleasant, happy, outgoing, knowledgeable person I have ever met at a hotel chain. They have a gem with her and hopefully realize that. She is a big part why my wife and I will be coming back to stay here. If you stay here you need to reach out to her for any of your excursions or dinner needs. Thank you Sonja for all your kindness and help we will miss you and feel like we made a new friend in you. So our stay at Holiday Inn was a nice stay the room was nice and a nice size  The only thing I think they could improve on is the quality of the breakfast and mix up the entree from day to day. Hopefully your stay will be as great as ours was. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-14T15:54:01-0500", "location_id": "6610151", "id": "437248144", "user": {"username": "Scott V", "user_location": {"name": "Ballston Spa, New York", "id": "47274"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "A pleasant surprise ", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r436883863-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review436883863", "text": "Location: amazing-perfect actually. Walking distance to everything pretty much\nCleanliness: acceptable\nCustomer Service: excellent\nUpkeep: the gym was a little sad and there were some small things in the room that you would notice, but overall it was really nice\nParking: Valet is $27. And finding another spot...good luck...", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  They’ll be very pleased to hear your praise.  We are thrilled to hear you found our location to be amazing – perfect actually.  By the way, our concierge team is happy to direct you to Savannah’s great attractions and dining during your next stay with us. Safe travels!\n\nBrian Rafferty, General Manager\n", "title": "Owner Response", "published_date": "2016-11-16T08:39:42-0500", "id": "437839465"}, "trip_type": "Couples", "published_date": "2016-11-13T09:39:01-0500", "location_id": "6610151", "id": "436883863", "user": {"username": "Tara P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-11", "title": "Far Below Average", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r436867491-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review436867491", "text": "There is a severe lack of attention to detail and just plain bad customer service in this establishment. \n\nFirst, the parking choices are either $27/day valet parking or street parking in a not-so-great neighborhood. We refused to pay such an ridiculous fee for parking and I can't imagine what they could possibly have done to make it worth that price. We parked on the street and had to walk a few blocks to our car but it was perfectly fine other than that. \n\nWhen we attempted to check in we couldn't remember whose name the room was under (our bad) so we had the woman check for both of our names. We carefully spelled our names and after looking for about 10 seconds she loudly declared that we were at the wrong Holiday Inn and would have to leave. We finally found our confirmation number to prove to her we were at the correct place and after finding it she rudely declared that we should have just told her the correct name for the room in the first place. Being fed up and embarrassed I snapped at her that we had spelled that exact name out letter for letter not 5 minutes earlier. She laughed it off and I was too angry to push it. \n\nThe room we got was not cleaned well or we'll attended to. The clock had yet to be changed for daylight savings two weeks earlier, there was what appeared to be a large splatter of an unmentionable bodily fluid across one the pictures above the bed, the drain cover in the sink was missing, the information booklet was missing all of the pages, and we were left with only about a quarter roll of toilet paper which when we called the front desk to ask for more they could not be bothered to bring it up to us and they said very snarkily and with no apology that if we wanted it, we'd need to come to the front desk ourselves. There was an apparent lack of water filtration as all of the water had a strong sulfur odor and taste. And finally, we were kept up much of the night because there was very little if any sound proofing and we could hear doors slamming throughout our entire floor. \n\nNeedless to say, we would not stay here again nor would we recommend it to anyone. We were very disappointed with our choice. There are cheaper options in the area with much better customer service and amenities.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Thank you for your business and open feedback.  We take all feedback seriously, and sincerely regret that we did not meet your expectations.  We would like to discuss the matter directly so that we can work towards a suitable resolution and restore your faith in our hotel and service team.  Please contact myself, or another member of our management team directly at your earliest convenience.  You can reach me at (912) 790-1000.  Thank you.", "title": "Owner Response", "published_date": "2016-11-16T08:37:08-0500", "id": "437838865"}, "trip_type": "Couples", "published_date": "2016-11-13T08:37:01-0500", "location_id": "6610151", "id": "436867491", "user": {"username": "Liz H", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Great hotel, still awaiting deposit return", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r436717850-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review436717850", "text": "My stay at the hotel was great. The room was clean, the staff were friendly and the amenities were in great shape. My biggest concern is that I haven't been refunded the US$250 deposit that was taken at the beginning of my stay. It has now been over 3 weeks since I checked out and am back home in Australia, and despite sending an email, I have had no response.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  They’ll be very pleased to hear your praise.  We are thrilled to hear you found our staff to be friendly – we pride ourselves on delivering a memorable hotel experience during your travels.  By the way, our concierge team is happy to direct you to Savannah’s great attractions and dining during your next stay with us. Safe travels!\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-11-16T08:44:02-0500", "id": "437840525"}, "trip_type": "Business", "published_date": "2016-11-12T19:11:03-0500", "location_id": "6610151", "id": "436717850", "user": {"username": "TomandKarly", "user_location": {"name": "Wollongong, Australia", "id": "255333"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-11", "title": "Way overpriced!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r434692517-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review434692517", "text": "At best an average room with noisy conditions. Found unidentifiable remains when I moved chair. Front desk staffed by robots. Refrigerator sounds like an angry hornet. A/C blows like north wind. About half the TV channels work. Valet parking only option. Can you tell I'm underwhelmed! All for a mere $400 a night plus the $27 parking fee. Go somewhere else. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Thank you for your business and open feedback.  We take all feedback seriously, and sincerely regret that we did not meet your expectations.  We would like to discuss the matter directly so that we can work towards a suitable resolution and restore your faith in our hotel and service team.  Please contact myself, or another member of our management team directly at your earliest convenience.  You can reach me at (912) 790-1000.  Thank you.\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-11-08T06:57:39-0500", "id": "435614958"}, "trip_type": "Family", "published_date": "2016-11-04T17:56:46-0400", "location_id": "6610151", "id": "434692517", "user": {"username": "John31210", "user_location": {"name": "Macon, Georgia", "id": "60920"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-11", "title": "Unscrupulous and Rude", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r434572957-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review434572957", "text": "Both the front desk attendant and manager were beyond unhelpful. Refused to give me a RECEIPT. The AC was broken. I couldn't be moved to another room because the hotel was full, so they brought up an industrial fan from the laundry room, which blew lint everywhere and sounded like a jet engine on the lowest setting. I was told I would receive a discount for my discomfort. \n\nI work for a state institution and brought the state tax-exempt paperwork with me so they would remove that charge from my bill. I only got about 2 hours of sleep because of the noise and temperature of the room. To compensate me for my \"inconvenience,\" I was told I would be given a 25% discount (as an aside: this doesn't compensate me at all, since my company paid for the room). When I asked for a receipt to confirm that the 25% refund and the state taxes had been removed, the desk attendant refused. She had the paperwork in her hand, but would not give it to me. I asked for the manager, who also said that it was against hotel policy, and that I needed to speak with hotels.com for the receipt. I have never had this problem with any other hotel I have booked through this site. My receipt on hotels.com does not reflect any of the changes were made, and neither does my credit card statement. They lied, and were rude and disrespectful to boot. Because of my experience, I will NEVER stay at that hotel, or any Holiday Inn ever again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Thank you for your business and open feedback.  We take all feedback seriously, and sincerely regret that we did not meet your expectations.  We would like to discuss the matter directly so that we can work towards a suitable resolution and restore your faith in our hotel and service team.  Please contact myself, or another member of our management team directly at your earliest convenience.  You can reach me at (912) 790-1000.  Thank you.\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-11-08T06:55:39-0500", "id": "435614512"}, "trip_type": "Business", "published_date": "2016-11-04T07:22:29-0400", "location_id": "6610151", "id": "434572957", "user": {"username": "Sarah B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Ok place....good location", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r433254526-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review433254526", "text": "My husband and I stayed here for two nights.  Our room was clean and the bed comfortable.  It is in a good location in the historic district...we walked everywhere.  It is close to the trolley stop and plenty of restaurants and within walking distance to the waterfront area.  The valet parking attendants did an exceptional job.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  The valet team will be very pleased to hear your praise.  We are thrilled to hear you found your room to be clean and comfortable and our location to be within close walking distance to area attractions.  By the way, our concierge team is happy to direct you to Savannah’s great attractions and dining during your next stay with us. Safe travels!\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-11-01T14:15:05-0400", "id": "433769665"}, "trip_type": "Couples", "published_date": "2016-10-31T07:52:24-0400", "location_id": "6610151", "id": "433254526", "user": {"username": "lynne G", "user_location": {"name": "Dyersville, Iowa", "id": "37861"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Modern Facility undertrained staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r433074859-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review433074859", "text": "Five day stay with tour group.  First morning, breakfast buffet not in effect.  One server who took order, cooked order, served order.  Hotel with 160 rooms???  Remainder of visit buffet back on line.  Nothing to write home about.\nHotel still recovering from Hurricane Matthew but staff seems undertrained.  Have you ever entered a Holiday Inn at 5 pm to find NO ONE staffing front desk for TEN MINUTES (Tuesday October 25)?  \nSpouse encountered couple who were unable to obtain replacement towels and TP for several days who then checked out early.  No self parking option either.\nOverdesigned by someone unaware that placing TP holder 18 inches from toilet and behind you is somewhat useless.  Toilet should be placed 8 inches closer to counter and farther from shower tub\nHotel is directly adjacent to Savannah Public Housing Authority which abuts a very large public housing complex.  St Julian street across has missing street light which makes for a very long dark block to get to City Market (not hotel's responsibility obviously).  Marginally dicey area compared to other options but convenient to Historic District.  \nSmall easily accessible business center but needed assistance to get printer to connect with computer (one of each only) to print boarding passes.\nKey system somewhat defective as usually required 2-3x to get it to function.\nEntry on MLK Drive not open while pedestrians discouraged from using driveway so somewhat perplexed as to how to enter since MLK entrance required key to open; if checking in rather a puzzle\nAwkward rolling desk in room high design minimal functionality.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Thank you for your business and open feedback.  We take all feedback seriously, and sincerely regret that we did not meet your expectations.  We would like the opportunity to discuss your experience directly so we can work towards a suitable resolution and restore your faith in our hotel and service team.  Please contact myself, or another member of our management team directly at your earliest convenience.  You can reach me at (912) 790-1000.  Thank you.\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-11-01T14:21:25-0400", "id": "433771434"}, "trip_type": "Friends getaway", "published_date": "2016-10-30T16:10:54-0400", "location_id": "6610151", "id": "433074859", "user": {"username": "Robert F", "user_location": {"name": "San Rafael Ca", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Best stay!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r432063436-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review432063436", "text": "I loved this hotel!! it is right in the heart of Savannah with all the amenities and sightseeing that you need. The swimming pool upstairs is cozy and very clean. Rooms are very clean, high ceiling which makes up for the size of the room and very comfortable bed. We didn't have breakfast, but they offer a coffee machine in the room which makes proper coffee. I wished we stayed longer in that hotel as I found it was fantastic and very relaxing.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  They’ll be very pleased to hear your praise.  We are thrilled to hear you loved our hotel and location – we pride ourselves on delivering a memorable hotel experience during your travels.  By the way, our concierge team is happy to direct you to Savannah’s great attractions and dining during your next stay with us. Safe travels!\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-10-29T08:51:58-0400", "id": "432689091"}, "trip_type": "Couples", "published_date": "2016-10-27T01:58:10-0400", "location_id": "6610151", "id": "432063436", "user": {"username": "Ana R", "user_location": {"name": "London, United Kingdom", "id": "186338"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Could be better ", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r428970665-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review428970665", "text": "My wife and I stayed at this hotel for a four day weekend trip. Our biggest complaint is that housekeeping doesn't do a very good job with the bathroom during the daily service. It seen that they just spot cleaned - floor not mopped, tub not scrubbed, etc. Other than that, the location is great and the desk staff friendly. Be aware that the only hotel parking is valet at $27 per day. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  They’ll be very pleased to hear your praise.  We are thrilled to hear you found the location to be great and the desk staff friendly – we pride ourselves on delivering a memorable hotel experience during your travels. Please accept our sincere apologies for the inconveniences experienced with the housekeeping service.  I have shared your valued feedback with the appropriate team to ensure that this remains an isolated issue.  By the way, our concierge team is happy to direct you to the fasted routes or to some great attractions and eating during your next stay with us. Safe travels!\n\nBrian Rafferty, General Manager\n", "title": "Owner Response", "published_date": "2016-10-20T14:27:10-0400", "id": "430145736"}, "trip_type": "Couples", "published_date": "2016-10-17T17:35:45-0400", "location_id": "6610151", "id": "428970665", "user": {"username": "RU4Real2", "user_location": {"name": "Middletown, Ohio", "id": "50654"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Room", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r426493563-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review426493563", "text": "The room was undesirable. Looked like it wasn't even cleaned. When turning down covers to retire for evening found a hair on my pillow. Bathroom was rundown. Chips on the tub made it difficult to want to take shower. No closet in room. \nThe area was dangerous. Was told there was a shooting a block from the hotel the night wee were there. \nOn the upside the staff was pleasant and check in was quick. If the room was half as good as the staff I would have been satisfied. The good thing was that I only stayed one night.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Thank you for your business and open feedback.  We take all feedback seriously, and sincerely regret that we did not meet your expectations.  We would like to discuss the matter directly so that we can work towards a suitable resolution and restore your faith in our hotel and service team.  Please contact myself, or another member of our management team directly at your earliest convenience.  You can reach me at (912) 790-1000.  Thank you.", "title": "Owner Response", "published_date": "2016-10-20T14:24:21-0400", "id": "430145284"}, "trip_type": "Couples", "published_date": "2016-10-09T15:27:10-0400", "location_id": "6610151", "id": "426493563", "user": {"username": "570carolynt", "user_location": {"name": "Hollywood", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Very nice hotel, great location!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r426209978-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review426209978", "text": "Stayed here on a trip for a reunion with Brothers I served with in Vietnam.  The trip was cut short due to a visit from hurricane Matthew, but still had a great time.  Hotel is centrally located in the historic section of Savannah.  Lots of beautiful buildings and sites.  The hotel has a terrific, very friendly staff.  Not a place to visit on a budget though.  Valet parking only, but extremely secure.  Would love to go back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  Our team will be pleased to hear your praise.  I hate your visit was cut short due to Hurricane Matthew and hope you have the opportunity to visit again under better weather circumstances.  Safe travels!\n\nBrian Rafferty, General Manager", "title": "Owner Response", "published_date": "2016-10-20T14:23:12-0400", "id": "430145101"}, "trip_type": "Friends getaway", "published_date": "2016-10-08T14:22:11-0400", "location_id": "6610151", "id": "426209978", "user": {"username": "Daddagreat", "user_location": {"name": "Myerstown, Pennsylvania", "id": "53272"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Beautiful lobby", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r425336668-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review425336668", "text": "We stayed  Asa couple and had an excellent experience.  Other than always seeing the  clean up crews working mess  every time we came and went even after 4 pm.  It was like they didn't have a place to store this carts to reset the rooms or just sloppy but I tend to think the first.  Rooms were updated and modern. Bed was good and the husband is particular. As a manger it is as nice to find that the only problem was the reset carts. Every employee spoke to us  when we passed  or  interacted,and  always let us have the elevator first. The lobbies were beautiful more than usual for a holiday Inn ( see picture ) overall a very pleasant experience. Fix the maid thing I'll give you a 5!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-05T09:15:01-0400", "location_id": "6610151", "id": "425336668", "user": {"username": "Diane B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Great hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r419600459-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review419600459", "text": "Hotel was very nice. It was convenient to River Street and Restaurants.  Rooms was clean. Parking is expensive however location of hotel makes up for the expensive parking.  We were able to walk the historic district. I would defiantly come back to this hotel.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  They’ll be very pleased to hear your praise.  We are thrilled to hear you found the hotel to be nice and clean – we pride ourselves on delivering a memorable hotel experience during your travels.  By the way, our concierge team is happy to direct you to Savannah’s great attractions and eating during your next stay with us. Safe travels!\n\nBrian Rafferty, General Manager\n", "title": "Owner Response", "published_date": "2016-09-24T06:53:06-0400", "id": "421756875"}, "trip_type": "Family", "published_date": "2016-09-17T14:35:29-0400", "location_id": "6610151", "id": "419600459", "user": {"username": "Montolb", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Best hotel in Savannah ", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r419319748-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review419319748", "text": "This place has been amazing! The location is great. The views are great! And the Staff has been amazing! Joanta is by far one of the best staff members I have met at any hotel! She went ABOVE AND BEYOND to help accommodate my girlfriend and I and made our stay absolutely incredible! I will definitely be back for another visit here! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "On behalf of our front office and valet teams, it was our pleasure to welcome you to our hotel.  Joanta and our entire team will be very pleased to hear your praise.  We look forward to your next visit to Savannah.  Safe travels!\n\nBrian Rafferty, General Manager\n", "title": "Owner Response", "published_date": "2016-09-24T06:40:45-0400", "id": "421751294"}, "trip_type": "Couples", "published_date": "2016-09-16T19:01:33-0400", "location_id": "6610151", "id": "419319748", "user": {"username": "TJ M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-09", "title": "another visit", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r417650506-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review417650506", "text": "I visited this location this past weekend. The staff was quite nice, hotel looked impressive, breakfast was great and the bed was comfortable. I liked certain things and disliked others at this location.  Walking in one direction, you were in party city, walk in another direction, we found ourselves in an uncomfortable area. Riverfront walking was a few blocks away.  Valet parking was $27, street parking was nonexistent.  Something I found very interesting were the room types.  The 1st room we were assigned was as you normally find in a HI hotel.  Moved though because the TV didn't work.  The 2nd room was about 2x the size of a bathroom. The bed was right at the door, you open the door, the bed was a couple inches to the right (not good). No micro nor fridge.  Moved again though because I needed a fridge and for whatever reason, one could not be brought to the room. 3rd room had a drain in middle of bathroom floor, hair stuck to the wall (???), hair accessories and candy on floor, NO CLOSET, iron and ironing board on floor in corner, Bay street side, very noisy.  Kinda wished I could go back to the room without a TV.  The rep on duty did her very best to accommodate us and comped our breakfast in a good faith effort to compensate for the hotels' short comings, all with a sincere smile.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Brian R, General Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Dear lotsoflongtrips,\n\nThank you for taking the time to share your experience.  I’m glad to hear you found our staff to be accommodating and enjoyed the comfort of your bed along with breakfast in our restaurant.  I apologize for the challenges you faced with the variety of room types.  We strive to satisfy our guests and appreciate your feedback.  I hope you will give us the opportunity to serve you on your next trip to Savannah.\n\nBrian Rafferty, General Manager\n", "title": "Owner Response", "published_date": "2016-09-14T14:04:24-0400", "id": "418616452"}, "trip_type": "Couples", "published_date": "2016-09-12T15:18:54-0400", "location_id": "6610151", "id": "417650506", "user": {"username": "lotsoflongtrips", "user_location": {"name": "atlanta, ga", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Nice location!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r410667448-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review410667448", "text": "Stayed at this hotel for one night Aug. 12th 2016.  The check-in was fast and every staff member was extremely nice from the valet guys that gave out free bottles of water, to the nice people at front desk, housekeepers and guy behind the bar.  The location is just a few blocks from Paula Deen's restaurant and one of the squares with outdoor music and entertainment, so we could just walk there. The pool on the roof was very nice.  While we were there our cell phones went off with an Amber Alert and just as we were getting ready to settle back to sleep, the fire alarm went off @ about 2:00 in the morning so we had to evacuate until the fire trucks came and cleared everyone to return to our rooms.  The next morning one of the two washer machines was broken, but the girl at the front desk game me some more quarters so I could start again. Also, the tub/shower faucet was stripped so it was difficult to turn on or control the water.  The pleasant staff made up for any of the hotel's short coming, as it could use a good face lift.  Grace", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "IHGService, Guest Relations Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Dear hueytod,\n\nThank you for your feedback and for staying with us. We realize you have many choices when it comes to lodging, and we sincerely appreciate your business with us. I am glad to read your positive feedback on the great services received from our staff and you have found the location of the hotel convenient to your needs. However, we are truly sorry if your stay was not a complete satisfactory due to the fire alarm that went off and the condition of the washer machines. We take all of the reviews we receive very seriously as they allow us to identify areas that may benefit from additional attention. Rest assured that these concerns will be addressed immediately to the hotel management and necessary actions will be taken, to meet the needs and comfort of our guests.\n\nThank you for staying with us and we hope to offer you a more pleasant stay in the future.\n\nSincerely,\n\nGrace P.\nCase Manager\nIHGService\n\n", "title": "Owner Response", "published_date": "2016-09-11T23:13:00-0400", "id": "417337105"}, "trip_type": "Family", "published_date": "2016-08-25T09:59:32-0400", "location_id": "6610151", "id": "410667448", "user": {"username": "hueytod", "user_location": {"name": "Massachusetts", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Decent w/good location but...", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r410335587-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review410335587", "text": "We got off to a rocky start when I tried to check in early. First of all, the $27/night for valet comes out of nowhere and it is almost a sure thing unless you want to look for parking everytime you come and go. I booked a double room on the hotel's own website in June at a good rate. Room was not ready and I was told a double room was not available at all and I would have to settle for a king. Not a good thing for a family of 4. We returned 3 hours later to see if room was ready (which it wasn't) and the family ahead of me who walked in off of the street was offered a double room for $30 more than what I paid. They declined and left so I asked if a double became available. The front desk person didn't know where to hide her face and caved. They were nice the entire time but I didn't appreciate the attempt at the switch. When we finally got the room, it was clean and comfortable. The staff is very kind and attentive. All the major points in downtown Savanah are within walking distance. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "IHGService, Guest Relations Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Dear ASBx,\n\nThank you for choosing us and for sharing your experience. I am happy that our location worked for your travel needs and that you found our rooms clean. However, it is indeed regrettable to know that your check- in experience left a negative effect on your overall satisfaction. I apologize for any inconvenience the level of service may have caused you. I have forwarded your feedback to our hotel management to work on these points raised in your review to give you the best hotel experience in the future. \n \nOnce again, thank you for staying with us and hope you visit us again. \n\nBest Regards,\n\nJohn O\nCase Manager\nIHGService", "title": "Owner Response", "published_date": "2016-09-08T17:04:25-0400", "id": "416297962"}, "trip_type": "Family", "published_date": "2016-08-24T17:14:07-0400", "location_id": "6610151", "id": "410335587", "user": {"username": "ASBx", "user_location": {"name": "Bronx, New York", "id": "47369"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-08", "title": "Dirty Room", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r409057135-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review409057135", "text": "If I didn't prepay for this room I would've found another hotel my room was disgustingly filthy and the fire alarm went off at 2 AM and evacuated the entire hotel I would not go back...The worst part is no one had any answers of why the alarm went off very disturbing", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "IHGService, Guest Relations Manager at Holiday Inn Savannah Historic District, responded to this review", "text": "Dear LauriannFarmer,\n\nThank you so much for your review of our hotel. We would like to apologize for the experience you had with the room you received and the inconvenience you had with the fire alarm. Your feedback is very important to us as this continually helps us improve the facilities and guest services we offer to our guests. We have sent you a private message to obtain some additional details. Thank you for staying and we look forward to hearing from you soon.\n\nSincerely,\n\nAnthony M\nCase Manager\nIHGService", "title": "Owner Response", "published_date": "2016-09-08T21:45:31-0400", "id": "416329006"}, "trip_type": "Couples", "published_date": "2016-08-22T19:38:31-0400", "location_id": "6610151", "id": "409057135", "user": {"username": "LauriannFarmer", "user_location": {"name": "West Palm Beach, Florida", "id": "34731"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Pleasantly surprised", "url": "https://www.tripadvisor.com/ShowUserReviews-g60814-d6610151-r408253450-m11068-Holiday_Inn_Savannah_Historic_District-Savannah_Georgia.html#review408253450", "text": "Stayed here for 1 night while driving from Florida to North Carolina. Had never stayed in a Holiday Inn before so didn't know what to expect. For an Inn I was pleasantly surprised with how nice it was.\n\nVery modern with what seemed like good amenities. Didn't eat or drink there so not able to comment.\n\nHad a hire car so needed to have secure parking so instead of looking ourselves we used the $27 a day valet service. Was worth it to not have to worry about the car be secure overnight.\n\nThe location was perfect for being able to see some of the sights before setting off on the road again. Beautiful area in the Historic District.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-21T06:17:36-0400", "location_id": "6610151", "id": "408253450", "user": {"username": "sloping_fungus", "user_location": {"name": "Dublin, Ireland", "id": null}}}]}