{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2015-07", "title": "The cheapest is not always a good value", "url": "https://www.tripadvisor.com/ShowUserReviews-g36707-d4822806-r326601135-m11068-Domino_s_Pizza-Skokie_Illinois.html#review326601135", "text": "I can't speak for all Domino's, but I can tell you my experience at this store. I swore I would never go back after they messed up my umpteenth order and didn't seem to care. But when the \"Under New Management\" sign appeared, I gave them another chance. What I got was a coupon not honored and another screwed up order. Being a cheapskate though, I break my own boycott once again for customer appreciation day. What I didn't realize is that the shop owner is even cheaper than I am.\n\nQuestion: You're Dominoes and you're offering $1 pizza's starting at noon. What time do you start cooking the pizzas? ........... Wrong! They started cooking the pizzas at noon, just as the doors open and the first of the waiting customers order. Oh, but then it gets worse. With hundreds of people waiting outside in line, in the cold & rain, for over an hour, the restaurant starts handing out pizzas to people who called in orders. (One woman bragged that she called in her order from the back of the line.) They get to skip  the line and just walk in for their pizzas, putting everyone outside that much further back - not that those people in line were ever going to get a pizza anyway. Making the pizzas fresh for every order meant they got through (I counted and the manager confirmed) only 20 of the 200 customers before the give away ended about 90 minutes later. \n\nAs an angry mob was forming to storm the shop, they handed out rain checks - good for that day only - but when I returned with my rain check a few hours later, they announced that they had run out of pizzas and the rain checks for $1 pizzas were no longer any good. The manager said, \"we never expected a line of people to show up.\" REALLY?\n\nFor anyone even considering calling the Domino's on Oakton in Skokie, here are some MUCH BETTER choices, in no particular order. All are within a couple miles of the store: Little Cesars, Papa Romeos, Jets, Village Inn, Lou Malnati's, Edwardo's, Carlucci's, Father & Son's, Malibu Pizza (kosher), Pequad's (a 40 year area favorite), Burt's Place, California Pizza, Eastern Style Pizza, Villa Rosa, Giordano's, Panino's, Gigio's, Gullivers, Barnaby's, Sarpino's, Pizza Hut and Carmen's just to name a few off the top of my head. Try one of these next time instead.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-11-13T19:39:52-0500", "location_id": "4822806", "id": "326601135", "user": {"username": "george s", "user_location": {"name": "Chicago, Illinois", "id": "35805"}}}]}