{"paging": {"total_results": "16", "skipped": "0", "previous": null, "results": "16", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-11", "title": "Anticipation was high, but reality was a bit disappointing.", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r437229793-m11068-Tamarack_Public_House-Spokane_Washington.html#review437229793", "text": "Found this venue on Yelp with 4 stars and there were over 50 total reviews. That said, I felt like this was a good gamble to try out a new local restaurant. I convinced my wife and some friends that we should give it a try. Upon arrival at around 5:30 PM on a Saturday night, we walked in to a completely empty establishment. I chalked it up to being rather early and possibly the impact of local road construction. The sign at the entrance said: \"seat yourself\" so we did. The place looked terrific and inviting with high ceilings and an open loft with great lighting and lots of exposed brick. As we walked in we saw a women near the kitchen and a bartender behind the bar. No greeting at all. Not even a quick acknowledgment that we walked in and we were in plain site. Understandable if they were swamped but the place was like a ghost town! So we sat down and then after about 5 minutes of no-contact, grabbed some menus from a nearby table. Eventually, the bartender wandered over with some menus and we told him we already some so we were ready to order some drinks. Having done that, we were totally unprepared for the 10 minute wait to get them. I mean, I could have gone behind the bar and made my own in probably half the time! In fairness, the Rancho Margarita and my wife's drink was really good (I think it was Hop,Skip and Go Naked) but our friends drinks were only \"just OK\" and one of them was the Moscow Mule while the other was the Kombucha Berry. Too gingery is what was said of the Mule. So, on the drink quality, we had a 50/50 split. Once the waiter/bartender came back around, we decided to get an appetizer and two of us (the ones with the good drinks) decided to get another round. These came slightly quicker (maybe 5 minutes) this time but we were in for more disappointment. The steak bites came on skewers with minuscule, thin slices of steak. Maybe 5 pieces on two skewers. A HUGE bed of lettuce (but who really wants to eat that) and a small serving of mayonnaise or some other mystery condiment masquerading as horseradish. I mean, horseradish will make you sit up and pay attention and I couldn't even taste a slight hint of it. Really? All in all, the group decided NOT to have dinner there and settled up our tab. We headed out for greener pastures. I MIGHT give them another chance someday , hoping that our experience was an anomaly, but it will be a while.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-14T14:26:36-0500", "location_id": "8071397", "id": "437229793", "user": {"username": "Michael D", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-08", "title": "Bad service, mediocre food", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r413133814-m11068-Tamarack_Public_House-Spokane_Washington.html#review413133814", "text": "Our server had to ask for our order multiple times and still managed to forget things. The food was extremely mediocre including the pretzel appetizer which our server said would take a bit of time to come out because it was out of the freezer. I know things come out of the freezer sometimes, but you don't need to tell me! It made it taste bad before we even got our food. \n\nThere are a lot of other restaurants to choose from downtown, go elsewhere. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-31T07:14:00-0400", "location_id": "8071397", "id": "413133814", "user": {"username": "Alli_D04", "user_location": {"name": "Paris, France", "id": "187147"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-08", "title": "Understaffed and undersupplied", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r410194651-m11068-Tamarack_Public_House-Spokane_Washington.html#review410194651", "text": "We went for dinner with some friends. We knew it would be busy due to multiple events in the area and had over three hours before we needed to be anywhere. When we walked in the door, the first thing that was said to us was \"are you in a hurry?\" We said no and were told there may be open tables on the patio. The ambiance on the patio is great. Maybe one of the best downtown really. It took awhile for a server to come take a drink order but we knew they were busy so no big deal. Our server was new, had only been there a week. She didn't know the answers to some of our questions regarding the alcohol selection but said she'd find out if they had what we requested (Tito's vodka, Bombay Dry and a non well silver tequila). Drinks took awhile to come out. We ordered an appetizer and that came out shortly after our drinks. The chicken nachos appetizer was pretty good. We ordered a second round of drinks. Tables were starting to clear out so we assumed things would be getting better. It did not. The owner at one point advised us that \"it might be wise\" to order our third round from our server when she delivered the second round since drinks were taking so long. One of our party's dirty martini order came out not dirty three times in a row. Each time we just simply asked for some olive juice for him to add. From both the server and the owner. Both told us numerous times they \"couldn't get behind the bar.\" We finally asked if it would be easier if we walked the drink into the bar. Olive juice was then delivered to our table. Nearly two and a half hours into our time at this establishment we were finally able to place an order for entrees. We had asked the owner a bit prior to that if we could order dinner but she didn't have her order pad with her. We were told they had run out of buns but they thought they had gotten more. The server returned to tell us they did indeed have buns again so they could make burgers, however they only had enough bacon to make the BLT our table ordered, not to put on the burgers (they come with bacon, this was not a special request). We said it was fine. When the food arrived, the bacon on the BLT was burnt to such a crisp, it barely tasted like anything at all. The burgers buns were soggy and the field roast was cold. At this point we had somewhere to be so we quickly ate what we wanted and left. I left half of my BLT on the plate. My husband, who LOVES hamburgers, only ate half of his burger because he said it 'tasted like nothing\" and the bread was soggy. No one, out of the six of us finished their food. This place is in a very competitive area so I do not foresee a scenario in which any of us would return. Regardless of the server being new, no one seemed to be handling (or recovering from) the rush well. It's a shame because the space is beautiful and the location is prime. All in all, we spent over three hours there and I'm beyond confused with how this evening went. We were very flexible but never once was there an apology from the owner for how things went.  Even though she was making comments that clearly showed she knew we hadn't be taken care of. Our server at least thanked us for being nice to her when things were bad. Disappointing.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-08-24T11:41:48-0400", "location_id": "8071397", "id": "410194651", "user": {"username": "Laura H", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-08", "title": "Super-attentive wait staff", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r405097580-m11068-Tamarack_Public_House-Spokane_Washington.html#review405097580", "text": "After sampling wine at the winery across the courtyard, we were delight to stumble upon Tamarack Pub. We dined outside on beautiful wrought iron chairs framed by antique brick and bathed in plenty of natural light.\n\nOur sandwiches were tasty and our service was outstanding. Even though we ordered no ales, our server made sure our water pitcher was never less than half full.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-08-13T20:11:35-0400", "location_id": "8071397", "id": "405097580", "user": {"username": "Mark M", "user_location": {"name": "Cicero, New York", "id": "47472"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "A nice atmosphere, better than bar food", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r395958988-m11068-Tamarack_Public_House-Spokane_Washington.html#review395958988", "text": "I eat here for lunch with a colleague. We both really enjoyed our dishes and the service was just fine.  I later came back the next evening to have drinks and dinner by myself. The food was again good and the service at the bar was as can be expected from a bartender.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-07-23T13:54:53-0400", "location_id": "8071397", "id": "395958988", "user": {"username": "schneiks", "user_location": {"name": "Milwaukee", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Good food & fun atmosphere ", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r394811979-m11068-Tamarack_Public_House-Spokane_Washington.html#review394811979", "text": "I was in a group of 5 and we were easily accommodated, even with separate checks. Service was fast & friendly. Good was quite tasty. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-07-20T12:14:11-0400", "location_id": "8071397", "id": "394811979", "user": {"username": "Cheryl C", "user_location": {"name": "Anchorage, Alaska", "id": "60880"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Early dinner last night", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r384963737-m11068-Tamarack_Public_House-Spokane_Washington.html#review384963737", "text": "Two of us arrived at about 4:45 or so. There was some staff, but no other apparent customers yet. Seated ourself.\nThe layout is VERY impressive, with a loft, all finished nicely. Plenty of elbow room between tables. Two outdoor spaces. I can understand where the other reviews mentioned the loudness, since all of the floor, ceiling, wall surfaces are hard. (Fortunately all table seats have padding.)\nThe bartender was our waiter. He was fairly prompt and efficient, and a nice guy. We ordered micros off a longish list of decent local and regional beers. The bartender's pours were perfect for each round, not a small consideration for micro lovers. $4 for a pint during happy hour was very nice. Pub food was the menu format, and it had some nice offerings. One of us ordered the chicken sandwich and the other their BLT. Our order arrived after a reasonable wait, and the food and presentation was commendable. (Unlike other reviews here, it was hot). Quite a few other patrons rolled in after us, and they seemed to be regulars who know what to expect.\n\nQuibble: the prices are a buck or so higher than competitors. \n\nI generally don't give many 5 stars, but based upon last night, this place deserved it. There wasn't a wrong note, and I hope that the management treats their future patrons thusly. I'll definitely come back with other friends.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-22T11:13:10-0400", "location_id": "8071397", "id": "384963737", "user": {"username": "Bill W", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-05", "title": "Terrible drinks", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r380687408-m11068-Tamarack_Public_House-Spokane_Washington.html#review380687408", "text": "I came here during the Spokane Booze Run with a group of friends.  I ordered a mixed drink and it could not of been more than 2 fluid ounces of juice for $4.  All my friends ordered the same thing and all of them were the same.  We were really disappointed and left.  Probably the worst bar out of the 8 we went to that night.  Also it was the Spokane Booze run and their bar was participating!  Do you think they had any specials for the participants?  NOPE!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-07T15:18:51-0400", "location_id": "8071397", "id": "380687408", "user": {"username": "Nate P", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-05", "title": "Great Atmosphere & That's It!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r376572568-m11068-Tamarack_Public_House-Spokane_Washington.html#review376572568", "text": "They've done a great job with the space, the ambiance is nice....with the new courtyard there is so much potential. That's where the positives end. \n\nThe food and service was just plain terrible. The food was cold, overcooked, and the meat tough not \"slow cooked.\" \n\nService was slow, food took forever even though we were 1 of 2 tables, and our waitress never checked in and then left at some point leaving us to find the bartender to get our bill. \n\nWon't be coming back for their food...might try happy hour for drinks before a show across the street.\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-05-25T15:41:10-0400", "location_id": "8071397", "id": "376572568", "user": {"username": "JStewey33", "user_location": {"name": "Scottsdale, Arizona", "id": "31350"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "100% great", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r364716007-m11068-Tamarack_Public_House-Spokane_Washington.html#review364716007", "text": "Veggie options! The roast veggie sandwich with avocado was delicious. Great Beet and Goat Cheese salad with Chicken made my wife very happy. \nServer was very attentive (made me think of Seth Rogan)\nTasted a delicious local beer Mango Heif. \nAWESOME", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-16T17:25:47-0400", "location_id": "8071397", "id": "364716007", "user": {"username": "GordWright", "user_location": {"name": "Ladner, Canada", "id": "562668"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-04", "title": "What the heck happened?", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r362588113-m11068-Tamarack_Public_House-Spokane_Washington.html#review362588113", "text": "Visited the place last evening.  Not crowded, three waitstaff visible, a handful of people at tables.  Five minutes before we were noticed (despite the staff looking right at us), eventually water and the menus arrived, one minute later the waitress asked if we'd decided.  No, we needed more time. TWENTY FIVE MINUTES LATER, we got up and left, having not ordered anything.   This has to be the worst service in the entire City of Spokane.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-08T10:48:55-0400", "location_id": "8071397", "id": "362588113", "user": {"username": "Driver1969", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "Enjoyed great food and atmosphere", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r321405221-m11068-Tamarack_Public_House-Spokane_Washington.html#review321405221", "text": "Stopped by for dinner with friends before a show. Burgers were excellent,  nice brew selection (but would have liked to see a cider too). Enjoyed the live music,  nice background but still could easily chat with friends. Service was friendly and quick. A nice evening,  and easily got to the theater on time. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-10-24T10:22:05-0400", "location_id": "8071397", "id": "321405221", "user": {"username": "Vhend", "user_location": {"name": "Reardan, Washington", "id": "58701"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-10", "title": "Never going back", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r321013909-m11068-Tamarack_Public_House-Spokane_Washington.html#review321013909", "text": "My wife and I frequent downtown eateries, and are always looking for another answer to \"where do you want to go?\"  \n\nI walked in after a show across the street started, and sat at a messy table, knowing that someone obviously would clear it and get me started with a beer while I waited for my wife to show up.  I waited for over 20 minutes, and not one waiter even looked at me even though they kept walking directly by the table.  Not one. We have been out to dine thousands of times, and have never encountered worse. \n\nI wasted $12 on a Groupon because I won't be going back.    ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-10-22T15:12:19-0400", "location_id": "8071397", "id": "321013909", "user": {"username": "swedishsausage", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-08", "title": "Excellent cocktails and craft beers, but damn this place is loud.", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r301926342-m11068-Tamarack_Public_House-Spokane_Washington.html#review301926342", "text": "Had a nice light dinner with family, one round of drinks and some of their excellent pizzas. The food, drinks and service were all very good, the interior design of this funky little place is top notch--excellent layout, craftsmanship, etc.  Two bar areas, first floor and loft--but the place is loud.  Don't plan on an intimate conversation, because there can't be one with more than 10 people in the place.  Highly recommended though!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-08-21T12:09:05-0400", "location_id": "8071397", "id": "301926342", "user": {"username": "Driver1969", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-08", "title": "Good food, but slow prep during the middle of the week", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r301326841-m11068-Tamarack_Public_House-Spokane_Washington.html#review301326841", "text": "This is a lovely place.  Nice layout and paintings.  Service was quick to begin with, but the preparation of the food on a Tuesday night was slow.  I certainly hope it is faster on other nights.  Once we got the food it was warm, not hot, but it was tasty.  Willing to give it another try just because of the layout and feeling within the establishment.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-08-19T20:02:43-0400", "location_id": "8071397", "id": "301326841", "user": {"username": "NSP9454", "user_location": {"name": "Spokane, Washington", "id": "58759"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-08", "title": "Bad customer service", "url": "https://www.tripadvisor.com/ShowUserReviews-g58759-d8071397-r299003390-m11068-Tamarack_Public_House-Spokane_Washington.html#review299003390", "text": "8/13/2015\nChick Pilot\n\nFirst time we went the food was good but poor service.  We decided to give it another shot thanks to a Groupon.  Bad decision.  Shared a pizza that was COLD (cheese was congealed) and our female server never checked back to see how things were.  We were hungry so we ate it but we weren't happy.  She brings the bill while we're still eating and we informed her we had a Groupon.  She was nice and said she'd bring the new tab.  That's the last we saw of her.  She went with some people up to the loft area and left us hanging for over ten minutes.  My husband had to ask the bartender to bring us the new tab.  He was nice and apologetic.  We were the ONLY table in the bar (at least on the street level).  NO WAY will we go back.  Too many great choices...Manito Tap House, Elk, etc.  Boo Hiss on this place.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-08-13T16:45:58-0400", "location_id": "8071397", "id": "299003390", "user": {"username": "kailanipilot", "user_location": {"name": "Wa state", "id": null}}}]}