{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-12", "title": "Fa La La", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r436212263-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review436212263", "text": "Great holiday memory trip on an old time passenger train. Just a long enuf ride to keep the kids interested. Santa , cocoa, carols, and photos with family friends.   Excellent staff and a real conductor  Delightful", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-11-10T11:01:55-0500", "location_id": "298631", "id": "436212263", "user": {"username": "Luvschickens", "user_location": {"name": "United States", "id": "191"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Fun", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r435190585-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review435190585", "text": "This was about a three hour round trip.  I really enjoyed it. We were suppose to be leaf peeping but the trees had already turned. The conductirs were very nice.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-11-06T14:34:50-0500", "location_id": "298631", "id": "435190585", "user": {"username": "Becky H", "user_location": {"name": "Lawrenceville, Georgia", "id": "35057"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Boring and downtown Van Buren is sad...", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r433969324-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review433969324", "text": "My sister and I purchased tickets for a \"girl's day\" outing.  We left from Springdale and rode to Van Buren.  The ride was long, Historic Van Buren was more like a ghost town with nothing to see or do and the long ride back was a painful end to a long day.  I can't recommend this train ride to anyone unless they want to sit and visit for 6-7 hours with time to buy lunch and wander up and down a few streets for a break in between the stop.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-11-02T06:41:33-0400", "location_id": "298631", "id": "433969324", "user": {"username": "BeverlyArkansas", "user_location": {"name": "Rogers, Arkansas", "id": "31892"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Fun!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r433627915-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review433627915", "text": "We went on the train with another couple and had a wonderful day!  The train ride was relaxing and the time spent in Van Buren was fun!  I would recommend this to anyone (fun for children and adults) looking for something to do for a days outing!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-01T08:23:30-0400", "location_id": "298631", "id": "433627915", "user": {"username": "BENITA L", "user_location": {"name": "WHITE HALL", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-10", "title": "Very Disapointing", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r433263578-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review433263578", "text": "Do not bother with reserving \"First Class\", you will not receive first class service. We had first class tickets, our car was the last to board and the last to unload. The actual train ride time is only about 3 1/2 to 4 hrs and that is for the entire trip, the majority of the \"senic\" area is of old towns and sparsley populated areas.Very little of mountains, and the foliage was not pretty this year. The site makes you think the trip is more like 8 hrs. You spend a LOT of time sitting on the train waiting and a LOT of time waiting at the depot. It was very disorganized. The employees were all very nice but the company needs to have them dress and groom themselves better. Ok as a side stop, but we drove 7 hrs one way to take this trip and it was not worth it.Our train didn't leave out until 8:45 and then we arrived in Van Buren at 10:30 only to sit on the train for another 30 min. Was supposed to pick us up at 2PM, but we finally got on the train around 3 and then back to Springdale at 5:30, and sat on the train again for another 30 min. Your complementary photo is to be emailed to you! Haven't gotten that yet, but you can take plenty of photos with your cell phone, so don't waste your time with the first class ticket. IF I ever do this again I'll get the lower tickets, you can board first and get off first, there are bathrooms in those cars, (not in 109, our first class car), and the other cars are more authentic.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-10-31T08:20:52-0400", "location_id": "298631", "id": "433263578", "user": {"username": "Danna D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Nice Train", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r433044275-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review433044275", "text": "We ordered tickets online and paid for them but still had to wait in line over 45 minutes to get boarding passes.  We didn't have the conductor information tour that others mentioned.  He never came to our train at all. The lunch was not that great.  The train stopped right past the station for everyone to get lunch and eat.  The views were mostly blocked by hedge along the way so we only got a few good pictures.  The leaves weren't colorful yet.  I was disappointed because I expected more.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-30T13:42:51-0400", "location_id": "298631", "id": "433044275", "user": {"username": "jdhhmm", "user_location": {"name": "Leslie, Arkansas", "id": "31735"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Weekend train ride ", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r432628571-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review432628571", "text": "Love vintage cars everything was in very nice shape very comfortable fun things to do for the weekend", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-29T05:06:40-0400", "location_id": "298631", "id": "432628571", "user": {"username": "Doug C", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Relaxing, Enjoyable Day Trip", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r431911333-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review431911333", "text": "We rode the Springdale to Van Buren train.  We selected economy class and it was perfectly acceptable.  It was a very relaxing, fun ride.  We saw numerous wildlife and the tour guide explained fun facts along the way.  I wish we had chosen to go a couple of weeks later, as the trees had not started changing yet, but the scenery was still beautiful.  This is a fun trip for all ages.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-26T11:57:17-0400", "location_id": "298631", "id": "431911333", "user": {"username": "JustSheila", "user_location": {"name": "little rock", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-10", "title": "Dont waste your money", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r431815115-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review431815115", "text": "We splurged for a first class ticket because the seating was described as \"dinning and lounge\"...there were in fact 5 lounge type chairs to accomodate 35 passangers. Everyone else sat in straight back dinning room chairs that were very uncomfortable. There was no meal provided, we were given 4 tokens at the departing depot in Springdale which we could trade for cokes, peanuts or potato chips. \nThere was one bathroom at the Springdale depot which an employee occupied for an extended length of time to dress for work as a line formed all the way to the door as passangers waited for a final opportunity to use the restroom before boarding as we were encouraged to do because the restroom on the train was described as \"airplane like\" and best not used. \n3 hours one way and 3 hours return. ..very uncomfortable. \nIf you opt for the nostalgia of a train ride...dont waste your money on the first class car, the seating could not possibly be more uncomfortable in coach and there certainly isnt anything first class about the staff's service or attitude. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-26T07:40:28-0400", "location_id": "298631", "id": "431815115", "user": {"username": "Nurse-Nette", "user_location": {"name": "Rolla, Missouri", "id": "44862"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Great time despite the confusion and delay", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r431635151-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review431635151", "text": "We rode the train from Springdale to Van Buren and back.  There was some confusion at first as some staff members were directing passengers to the wrong boarding lines.  However, once that was figured out and we boarded our coach car we had a really good time.  Linda (?) and Janie (?) were our attendants and they were great.  They were funny, personable and knowledgeable.  There was a tiny bathroom on our car, which was sufficient.  There were also snacks and drinks available for one dollar each.  The ride to Van Buren took about three hours and I do wish it had been a bit more scenic.  Most of the views were blocked by trees.  We did see seven or eight deer along the trip and saw some interesting old towns.  I do feel like we spent a little too much time in Van Buren.  We didn't take the trolley, but we walked up and down Main Street.  We ate some decent diner food, did some shopping and then waited for the train to pick us up for the return trip.  The trip back was very quiet and relaxing.  My wife and son enjoyed the trip a great deal.  Here's the thing with novelty attractions like this.  You have to go into them with a good attitude.  This was not an expensive ride (we purchased discounted coach tickets).  The train cars are old.  They are comfortable for sure, but not modern by any means.  Many of the staff members are probably volunteers or retired and I'm sure turnover is regular.  Keep these things in mind and you'll have a good time.  My expectations were met and I hope yours are too.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-10-25T14:22:26-0400", "location_id": "298631", "id": "431635151", "user": {"username": "Jay E", "user_location": {"name": "Jenks, Oklahoma", "id": "51434"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-10", "title": "Waste of Good Money$$$ for this", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r431195033-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review431195033", "text": "The Train service personally is poorly run with little training and skill set for the money paid for this type of trip, Their very unorganized for the time you get there and all during the trip, Service knowledge is very poor of Train route and towns you'll pass. Drive it and save your money as the views are limited due to heavy trees along track line. We rode the Silver feather  #109 and looking @ other Cars it was all just plain chairs and a TABLE. REALLY! The Dome windows have about 5yrs. of dirt on them and pic thru windows are poor @ best and hard to see thru for 2.5hrs. then they leave you in Van Burden for 4hrs it a 2.5 hour stop MAX and the museum is Closed on Wednesday. You'd think they would close it a day the train doesn't come to the town. The train engineers do a excellent and safe and steady ride but I can't tell you it a must do on any bucket list A/C was poor in 85-90 degree weather and don't know about the service work on the car lines as it very Poor and the inside of cars for the money POOR Too!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-24T06:29:30-0400", "location_id": "298631", "id": "431195033", "user": {"username": "Yaamule", "user_location": {"name": "Baton Rouge, Louisiana", "id": "40024"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Not worth the price of admission!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r430713522-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review430713522", "text": "We paid through the nose for first class tickets. We were crowded and froze to death on the way to Van Buren. When we arrived we found only 3 places to eat. The shops were marginal with the exception of the book store, and The Soap Shop. Besides those two shops-the rest of the town and the train had an air of \n'We don't really care'. The scenery was nice but not with the money. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-10-22T15:01:20-0400", "location_id": "298631", "id": "430713522", "user": {"username": "Wendy S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "Train offered little; Van Buren little more", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r430420779-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review430420779", "text": "My sister and I planned to take this train trip which was advertised as a way to view \"Fall Foliage\" as the centerpiece of a five-day road trip. I am glad we included other events in our plans as this was disappointing. Neither of us felt the train trip was worth our time or the not inconsiderable cost.\n\nTold to be present 30 minutes early to start, we appeared at the Springdale station on time. But the train station experience in both Springdale and Van Buren was disorganized and slightly frustrating. No one at any point explained what to expect, which of several lines to stand in, when we would start, when to be back, that we needed to turn our online receipts into tickets, or what the tokens were for. \n\nUnlike some of the previous reviewers experience, our staff members were new, very young, and had very little to say and nothing at all that was interesting or informative. An example of the few bits of commentary offered on the trip was something close to \"On the right is a field which you can't see through the trees that used to have a town on it the name of which I can't remember.\" Early in the trip they explained they were going to create a manifest listing all passengers to assure than no one was left behind on the return trip; they didn't do it. They did make the list on the return trip when it had no value. One of them took photos of us while we stood in line without any effort to take a scenic one and never explained why. Later he said they would have to mail the photos because they didn't have a printer cartridge. I don't expect to receive the photo. These young men needed more support or training or a script or something. They were, I am sure, trying hard, but our experience was not enriched by any explanation, commentary or culture. Plus on the way back the battery operated microphone lost power and they said they couldn't find batteries. \n\nWe were offered complimentary coffee and some pastry on the trip to Van Buren which was nice but it wasn't until the return trip that it became apparent that the tokens were for snacks and softdrinks.  \n\nThe restrooms in our car on the train during the early part of the trip were unavailable. No one could find a step stool that was apparently required for us to get off the train in Van Buren, the air conditioning was not working properly and most of us were uncomfortably warm. On the way back from Van Buren they ran out of cold waters. We were very disappointed to discover on the 1/2 of our first class trip that allowed us to sit in the \"domed\" portion of the car, that the windows were so dirty that the view they might have provided was significantly obscured.  And the views were more often than not limited to the trees and scrub growth immediately adjacent to the train track. You will see more fall foliage on the drive to get to Springdale than you will see from the train.\n\nFinally we were left in Van Buren for 4 hours. There is very little in Van Buren to do or see. The only historical element that we were led to believe we would see was something called the Drennan-Scott Museum and it was closed. It is clear that the folks in Van Buren are trying to put a quaint and historical downtown, but the best that can be said is that it isn't four hours worth.\n\nI would not recommend this trip.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-21T14:01:07-0400", "location_id": "298631", "id": "430420779", "user": {"username": "Diane331", "user_location": {"name": "Zachary, Louisiana, USA", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Enjoyable and relaxing", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r429890032-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review429890032", "text": "We got the tickets for the Silver Feather, which is the dome car. You ride one way up on the dome car and then back in first class. You're also given 4 tokens each for drinks and snacks. \nIt can be a little confusing at the first loading as to what car your riding onand the conductor wasn't enunciating and I couldn't understand exactly what he was saying.  However. When asked he was very helpful.  We got there at 7 am for the 8am trip. We stood in line for quite a while before boarding, there isn't any place to sit (at either Van Buren or Springdale) except in side at least for the 1st class.  I think the other end had seating for waiting.  \nAfter we were seated at a 4 top table the hostess came by and got our drink order. They also offered fruit and sweet rolls that were complimentary. \nThe ride in the dome car was pretty neat the train slowed way down when you crossed the big tall trestles overlooking beautiful scenic valleys. At least going down.  Coming back we were running late And they didn't slow down.  Sitting in first class coach coming back,we also sat a 4 top coming back.  So unless you're traveling with 4 people, you'll probably make new friends.  At least we did.  The railroad ride was nice and relaxing,probably took 2 hours down.  I have to agree that the 3 hours in van Buren is too long, even eating lunch and watching a brief historical  movie about the local theatre. I will say that the movie (free) is excellent and not to be missed.  \n\nAlso call for tickets, they're are cheaper than buying over the web. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-19T19:28:32-0400", "location_id": "298631", "id": "429890032", "user": {"username": "archytecture", "user_location": {"name": "Eureka Springs, Arkansas", "id": "31582"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "What a fun time", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r429850444-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review429850444", "text": "This is a refurbished old railroad train.  The cars are air conditioned and very comfortable.  You can buy tickets for several \"classes\" and each has different amenities.  The conductor was very informed about the history of the railroad and this particular line.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-19T14:34:19-0400", "location_id": "298631", "id": "429850444", "user": {"username": "SYinPearland", "user_location": {"name": "Pearland", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Scenic With Culture", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r429768218-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review429768218", "text": "The Arkansas & Missouri Railroad offers three rides.  We took the Springdale to Van Buren round-trip. I would recommend to arrive early so you can tour the museum and get in at the head of the line in order to secure a seat in the 360 degree rail car. Included in the ride are four tokens per person to be used toward water, soft drinks, and snacks with each item being one token. The trip is full of a dazzling array of scenery of the Boston Mountains. The ride tops out at about 35 mph and I wish I had taken dramamine. It honestly felt like I was on the water in a rocking boat..  Once in Van Buren you are free to explore the town for 2-3 hours.. A free shuttle bus is available to take you anywhere in town. We asked for a ride through the historical cemetery. The driver was well informed and a cultural icon.In short, the entire trip is full of natural beauty and a Arkansas cultural experience. It shines through in both the conductors tour guide and service as well as the people of Van Buren. You definitely know that you are not in Kansas anymore.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-19T10:40:07-0400", "location_id": "298631", "id": "429768218", "user": {"username": "driftinblu", "user_location": {"name": "Rogers, Arkansas", "id": "31892"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Disastrous start turned into a blessing!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r428974263-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review428974263", "text": "A friend and I drove to Van Buren Arkansas to take the passenger train to Winslow Arkansas and back. I had called the number on the website about three weeks before we rode. I gave the lady all my information and told her what day and time we wanted to ride. She said to be there an hour early to pay for the tickets. When we arrived I was told We did not have a reservation! There had been a problem with our tickets and we were not in the computer. However Diane, the ticket agent saved our day. She gave us seats in the dome car at a table where we purchased a box lunch. She told the conductor there was a problem with our reservations and we were to get the lunches we planned on. The dome car was great! We could see over the train and could appreciate the view of the landscape. We really enjoyed the ride. The conductor was a volunteer and really did a great job! Some important things to know-the train and station is not wheelchair accessible. There are steps in the train station and to get into the car. There is one bathroom in the station and many people standing in line to use the one room facility. There is a bathroom on the train though. Get a first class seat on the dome car. So worth the extra money. It was a pleasant and relaxing train ride. It would not have turned out so well if Diane had not made everything right for us. The entire train ride was about 3-3.5 hours.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-17T17:52:01-0400", "location_id": "298631", "id": "428974263", "user": {"username": "Teri R", "user_location": {"name": "Broken Arrow, Oklahoma", "id": "51224"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Uneventful Springdale to Winslow route", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r424548302-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review424548302", "text": "We recently went on the Springdale to Winslow train ride offered by the Arkansas Missouri Railroad. The ride was really quite uneventful.  We had tickets in the coach class.  The seats were comfortable and the air conditioning worked fine. During the ride the conductor sold water and sodas and snacks for a dollar each. There really wasn't a whole lot to see along the Route except a lot of trees. One of the things that we did not understand when we booked the route was that there was no stop before you return to the depot. During the entire three-hour trip we never left the train. The train went to a town past Winslow and just proceeded to reverse the route. For what it was it was an OK trip.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2016-10-02T18:12:47-0400", "location_id": "298631", "id": "424548302", "user": {"username": "Kristy S", "user_location": {"name": "Hartville, Missouri", "id": "44468"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "My first train ride!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r421852096-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review421852096", "text": "Some friends and I took the train ride from Springdale to VanBuren. It was a very enjoyable trip. The conductors, were very attentive. They kept us informed about each town we went through. When we arrived in Van Buren, we were told of the best places to eat and shop. We ate at Oliver's, and went to as many shops as we could. All in all, it was a great trip. It is an all day trip. I would go again.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-09-24T12:40:02-0400", "location_id": "298631", "id": "421852096", "user": {"username": "nbrown8", "user_location": {"name": "Yellville, Arkansas", "id": "32032"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Enjoyable Excursion", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d298631-r421513106-m11068-Arkansas_Missouri_Railroad-Springdale_Arkansas.html#review421513106", "text": "We did the Springdale to Van Buren excursion.  It was a very nice experience overall.  The staff were very friendly and helpful.  We had tickets for the first class car and enjoyed the beverage and snack service.  It was fascinating to see the countryside roll by.  Passing several small town festivals and waving back to the event attendees was a lot of fun.  The only downside to this trip was the layover in Van Buren.  The 3 hour time frame was too long considering what there is to do on Main Street in Van Buren.  We were ready to board the train after 1 1/2 hours.\nOverall - my family highly recommends this trip for other families.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-09-23T09:11:13-0400", "location_id": "298631", "id": "421513106", "user": {"username": "Lisa L", "user_location": {"name": "Tulsa, Oklahoma", "id": "51697"}}}]}