{"paging": {"total_results": "6", "skipped": "0", "previous": null, "results": "6", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "It's a must try!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d8814858-r403867093-m11068-Black_Apple_Crossing-Springdale_Arkansas.html#review403867093", "text": "okay, everyone has been talking this place up so I thought I better go try it..AND I AM GLAD I DID!!\nFirst, I love the casual environment.. the server was so helpful, especially since I'd NEVER tasted a cider before. I decided on a flight of 4, 2 dry and 2 semisweet. The size of the pours were perfect for me.  I liked them all.. but really liked the first and last one..which means I liked a very dry one and the sweetest one!! \nSo glad they offer a sampling flight because who knew I'd like two,  at the opposite ends of the spectrum. \nI strongly recommend a visit to this place.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-08-10T17:04:35-0400", "location_id": "8814858", "id": "403867093", "user": {"username": "Margie R", "user_location": {"name": "North Little Rock, Arkansas", "id": "31818"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Great time", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d8814858-r400618843-m11068-Black_Apple_Crossing-Springdale_Arkansas.html#review400618843", "text": "Really enjoyed my time here ! There was live music and the back patio is great . The drinks were really good and also well priced . Will come again ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-08-02T17:46:02-0400", "location_id": "8814858", "id": "400618843", "user": {"username": "Harpers0512", "user_location": {"name": "Bentonville, Arkansas", "id": "31441"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Date Night", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d8814858-r378837409-m11068-Black_Apple_Crossing-Springdale_Arkansas.html#review378837409", "text": "Wow! What a great intimate spot. We went for a date night to check out the local brew. The bartender was absolutely wonderful. I would highly recommend getting a flight if you are unsure of what to get. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-01T18:07:41-0400", "location_id": "8814858", "id": "378837409", "user": {"username": "Localfoodie00", "user_location": {"name": "Fayetteville, Arkansas", "id": "31589"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-11", "title": "Great cider, chill vibe", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d8814858-r342013066-m11068-Black_Apple_Crossing-Springdale_Arkansas.html#review342013066", "text": "I'll admit to knowing nothing about cider when I first went in the Black Apple taproom. I hate Angry Orchard, but I wanted to try a new potential local hangout. The bar atmosphere is fantastic - intimate setting with the best parts of the historic building still in place. I was trepidatious about the cider, but I fell in love with the El Carino and now go pick up growlers on the regular when I'm having dinner parties. The staff is knowledgeable and friendly and more than happy to educate the non-cider-drinking crowd in Northwest Arkansas. I'm happy to see them doing well and picking up distribution around the region. Definitely put this on your list of things to try in Northwest Arkansas. One caveat - ignore Siri or Google maps. You have to get into the building from the back side (Meadow Street). Just accept it as part of the speakeasy experience and consider yourself as one of the initiated. Great outdoor setting in the summer as well. Bonus: bike friendly and just off the trail for all you Greenway enthusiasts out there.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-01-22T14:32:11-0500", "location_id": "8814858", "id": "342013066", "user": {"username": "ArkansasTraveler01", "user_location": {"name": "Fayetteville, Arkansas", "id": "31589"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-01", "title": "Love this place!", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d8814858-r337371120-m11068-Black_Apple_Crossing-Springdale_Arkansas.html#review337371120", "text": "Been here multiple times and it never fails to impress! Nice outside area, dogs allowed, friendly staff, and just great cider! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": "Leo O, Owner at Black Apple Crossing, responded to this review", "text": "Thank you so much for the feedback! We pride ourselves on being dog friendly and people friendly. ", "title": "Owner Response", "published_date": "2016-01-07T13:15:48-0500", "id": "338290705"}, "trip_type": "Friends getaway", "published_date": "2016-01-04T13:30:31-0500", "location_id": "8814858", "id": "337371120", "user": {"username": "MAB91c", "user_location": {"name": "Siloam Springs, Arkansas", "id": "31924"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-09", "title": "First Cidery in Arkansas", "url": "https://www.tripadvisor.com/ShowUserReviews-g31931-d8814858-r329049163-m11068-Black_Apple_Crossing-Springdale_Arkansas.html#review329049163", "text": "It was one of the first cool days of fall and we decided it would be a perfect day to check out the new cidery in the area. Arkansas has lots of microbreweries, but this is the state’s first cidery. We decided to sample all of their ciders by ordering a flight, and then got a glass of the one we liked best. The ciders were better than mass-produced hard ciders, but are not the best craft ciders that I’ve had. The alcohol content was sufficient, but the flavor was a little weak. They had a spiced one that was served with a rim of cinnamon sugar, but when I tried some of it without tasting any of the spice on the rim, I couldn’t detect any spice notes at all. The one that I liked least was the Bellini which tasted like, you guessed it, a Bellini and not like cider. The best of the four that I had was the Imperial Carino, which had the strongest apple flavor as well as the highest alcohol content. They plan to vary the types of ciders they serve seasonally, so there will still be more to try on future visits. \n\nThe one other critique that I have of the cider itself, besides the strength of the flavor, is that I wish that they used juice from locally sourced apples. Northwest Arkansas has a history as an apple growing region, and I suspect that the cidery might be named after the Arkansas Black, a variety that was developed in Northwest Arkansas and won an award at the St. Louis World’s Fair. While there aren’t as many apple orchards in the area as there used to be, there are still some. It would be wonderful if Black Apple Crossing were able to honor that history and highlight locally sourced produce in their locally produced cider. It would add another layer of local flavor to their product.\n\nThe cidery is only open from Thursday through Sunday, so keep that in mind when planning your visit. They only serve hard cider, so don’t come here expecting to find fresh cider for the kids. This is a bar, with a bar atmosphere. They do not serve food, but the taco place across the street delivers. They have an outdoor patio which is dog-friendly.\n\nThe cidery was a little hard to find, even using my GPS. Although the address is listed as on Emma Street, the entrance and parking lot are actually at the back of the building. There are signs on Emma Street pointing back there, but even with those I drove past it once before I found it. It’s worth trying if you want something different from what you can find at the many local breweries.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": {"lang": "en", "author": "Leo O, Owner at Black Apple Crossing, responded to this review", "text": "On behalf of Black Apple Crossing thank you so much for your feedback. We wish we could have seen this summary sooner but it makes for a much more interesting response to see how far we have come in such a short period of time. Since you have last visited we have changed our line up of ciders several times to experiment with different varietals while keeping a broad spectrum of flavors.  We have been pulling apples from several different regions which lead to some very unique flavors, but we are also about to roll out an Ozark Regional small batch series with what will showcase some of the unique flavors of the Ozarks.  We are now open everyday: Monday through Friday from 4pm to 9pm, Saturday 11am-9pm and Sunday 1pm-5pm. We still don't serve food but we do team up with several food trucks on a weekly basis (such as Tyler's Craft BBQ) and allow you to bring in your own food or have food delivered from some of our local eateries (such as Don Quero or the Steam). We also have expanded our selection of non-alcoholic beverages as well. We realize this response is a few months in the making but after another few months you can expect more exciting additions and changes to come. Thanks for your visit!", "title": "Owner Response", "published_date": "2016-01-07T13:14:37-0500", "id": "338290524"}, "trip_type": "Friends getaway", "published_date": "2015-11-25T10:57:02-0500", "location_id": "8814858", "id": "329049163", "user": {"username": "wolfie_n", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}]}