{"paging": {"total_results": "4", "skipped": "0", "previous": null, "results": "4", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2006-11", "title": "Overall Nice Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g44876-d118164-r6134216-m11068-Old_Elm_Tree_Inn-Saint_Charles_Missouri.html#review6134216", "text": "We stayed here recently for just one night. When we first arrived we found our names on an envelope taped to the front door with a key and instructions on parking and where our room was.  We came in and there was not a sound in the house. We like it when the owner greets us and gives us a little tour upon arrival but we didn't get that. We were looking around the other common rooms after unloading our stuff and heard her clattering around in the kitchen which had a \"private\" sign on it. It was a little wierd to us that she was there but did not come out to greet us. The house is very nice and our room was very Cozy. The large 2 person jacuzzi was great, however, there were a few dark hairs left in it as if it were not cleaned out. It grossed us out a little so we cleaned it ourselves before using it. She has bubble bath and other products to use, but no shampoo. There was also free water, coke, and canned beer in the fridge in our room. There were peanut butter cups out on the bar in our room for us when we got there. The next morning we finally met her at breakfast. She was very nice, made sure we had all we needed (refills, 2nds, etc) and fixed a YUMMY breakfast of eggs benedict, candied bacon, fresh pineaple, and banana bread with whipped cream. We weren't sure how to check out as there were no instructions in the letter we received with our key. We assumed it was around 11 but we were ready at 10:30. My husband went to find her and she was nowhere to be found. She must have been downstairs in the basement where her room was. Finally we heard her around 11 and were able to check out w/o any problems. Also, there was a wierd photo of her from the 70s with Farrah Fawcet-ish hair hanging over the toilet in our room. It seemed out of place and kind of creeped out my husband. \n\nWe met a nice couple at breakfast  and they asked us if their jacuzzi around midnight bothered us and we said no,  that we had wondered the same thing at the same time ;o) So apparently the walls hold sound well.  Anyway, our stay was very nice overall but we may try another BnB next time we are in St. Charles or we may stay closer to town in St. Louis.\n", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2006-11-14T19:00:00-0500", "location_id": "118164", "id": "6134216", "user": {"username": "lawsonld", "user_location": {"name": "Missouri", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Great Bed and Breakfast", "url": "https://www.tripadvisor.com/ShowUserReviews-g44876-d118164-r5342407-m11068-Old_Elm_Tree_Inn-Saint_Charles_Missouri.html#review5342407", "text": "This was our first B and B experience, and it was great.  Our hostess was friendly, but professional and did put us at ease. We stayed 2 nights.  The accommodations exceeded our expectations, the room was immaculate and nicely decorated.  The backyard is a beautifully landscaped garden area.  The breakfasts where delicious, both in taste and appearance.   We felt the price was also reasonable.  Our stay here was excellent start to finish!!\n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2006-06-12T20:00:00-0400", "location_id": "118164", "id": "5342407", "user": {"username": "Blue Wing 64", "user_location": {"name": "NorthWest Illinois", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2001-07", "title": "Stood up by Innkeeper and trouble with refund!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g44876-d118164-r3558877-m11068-Old_Elm_Tree_Inn-Saint_Charles_Missouri.html#review3558877", "text": "This happened years ago with Martha the current Innkeeper of the Old Elm Tree Inn. My wife and I were cycling the Katy Trail and had made our reservations at this inn long in advance. The day before our arrival in St. Charles I called the inn to tell Martha what time we'd be arriving. It was a long hot day cycling over 50 miles and we hit St. Charles right on time. We arrived at the inn within 5 minutes of the time we'd specified and walked our bikes up the sidewalk to the front porch. We went to the door and rang the doorbell. The windows were open but the door was closed and as soon as the bell rang two dog started barking away. We stood for several minutes waiting yet no one came. We were on the front porch for no less than 10 minutes ringing the bell and knocking with the dogs barking loudly. Tired and hungry we decided that we had to find a phone and call the number to the inn to see if there was a message left for us. We rode five minutes back toward the river and the Katy Trail to the nearest pay phone. No answer at the Old Elm Tree Inn and just their standard answering machine message. I hung up and called again on the off chance the phone would be answered this time but not so. I left my message, politely, stating that we arrived and stayed at the front door for at least ten minutes while we rang away at the doorbell and that at this point we were forced to move on to other accommodations, get showers and something to eat. I stated that under the circumstances that we'd be looking for a refund. Once our trip was over and we were back home we listened to our phone messages. Among them was an angry tirade from Martha declaring that she'd never give us a refund and that she was at the back of her property in the garden when we arrived! By-the-way, we could hear the dogs barking three houses down as we left so I'm not sure why she couldn't. Also, what happened to our meeting time that we'd arranged? After several unpleasant phone calls it came to a close when I stating that I was taking the issue to the BBB. It was then that she finally decided to treat us politely and send our refund. My wife and I have stayed at countless B&Bs and continue to do so. We've never been treated like this by anyone else in the business. After listening to the recorded phone messages today I wished I would have proceeded with the report to the BBB. Maybe things have changed there. I certainly hope so.\n", "helpful_votes": "6", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2005-06-15T20:00:00-0400", "location_id": "118164", "id": "3558877", "user": {"username": "Canyonlands", "user_location": {"name": "Colorado", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2003-06", "title": "Had a pleasant stay.", "url": "https://www.tripadvisor.com/ShowUserReviews-g44876-d118164-r3395840-m11068-Old_Elm_Tree_Inn-Saint_Charles_Missouri.html#review3395840", "text": "We stayed at the Old Elm Tree Inn while on a road trip and visiting friends in St. Louis.\nThe inn and our room were beautiful, with historic architecture.\n\nThere was a refrigerator in the room which featured free drinks (Cola, water, beer.)\n\nThe only problem was that it was a little hot in the room and we figured that it just did not have air conditioning, so we opened the windows. We asked the innkeeper about this the next morning and found that there was A/C, but the vent to the room had just been shut.\n\nThey brought us hot chocolate to our room before breakfast, you could have coffee or tea also if you liked.\n\nThe bathroom was private to our room but was down the hall...they have bath robes for you to wear. Bathroom was very nice and clean, had old fashioned tub with shower.\n\nBreakfast was delicious including Eggs Benedict. The innkeeper while polite was a little reserved and did not talk to us much during breakfast, she just served us breakfast like a waiter in a restaurant. Service was very good, but we like it when the innkeepers will eat breakfast with us and talk with us during breakfast.\n\nWe would recommend the Old Elm Tree Inn.\n", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2005-04-20T20:00:00-0400", "location_id": "118164", "id": "3395840", "user": {"username": "nipper", "user_location": {"name": "West Texas", "id": null}}}]}