{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2015-05", "title": "Delicious way to help fix Michigan's pot holes.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42669-d8092381-r272582140-m11068-Ashby_s_Sterling_Ice_Cream-Saint_Clair_Shores_Michigan.html#review272582140", "text": "Started by the Davis family in 1984, Ashby’s Sterling Ice Cream quickly grew from  eight  flavors to over 70 original and unique ice cream, sherbet, and yogurt flavors.   Ashby’s Sterling Ice Cream has won numerous awards for its quality, with a perfect score for Vanilla; and in years past “Best New Flavor” awards from the National Ice Cream Retailers Association. \n\nMore recently, Ashby's Sterling introduced Michigan Pot Hole ice cream, made with thick, black tar fudge and fudge cup “asphalt” chunks.  A potion of the sales of this delicious ice cream goes to MDOT to help fix Michigan's pot holes.  What a great idea.   \n\nAshby's Sterling Ice Cream and Soft Serve  in St. Clair Shores is located on Harper, north of Martin Road in the Village Market shopping center.  All of your favorite ice cream specialties are available along with ice cream cakes, ice cream to take home and even some baklava.  \n\nService is friendly and attentive.  The shop offers table seating and the prices are reasonable.  I recently sampled the Michigan Pot Hole ice cream and took some back to a friend.  This is a great place to stop in.  The ice cream is rich and delicious.  You'll love the flavor assortment.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-05-17T11:13:15-0400", "location_id": "8092381", "id": "272582140", "user": {"username": "pasiphae", "user_location": {"name": "Royal Oak, Michigan", "id": null}}}]}