{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Make this a must stop", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r431951104-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review431951104", "text": "There are not a lot of amazing restaurants in St. George, UT but Alfredo's is the exception. Now It is nothing fancy when you drive up, just an old house that he has converted into his restaurant. But the old saying don't judge a book by it's cover is perfect for Alfredo's. He comes from Sicily and his food is amazing. the portions are large and could be shared. The Fritto Misto is one of my favorites and so is the Bruschetta Rustica. both great to start with. His bread is fantastic, you will enjoy. For the entree my wife loves the Gnocchetti All Piemenontese and I go for the Linguine Alle Vongole. You will be stuffed and satisfied, but you have to order the Tiramisu. I would suggest you get it to go and enjoy it later. Try Alfredo's and enjoy.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-26T13:52:49-0400", "location_id": "7115499", "id": "431951104", "user": {"username": "Tim E", "user_location": {"name": "Lehi, Utah", "id": "57044"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-10", "title": "A small step above the Olive Garden", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r431285441-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review431285441", "text": "I really wanted to love Cafe Alfredo's. They are sure trying hard and there are so many plusses, the ambiance, the music, the decor, the facade, the helpful and friendly staff and extremely friendly owner/head chef. However, a restaurant really boils down to the food which is unfortunately quite poor.\n\nI ordered the \"special,\" which was far from it--butternut squash ravioli. The presentation was abysmal, so much sauce the ravioli was complete drowned and not visible on the plate. Our food was delivered suspiciously speedy (within 5 minutes) which, in addition to the taste, was solid confirmation that it was likely frozen a few minutes before. It just looked like a plate of sauce and tasted like something I could find anywhere else, including the grocery store.\n\nI wanted to like this place, but the food just isn't good. There's a lot to love here, however, their point of existing is food and it's bad. Over-toasted bread was difficult to eat and cut the roof of my mouth, with oil and balsamic that was clearly store-bought and very tart, full of sugar. For the authentic \"fine-dining\" image they sell, it's swimming in medium grade sauces and equal to, if not worse than any commercial-grade frozen Italian food. I hope the Scicilian owner reviews his process and finds some more authentic and special recipes of food that people can actually feel represent the cost and the image of a fine dining experience.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-24T11:18:56-0400", "location_id": "7115499", "id": "431285441", "user": {"username": "CW K", "user_location": {"name": "Salt Lake City, Utah", "id": "60922"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Wow!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r429021229-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review429021229", "text": "Food was amazing, starting with the bread, toasted with oinions. Calamari & shrimp was to die for, the spicy Marinera sauce was great. Had the seafood ravioli and did not left disappointed. I was so full. But could not resist the tiramisu. So glad I had some. It was the perfect ending to an amazing dinner. Not to mention service was excellent. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-17T21:46:19-0400", "location_id": "7115499", "id": "429021229", "user": {"username": "Jorge G", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "You will never eat at another Italian place again....", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r397054341-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review397054341", "text": "This was the best Italian food. It is very small and intimate. Only sits 30 at a time. Not for children. This guy just came from Sicily and loves cooking for his friends and family. You feel like you just went to grandpa's house to get his amazing Italian cooking. He comes out several times to check on things. It was worth every penny. Everything is made fresh daily. The fish was so perfect it melted in your mouth and you get a really big piece. I can't wait to go back. Reservations are recommended on Friday/Saturday. This is must for anyone who enjoys Italian food. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-07-25T17:53:42-0400", "location_id": "7115499", "id": "397054341", "user": {"username": "Sharimc68", "user_location": {"name": "St. George, Utah", "id": "57119"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-06", "title": "No improvement", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r389895611-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review389895611", "text": "I originally ate at Chef Alfredo’s restaurant when the chef ran Piccolo Mondo in St. George (which is now closed).  Given I was not impressed with Piccolo Mondo, I was hesitant to try his latest venture, Chef Alfredo’s.  Because there was a large group of friends going (about 30), my husband and I decided to go along and give it a try.  Chef Alfredo’s is in an older house that has been converted into the restaurant.  It is made up of several rooms and our group took up two of these rooms.  Because of the group size, Chef Alfredo gave us a limited menu from which we could select our meals.  Prices ranged from $8+ for salads to $20 for Five Cheese Ravioli, $28 for Great Grandma’s Seafood Ravioli to $35 for Fettuccine Alaska.  There were 3 salads and 6 mains from which to choose.  Desserts were $7 each; there were four.  The meal included only bread (our basket, for our table of 4, had 6 small pieces and was never refilled, despite asking).  We were allowed to order a ½ salad (split one) but when my husband and I asked to split a main we were told “no” we could not.  Not even with a split plate charge.  I was so taken back by this that I did not think to just order a salad and let my husband order a main so we could then share at the table.\n\nI order Rigatoni Mona Lisa (“Bolognese Marscalpone Sauce, with sausage” - $22); my husband order Italian Sea Bass (“Marinara Sauce, Roasted Tomatoes, and garlic.  Served with home made pasta” - $28).  Our Caesar salads were adequate, but contained a rather high percentage of past prime greens and a lackluster dressing.  The cheese did not seem freshly grated.  My rigatoni was mostly al dente but there were also undercooked noodles.  About half the sausage was overcooked.  The sauce was some type of red sauce with a heavy mascarpone component.  It looked like the same sauce that was served on our friends’ seafood raviolis and on their five cheese raviolis.  My noodles and sausage were swimming in the sauce.  My husband’s sea bass was properly cooked but it too had more sauce/topping than it should have.  The fish was lost in the sauce.  The spaghetti that came with the dish was dripping in olive oil and undercooked.  \n\nChef Alfredo’s does not yet have a liquor license and therefore no wine list (despite this restaurant being opened nearly 2 years and a wine list showing on their web site).  Before the meal a server said that because they do not have a wine list yet, they would be serving a “special grape juice” for us.  “Would anyone like to have some” – the server did not say there would be a charge (and shame on us because no one asked).  Those who accepted the offer (most) were served about 2 to 3 ounces of the “special grape juice” in a red plastic cup.  At the end of the meal when it came time to pay we were charged $8.00 per drink.  We told the waiter we thought the drink was complimentary (everyone we talked with told us they also thought it was complimentary because of the way it was presented by the wait staff).  The waiter said the restaurant will be charging much more per drink when they get their license but that he would talk with Chef Alfredo about our concerns.  We did not get the charge deleted or reduced (I pity the people who had 3 drinks each).    \n\nGetting the bill at the end of the meal was an exercise in itself.  Apparently the staff had not kept track of who ordered what (when the food came out the staff would carry it in and say “Who order …”).  After the meal the servers came around and asked everyone what they ordered then they went back to the kitchen and figured out the bill for each person/couple.  It took about 30 minutes to receive our bill.  Given the disorganization, and the quality of the food (one would expect much higher quality given the prices) I don’t think we will ever go back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-06T14:28:28-0400", "location_id": "7115499", "id": "389895611", "user": {"username": "PattyDoggie", "user_location": {"name": "St. George, Utah", "id": "57119"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-06", "title": "No ambiance average food", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r388231670-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review388231670", "text": "A Sicilian owner /chef that has been away from Italy too long.\nHe has become Americanized in his cooking and presentation.\nThe best part was the calamari and shrimp appetizer although the marinara sauce was more of a diavolo sauce (very spicy).The calamari was served hot and lightly battered but well done.\n\nI had the branzino but was disappointed because it wasn't the whole fish and it was fried. It was okay but not tender. My wife had the veal w artichokes --veal was tender but over powered with garlic and served with vegetables.The bread basket had  thick slices of doughy bread with onions topping it; the waiter said it was homemade--small piece was enough--not worth the calories. Doesn't exist in Italy.\n\nThey have no liquor license hence no wine. I called ahead and asked if we can bring our own, and Alfredo said: don't worry about it. I assumed that he was going to pour some wine for us but it didn't happen; so no wine. Their license was revoked because they are too close to a playground as told to us by the waiter.\n\nAn Italian born cook is producing an American interpretation of Italian food, which wasn't the typical wonderful meal that is the norm in Italy. I guess he is catering to the local Mormon citizens that have no clue about authentic Italian food presentation.\n\nWithout wine or desert and coffee, our bill was $80.00.\nSimply ok but not great.\n\nThe rooms are cramped with low ceilings and felt as though we were in a basement.\nThe entrance had a huge desk which is used for Alfredo's desk, I guess.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-07-01T12:10:57-0400", "location_id": "7115499", "id": "388231670", "user": {"username": "anthony r", "user_location": {"name": "Fort Myers, Florida", "id": "34230"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Delicious Food and Wonderful Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r384752187-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review384752187", "text": "Chef Alfredo came to our table to greet us and explain the specials.  He also came back to see what we thought of the dishes.  The food was delicious!  My husband had one of the specials - lamb shank and it was the best he's had in a very long time.  We highly recommend this restaurant and will return on our next trip to St. George!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-21T18:00:03-0400", "location_id": "7115499", "id": "384752187", "user": {"username": "gskorupan", "user_location": {"name": "Phoenix", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Enjoyable Ambiance", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r382766690-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review382766690", "text": "The restaurant is in a converted house so there are many rooms for dining. The food was good if a bit over sauced.  We both had ravioli and a Caesar salad. One drawback is that this restaurant doesn't yet have a liquor license so the wines on the restaurant's website are not available. But overall a nice addition to the St George dining scene. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-15T07:22:52-0400", "location_id": "7115499", "id": "382766690", "user": {"username": "Vettelag", "user_location": {"name": "Saint george", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Recent dinner", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r381955154-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review381955154", "text": "On June 9 four of us while staying in St. George, Utah vacation hiking the North Rim, Zion and Bryce were told of this chef's expertise in the kitchen. They weren't wrong. Our dinners were delicious, from the specials to off the menu items, the dishes were finely prepared. We were disappointed however with the service which seemed unreasonably rushed. The waiter didn't try to 'upset' on appetizers, sides or coffee. We were in and out in under an hour with no one waiting for our seats nor a full house inside. Our waiter offered us one dessert, which we declined and then overheard him offer another set of diners 4 options - weird.The chef owner, Alfredo, came to our table twice. Once as we sat down and then following our meals. He acknowledged our burnt bread which we had barely touched. We learned upon ordering that although they have a nice wine selection, they lost their liquor license about a year ago because they are too close to a school - ridiculous!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-06-12T11:46:46-0400", "location_id": "7115499", "id": "381955154", "user": {"username": "Gayle P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Best Italian in Saint George.", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r375316024-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review375316024", "text": "This is an authentic Italian restaurant from the Sicilian region of Italy.  The food is amazing.  It's the best Italian food in Saint George.  It rivals the Italian I've had in NYC and in Wooster Square.  The Linguini Alle Vongole, the Spaghetti Bolognese and Lasagna are my favorites. I wish they had a lunch menu because the portions are huge.  They are always accommodating when I've brought kids or large groups, but its actually perfect if I was doing a business dinner too.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-05-21T22:05:22-0400", "location_id": "7115499", "id": "375316024", "user": {"username": "Janene L", "user_location": {"name": "St. George, Utah", "id": "57119"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "¡Oh Mama!", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r375281973-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review375281973", "text": "Ive eaten at every joint in St. George, at least once, but somehow this little gem has eluded me, until now. Maybe, it's because it's off the beaten path (by just a little) and in an unassuming older home.  I can safely say, Chef Alfredo's Ristorante is the only real Italian in southern Utah.  Lightly toasted, still warm, focaccia bread with crusted onions is served to each table with excellent EVOO and extraordinary balsamic. Maybe the best bread I've ever eaten? I ordered the potato gnocchetti with prosciutto. The portion was generous and addictive.  The raspberry cheesecake was off the hook too! \n\nDon't miss Chef Alfredo's, he's no novice at this. We'll be back again and again. This is the kind of place where the chef actually greets the patrons while they eat. Loved it!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-05-21T17:58:38-0400", "location_id": "7115499", "id": "375281973", "user": {"username": "RonaldD D", "user_location": {"name": "Washington, Utah", "id": "57161"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Fun and Delicious", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r366956844-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review366956844", "text": "My husband and I recently dined at Chef Alfredo's and what a fun experience.  The chef (& owner) is truly the chief cook and bottle washer.  He greeted us at the door, led us to the table, took our order after explaining the menu selections, cooked the meal, checked on us during and was washing dishes on our way out.  He has a wonderful sense of humor and made this a great experience.  Try the veal dishes. They do not take reservations. The restaurant is small and non-descript, but don't be fooled by that.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-24T12:08:54-0400", "location_id": "7115499", "id": "366956844", "user": {"username": "Edward Thomas M", "user_location": {"name": "Bend, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-04", "title": "Golf winners pick", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r366566278-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review366566278", "text": "Unique older house we got the VIP room which had an incredibly large dining table beautiful high pictures and candlelight\nWe reserved online and had no problem with the reservation and then when we got to the restaurant they were not allowed to serve any alcohol at all\nAny wine drinkers her beer drinkers should check with them before they book for their not disappointed \nFresh Pasta  was  homemade \nsauces excellent and the servings very large\nOur waiter was attentive and very apologetic there being no wine \n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-23T05:29:52-0400", "location_id": "7115499", "id": "366566278", "user": {"username": "Derykkk", "user_location": {"name": "Saskatoon", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Best Italian So Far in St George", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r365904658-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review365904658", "text": "We have been driving past Alfredo's for a year now and finally decided to dine there- so glad we did.\n\nThe restaurant is located in an older home that has been nicely decorated. One of my favorite ever restaurants is in a similar setting in Palm Springs (Le Vallerius) and this place was a very comfortable setting. We went early on a Wednesday so we were the only ones there (bonus) and the hostess/server was very friendly. Alfredo came out as we were ordering to explain what was on the menu and to answer our questions.\n\nOne of the things we always order when eating Italian is a calamari appetizer. Both my wife and I felt Alfredo's was one of the better dishes we have ever had, and we have had calamari literally across the country and on both coasts. He gets his seafood fresh from SoCal and his appetizer is outstanding. The calamari was cooked perfect, and was crispy and not tough. His red sauce was for sure the best we've had, but fair warning - it does have some kick to it. We like food a little spicy so it was just how we like it. As a bonus, he includes several (6) large shrimp cooked to perfection.\n\nMy wife had the catch of the day which was Sea Bass with a fettuccine in red sauce. It was excellent. I had the 5 cheese ravioli and it too was some of the best I've had. The portions were very big, and my teen daughter got a meal from our leftovers when we go home. \n\nIn the future we plan to go for lighter dinners. A Caprese salad and sharing the calamari would be plenty of food.\n\nMy favorite all-time Italian restaurant is Filomena Ristorante in Georgetown, DC and based upon my first experience at Cafe Alfredo's he is pretty close.\n\nOh yeah - we got a couple of Cannolis to go. They were very good.\n\nI'm not sure what happened to the patrons who had negative reviews, but for sure try this place if you like Italian.  I rated it as fine dining as we ordered appetizer, dessert and the specials which hiked up our tab, but there are several entrees at very reasonable rates.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-04-20T19:20:41-0400", "location_id": "7115499", "id": "365904658", "user": {"username": "RSinSG", "user_location": {"name": "St. George, Utah", "id": "57119"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Totally hand made from scratch.  Best Italian food in town.", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r356200969-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review356200969", "text": "Chef Alfredo is the real deal.  He is from Sicily and has a strong Italian accent.  He learned to cook from his grandmother and still uses most of her recipes.  He hand makes the pasta and everything is from scratch.  He will even kiss your lady's hand and make you feel like you are in the old country.  This is the best Italian cuisine in St. George.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-03-16T18:00:30-0400", "location_id": "7115499", "id": "356200969", "user": {"username": "doxfam", "user_location": {"name": "St. George, Utah", "id": "57119"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Authentic Italian Excellence!", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r356137411-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review356137411", "text": "The food was outstanding, the portions perfect, the wait staff pleasant and helpful, the atmosphere was nice...especially a great visit with the Chef Alfredo himself. He is extremely friendly and a great chef. DO make a reservation. This place is So good. Chef Alfredo is from Sicily and his cooking is incredibly authentic. The food was better than some of the restaurants we ate at when we visited Italy in 2014.The prices are very good for the food for a restaurant in St. George I can't wait to go back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-16T12:32:48-0400", "location_id": "7115499", "id": "356137411", "user": {"username": "RichardMcD316", "user_location": {"name": "St. George, Utah", "id": "57119"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-02", "title": "Quality of food.....POOR", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r349390754-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review349390754", "text": "Pasta over cooked\n\nAlfredo sauce is like hot milk with a little seasoning\n\nThe Seafood Ravioli's were very not filled with much seafood and the portion was very small for the price.  \n\nOur experience was not good.\n\nThe restaurant was decorated very cute, the service was okay.\n\nThe price & quality was very disappointing!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-02-20T04:40:13-0500", "location_id": "7115499", "id": "349390754", "user": {"username": "M B", "user_location": {"name": "Billings, Montana", "id": "45086"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-02", "title": "No wine", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r345295735-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review345295735", "text": "Just went to Alfredo's St. George. They don't have their wine license yet. No mention of that on their web site. Actually promoting new wine list. Very disappointed. Haven't had dinner yet. It better be over the top. \nJust finished the pasta. Supposedly hand made ravioli. We had seafood and five cheese ravioli. Couldn't tell the difference between them. Same sauce. Cheese on the seafood. 50 dollars. Go to Olive Garden.  \n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-02-05T18:26:59-0500", "location_id": "7115499", "id": "345295735", "user": {"username": "OutsideOdds", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2015-12", "title": "Much better places in St. George", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r338035799-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review338035799", "text": "Not a good experience.  Maybe I picked wrong off the menu but the appetizer had no flavor.  The service was just ok.  The menu said they offered bottles of wine but really only had two wines by the glass (one red and one white) that was totally overpriced.  Go to Cappelettis instead.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-01-06T17:41:02-0500", "location_id": "7115499", "id": "338035799", "user": {"username": "Boisenb", "user_location": {"name": "Boise, Idaho", "id": "35394"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-12", "title": "Very Odd Experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g57119-d7115499-r336307964-m11068-Cafe_Alfredo_s_Ristorante_Italiano-St_George_Utah.html#review336307964", "text": "My family and I arrived an hour and a half before closing for dinner.  The woman in uniform who greeted us seemed harried.  She left some dirty cloth napkins and glasses on the desk that serves as the \"hostess station\" while she went off to find a table for us and the group that arrived moments before us.  The restaurant didn't seem busy but it was at least 15 minutes before someone returned to take us to a table.  The dirty napkins and glassware still lingered at the hostess station.\n\nWe were seated at an odd table where my husband had to squeeze by another diner to get to his seat.  There were obviously empty tables in other rooms, some of which had not been cleared and cleaned yet and they stayed that way for our entire meal.\n\nThe server was very polite and apologized a few times, remarking that there had been two groups of 11 that night.  Hmmm, inadequate staffing?  Both employees (the \"hostess\" and the waiter) appeared to be very busy when we saw them hurrying to and fro.\n\nThe menu had perhaps 8 or 9 different wines listed, priced by the bottle and by the glass and there were 4 other \"house\" wines by the glass as well.  I ordered a glass of wine and was told that all that was available was one white and one red wine.  At first I thought I'd misunderstood the waiter but no, of the 12 or so wines offered and well-described in the menu, only the anonymous merlot and white wine were available.  I thought maybe they'd sold out of the wines but it appeared that the menu had \"vapor-wines\" as in, they'd NEVER been offered at the restaurant.  The waiter politely mumbled something about waiting for the license or something which made me wonder if the restaurant had only just opened for business??  \n\nWhen we ordered our main courses, I asked about the side dishes, salad or soup and the waiter politely told me that the main course came in such large portions that I wouldn't need/want a side dish.  I have to wonder now if those were \"vapor-dishes\" as in they didn't really exist.\n\nI ordered the butternut squash.  I've had it in other restaurants but this time it was served in a red cream sauce which almost completely covered up the delicate butternut squash flavor.  The dish was also served with Parmesan cheese on top.  The portion was very large.  I would have preferred a smaller portion, no Parmesan cheese on top without my requesting it AND I would have liked to have a small, elegant salad.  \n\nMy daughter ordered the spaghetti with meatball and ate it.  My husband had the lasagna and liked it too.\n\nMaybe this restaurant hasn't found its identity.  If it's going to be a fine dining establishment, it has to have side dishes to complement the main courses.  It also MUST have more choices of wine.  It also should have adequate staffing and the ability to keep the tables clean.\n\nIf the restaurant is going to be successful at what it serves, the menu needs updating immediately.  It is completely misleading as it is.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-12-31T15:07:14-0500", "location_id": "7115499", "id": "336307964", "user": {"username": "Morningsatthebeach", "user_location": {"name": "Santa Cruz, CA", "id": null}}}]}