{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Great street tacos. Definitely worth coming again.", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r431645877-m11068-East_Coast_Taco-Suffolk_Virginia.html#review431645877", "text": "Anyone who says this is a bad Tex-Mex doesn't have enough experience with regional differences in Mexican food. We've lived all over the southwest. Husband and I ordered the street tacos (carne asada, chorizo, and carnitas). They were tasty and consistent with a California style Mexican restaurant, and a far cry from Tex-Mex (good but a different cuisine). Waitstaff was pleasant and attentive. Kids eat free on Tuesdays, apparently, at the time of this review. We will come back, definitely.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-25T15:34:10-0400", "location_id": "6580327", "id": "431645877", "user": {"username": "Lee B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Great Place, No mor", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r425109739-m11068-East_Coast_Taco-Suffolk_Virginia.html#review425109739", "text": "I reviewed this before in April 2016 and it was great. Back at the beginning of Sept, we went again and the service and food were terrible.  It was a weeknight and we waited forever for our seats.  The drinks again took way to long as did the food. The quality of the food has gone down hill.  They are going for the fast and not the quality now.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-04T11:57:33-0400", "location_id": "6580327", "id": "425109739", "user": {"username": "Jeff R", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-09", "title": "Taste of Suffolk 2016 Adventure", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r417704849-m11068-East_Coast_Taco-Suffolk_Virginia.html#review417704849", "text": "We waited to try a couple of places in downtown Suffolk until this year's Taste of Suffolk came around again.  It was a little different than what we were expecting, and the food quality was much less than we expected.  \nPositive note, the house margaritas were reasonably good and relatively cheap.  \nThe food was a different story.  We tried a taco, a burrito, an enchilada, and a quesadilla.  The enchilada and the burrito were damn near identical and both smothered in enchilada sauce...what?!  They were equally disappointing, somewhat akin to a person's first cooking adventure in which they use a recipe, but have no idea what the flavors should taste like.  The ground beef was right up there with Chef Boyardee ravioli filling.  Just awful.  It tastes like they don't care, at all.  No originality, no spin, just a lazy effort at Tex Mex.  \n\nWe will not return.  ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-09-12T17:25:46-0400", "location_id": "6580327", "id": "417704849", "user": {"username": "jwmilburn2012", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Good Mexican at a reasonable price", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r395254219-m11068-East_Coast_Taco-Suffolk_Virginia.html#review395254219", "text": "Good Mexican menu with plentiful portions at a reasonable price. The service is good and the décor interesting.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-21T14:21:43-0400", "location_id": "6580327", "id": "395254219", "user": {"username": "oldhokie702016", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 2, "travel_date": "2016-07", "title": "Terrible Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r392818810-m11068-East_Coast_Taco-Suffolk_Virginia.html#review392818810", "text": "Arrived with a group of six at & 7:15 pm on a week night.  The place was 1/3 filled.  It took the wait staff 15 minutes to get our drink orders and bring some chips and salsa. Finally able to place our food orders at 7:35 pm.  At 8:10 pm (35 minutes after placing or order) we inquired as to the status.  We were informed that they were having \"problems\" in the kitchen.  At no time was our party informed of the delays by Management.  Several members of our party paid for their drinks and left.  The wait staff seemed to be in a state of confusion…..no refills for drinks, no refills on chips or salsa.  We are locals and our party of six has decided NOT to return to this establishment in the future.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-07-15T04:02:10-0400", "location_id": "6580327", "id": "392818810", "user": {"username": "767NucEngineer", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Best hidden gem in Suffolk!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r390216748-m11068-East_Coast_Taco-Suffolk_Virginia.html#review390216748", "text": "My wife was watching Hampton Roads Today this morning and caught Chef and owner Jose roasting chiles for their famous Chile Rellenos. Once she finished watching the program she grabbed me and said here's where we are going for lunch today. \n\nHaving not found what we would call a 'good' Mexican restaurant since moving to Portsmouth a few years ago we were interested in trying this new venue. \n\nAm I glad we did! The chile Rellenos and the tacos were amazingly tasty and fresh. Not the usual steam table Mexican you find in every mall area.\n\nThis food was awesome! The service was stupendous and everyone was friendly. \n\nJose came to greet us at our table as we got there just as he was returning from the TV studio and our server was great!\n\nWill we return? You bet we will as there is plenty of more delicious home made food to be tasted. Try it, you won't regret it. \n\nThree cheers to Jose and his team!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-07T14:31:33-0400", "location_id": "6580327", "id": "390216748", "user": {"username": "Thomas M", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-12", "title": "So Good!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r378349223-m11068-East_Coast_Taco-Suffolk_Virginia.html#review378349223", "text": "You have to try the carne asada french fries... I would eat them every day if I could. My only complaint is that I don't live close enough to eat here every day!!! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-05-31T10:12:49-0400", "location_id": "6580327", "id": "378349223", "user": {"username": "iheartwine13", "user_location": {"name": "Virginia Beach, Virginia", "id": "58277"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Great Place", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r367743855-m11068-East_Coast_Taco-Suffolk_Virginia.html#review367743855", "text": "A very cozy place that is family friendly.  I have been surprised that it is not packed, Food is perfrect and the staff is amazing.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-04-26T03:39:50-0400", "location_id": "6580327", "id": "367743855", "user": {"username": "Jeff R", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Diamond in the rough", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r364732256-m11068-East_Coast_Taco-Suffolk_Virginia.html#review364732256", "text": "East Coast Taco Company is a true diamond in the rough.  Authentic Mexican that you would expect to get in Southern California is right here in Hampton Roads.  Restaurant decor reminds me of the West coast,  as does the music; all that's missing is the Pacific Ocean. \n\nService was good.  This was our third visit and each time we were happy with the service. One thing I believe others reviewers are citing is that this is not a place where you order and 5 minutes later your food arrives.  It takes time to cook each plate to order versus staging food for hours before it's ordered.  In other words,  most Mexican restaurants around here are very fast to bring out the food.  Though they have good quality food as well,  what Jose is turning out is special.  \n\nThe flavors that are present in each dish are carefully thought out.  I love how fresh the food is and how well Jose is able to incorporate ingredients such as cilantro,  onions tomato, jalapeño, Sriracha, etc. into his dishes.  They are unique and bursting with flavor.  Another thing that I appreciate is that the food isn't salty or over spiced.  I like that each element is able to stand on its own,  yet together compliment each other so well.  That to me is more of the authentic Mexican flavors than what we are accustomed to here on the east coast.  Each bite is better than the last. \n\nIf you have the chance to meet Jose while you are there,  you will note that he has passion in his eyes.  He cares about the food that he serves and he wants to make sure each and every person in your party is satisfied.  So glad that this small business has persevered for 2+ years and I am glad to say that they are getting better each time we visit.  If you are in the area and looking for great food, or looking for a great spot to take your significant other,  I highly recommend East Coast Taco.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-16T20:08:29-0400", "location_id": "6580327", "id": "364732256", "user": {"username": "etsatcom", "user_location": {"name": "Chesapeake, Virginia", "id": "57597"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Good Tacos", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r361800478-m11068-East_Coast_Taco-Suffolk_Virginia.html#review361800478", "text": "We stopped in for a late lunch/early dinner and we weren't disappointed. We ordered Tacos and it was dollar taco day on Monday's. Our server was very good and our food came fast. They tasted great, much better than Taco Bell! We will return.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-05T08:36:27-0400", "location_id": "6580327", "id": "361800478", "user": {"username": "HangerJMU", "user_location": {"name": "SUFFOLK", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Unique Fresh Flavors", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r358310496-m11068-East_Coast_Taco-Suffolk_Virginia.html#review358310496", "text": "This is definitely not your run of the mill Mexican restaurant.  If you want some great food that's not your standard \"out in under 5 minutes\" Mexican food, take the time to check this place out. Chef/Owner Jose has put some real thought into taking the traditional fare and putting his own spin on it with flavorful sauces, different cooking methods and other twists. We've been there 3 or 4 times now, I've had something different each time ... ALL DELICIOUS!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-03-24T17:32:39-0400", "location_id": "6580327", "id": "358310496", "user": {"username": "Suffritz", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-03", "title": "Authentic Tacos", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r352504052-m11068-East_Coast_Taco-Suffolk_Virginia.html#review352504052", "text": "This was a quick stop in mid-afternoon.  Had to try the tacos to see if the food lives up to the promise.  So far, so good.  I'll be back for a taste of enchiladas.  I enjoyed the carne asada tacos, delivered in true Mexican style.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-03-02T17:21:50-0500", "location_id": "6580327", "id": "352504052", "user": {"username": "Jim S", "user_location": {"name": "North Carolina", "id": "28954"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-02", "title": "Service great, food overpriced for quality", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r349014312-m11068-East_Coast_Taco-Suffolk_Virginia.html#review349014312", "text": "We decided to try this place just around their 2 year anniversary.  It's usually a good sign when anything (that's not a chain) can survive a couple years in Suffolk.  We love to see non-chains in the area, but overall we were pretty disappointed.\n\nFirst, the restaurant itself is nice.  I really liked the atmosphere and the décor.  It's just comfortable.  There are a few booths in the bar area and a raised table area in front of the window.  There are several tables in the main dining area.  It's not huge, so if it's busy, there might be a wait. I saw something on a Google review that called this a 'hole in the wall' and that is not correct.  \n\nThe night we went, it was mostly empty.  The booths in the bar area were taken and we couldn't do the table by the window with a high chair.  There were two couples in the dining room, but they were finishing when we arrived.  We sat in the dining area, \n\nThe service was good until the end of the meal.  They were very attentive.  They were great with my toddler.  They even rushed her food because she was a bit fussy.  I really appreciated that,\n\nI ordered a sangria.  It was a bit light. It's good if you want a slight taste of a sangria, but not the heaviness of the wine or alcohol.  This was more like a light punch (or watered-down sangria) with very little alcohol.\n\nThey serve chips and salsa and white dipping sauce upon seating.  The salsa was kind of bland and mild. The white dip had a little kick.  I'm not a fan of the white sauce, though.  I'm not aware that it's authentic, but it's popped up in every Mexican restaurant I have eaten at in the below the Mason-Dixon in the past umpteen years (I first had it in SC back in 2001).  I've still not seen it in the restaurants I go to up in the north yet.  Maybe it's crept up there, I'm not sure, but I wish it would go away.  Every place I've eaten where this is served, the salsa tends to be bland (as if you'll forgive the bad salsa by eating the white sauce, but I prefer good salsa).  \n\nWe ordered a chicken quesadilla for my daughter, my husband got the enchilada supreme and I got two carne asada (grilled steak) and two pollo (chicken) tacos.  I asked about cheese on the quesadilla and they said, yes, it has cheese. \n\nWhen the food came, I was surprised.  My husband's order was okay (for $9.75 it was just four small enchiladas with no sides, but he liked the sauce).  My daughter's quesadilla hardly had any cheese.  It was small and mostly dried-out shredded chicken (for $6).  I tasted it and it was slightly seasoned.  She ate a couple of bites and was done with it.  My meal was the most disappointing.  For $9.75, I got four small, soft taco shells with a little bit of meat and a few pieces of onion thrown on top (I asked for them to hold the cilantro).  I was surprised at the dish- and even more surprised when I tried it.  The steak was very tough, dry, fatty, and had no taste.  The chicken was also dry and had no taste. I took a small bite of one steak and one chicken taco and was done.  I thought for that price (with no sides, no sauce, nothing else), it would be delicious and flavorful, but it was neither.  No, I didn't want some heavily-sauced or over-seasoned meat, but it should have had something...anything...to justify the price or us going back. I should mention I asked for a box for my food and I only put the meat in there and I felt bad wasting a box.  I could have wrapped the meat up in a napkin, there was so little of it.\n\nI had to order lettuce, tomato, and sour cream on the side.  I got a miniscule ration of wet head lettuce, a few chopped tomatoes and sour cream in a butter cup (the same size you'd get for clarified butter for a lobster).  No joke- they charged me $1.00 for the lettuce, $1.00 for the tomato, and $1.50 for the sour cream.  I ordered some refried beans- I got a small amount in a saucer-sized plate and that was $2.95 (and that was bland and completely dried-out, so much so I had trouble digging it out on a chip).  That's absolutely ridiculous.  For almost $10, I think you can throw in some of that for free- and if not, those tacos should have been able to stand on their own regarding quality, but they didn't.  \n\nI doubt we'll return, which is a shame because I do prefer non-chain restaurants and support local places in our area, but I can't justify the cost vs the quality of food.  I felt nickeled and dimed, too, on heavily over-priced 'sides'.\n\nThe upside, as I mentioned, was the service was good.  I will say, though, we were left alone a bit too long at the end even though they weren't busy.  We waited 20 minutes after we got the check before the server came back to take our payment (and when the waitress gave us the check, we told her we had to go, but she disappeared).  Other than that, though, the service was good.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-02-18T17:10:50-0500", "location_id": "6580327", "id": "349014312", "user": {"username": "jmccullough33", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-11", "title": "Fantastic Service & Food", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r325606444-m11068-East_Coast_Taco-Suffolk_Virginia.html#review325606444", "text": "This was my first visit, and if it were closer to home, I would definitely be returning. My dad and I tried their chicken taquito bowl, shimp cocktail, and grabbed the strawberry cheesecake chimichanga as well as the churros for dessert. It was absolutely delicious!! And the presentation was phenomenal! \nThe only downside was sometype of tacos my dad had ordered that were not to our liking, they reminded me of taco bell not really what I had expected. But, even that was not enough to destroy a good experience.\nOur waiter,  David, was above fantastic! \nHe stayed on top of things, like refills, constantly asking how we were doing or if he could get us anything. He was also a great conversationalist, which played a big part in our experience. \n", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-11-09T17:01:54-0500", "location_id": "6580327", "id": "325606444", "user": {"username": "Yesica C", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "Great Food & Great Service", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r302137799-m11068-East_Coast_Taco-Suffolk_Virginia.html#review302137799", "text": "This was the first time we ate here, from start to finish nothing but great service and the food was awesome. Can't wait till Monday for 1$ tacos.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-08-22T06:23:40-0400", "location_id": "6580327", "id": "302137799", "user": {"username": "Eddie A", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 2, "travel_date": "2015-07", "title": "Not a gem...", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r289963440-m11068-East_Coast_Taco-Suffolk_Virginia.html#review289963440", "text": "I don't  think we will be returning.  We decided to try this place tonight based on what we had heard from others.  We were quickly seated without a wait at approximately 8PM on a Friday night.  There were no available booths, but there were about 4 other tables open.  Our waiter was very good and attentive.  The food was subpar and I can assure you there are authentic Mexican restaurants close by that beat this food hands down.  The chips were made of corn flour that was either not cooked appropriately or had other issues.  I kept getting tiny pieces that were very hard and I thought I had chipped a tooth at one point.  This was not a very pleasant experience.  There were some really good reviews last summer.  I wish we had tried it then.  ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-07-17T17:24:28-0400", "location_id": "6580327", "id": "289963440", "user": {"username": "SouthernBelleByBirth", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-04", "title": "Never Again", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r264967130-m11068-East_Coast_Taco-Suffolk_Virginia.html#review264967130", "text": "They absolutely positively pissed me off tonight! My husband treated me to take out tonight and I ordered a taco salad. I've never had a soggy taco salad with a 'stale-like' shell. When I asked for the manager, the first lady told me that she was the manager. When I told her about my salad, she put someone on the phone. When I questioned who she was, she responds 'we have different managers'. After explaining to her that I could have gone to taco bell for a better cheaper salad, she states that the next time I come in, she would give me another one. I responded again with my dissatisfaction, and asked for a replacement item and she tells me no. By, this time I'm really pissed and sent my hubby back up there. We will NEVER go there again. Anyone who doesn't care about my food, doesn't deserve my business! I will say this: my husband was given another one but to be honest, I was scared to eat it for fear of what was done to it due to do-over. A waste of $7 and date night.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-04-10T16:20:52-0400", "location_id": "6580327", "id": "264967130", "user": {"username": "MsVisa", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2014-11", "title": "Great Mexican/Tacos", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r260027936-m11068-East_Coast_Taco-Suffolk_Virginia.html#review260027936", "text": "East Coast Taco has some of the best Mexican food in Suffolk. They take the normal stuff you find at standard Mexican restaurants and they spin it up a bit. They also introduced me to Rumchata via an interesting cocktail they had, so I need to thank them for that.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-03-17T06:56:57-0400", "location_id": "6580327", "id": "260027936", "user": {"username": "GFJenn", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-01", "title": "Pretty Good Stuff", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r252448114-m11068-East_Coast_Taco-Suffolk_Virginia.html#review252448114", "text": "Good Chips and Salsa/white sauce... Fried Chicken Chimichangas were great... Service was a bit off on the week night we visited.  ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-02-03T09:16:33-0500", "location_id": "6580327", "id": "252448114", "user": {"username": "BudLeary", "user_location": {"name": "Suffolk, Virginia", "id": "58224"}}}, {"lang": "en", "rating": 2, "travel_date": "2014-07", "title": "Pass", "url": "https://www.tripadvisor.com/ShowUserReviews-g58224-d6580327-r251172550-m11068-East_Coast_Taco-Suffolk_Virginia.html#review251172550", "text": "Good atmosphere.  So so food and way too expensive.  Better and cheaper places in town.  One can always tell if it will be good Mexican if the salsa for the chips is good.  Very bland.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-01-26T15:07:12-0500", "location_id": "6580327", "id": "251172550", "user": {"username": "RKlotzie", "user_location": {"name": "Suffolk, Virginia", "id": null}}}]}