{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2015-12", "title": "Delicious quick bites with a side of great karma!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58775-d4893056-r333877799-m11068-Smooth_and_Juicey-Tacoma_Washington.html#review333877799", "text": "Husband and I discovered Happy Belly by accident when we were looking for a quick lunch on a Friday in Tacoma.  What a treat!\n\nFood is fast-casual, vegetarian focused (you can add proteins to anything however) and all home made.  They feature different soups and curries each day, along with salads and sandwiches.  They have a superior juice bar as well (real juicing here), though we were just there for food.  Hubby tried their spinach apple salad with a smoked salmon add-on, I had their roasted red pepper soup.  Salads come in two sizes, 8 oz. or 16 so you don't have to buy a lot of food, just what you need.  Everything was made to order (staff can name every ingredient) -- really delicious different creations with reasonable, good-for-students-on-a-budget pricing.  Our meals were served on real china!\n\nAmbience is blissful with a Portlandia twist (yes, in Tacoma).  Sincere, super-friendly, knowledgeable folks just want to make good healthy food for you and have you take a moment to enjoy it.  Or grab and go, as we saw folks (who looked like college students) do just that.  Park on the street (Friday at 2:00pm we did for free).  There are a couple of retro stadium seats for outdoor dining and they appear to have cooking classes as well.  Anyway, we loved it.  You'll eat healthy food here AND it's really tasty, which is what made us happy!  Well named.  Highly recommended.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-12-19T08:01:32-0500", "location_id": "4893056", "id": "333877799", "user": {"username": "Ohiofamily", "user_location": {"name": "Thousand Oaks, California", "id": "60959"}}}]}