{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Great staff and amazing hotel.", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r436681762-m11068-Governors_Inn-Tallahassee_Florida.html#review436681762", "text": "I stayed for one night at Governors Inn and it was delightful.\nMy room was really comfortable and the staff did everything to help me with all I needed from directions to places to eat and go out.\n\nI had a great sleep and the room looked amazing decorated as the old good days.\n\nI would definatly stay here on my next trip to Tallahassee.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-12T13:26:06-0500", "location_id": "85833", "id": "436681762", "user": {"username": "JonaElk", "user_location": {"name": "Haifa, Israel", "id": "293982"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Lovely Stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r433740351-m11068-Governors_Inn-Tallahassee_Florida.html#review433740351", "text": "What a neat hotel. Each room is named for a governor of Florida and has it's own special decor. Our room was small by US standards but very comfortable. We had a small patio opening on a alley - court yard. The Inn was originally part of a stable and the interior has unique exposed beams.\nIt is located just behind the Capital so everything downtown is right there. We stayed during the Jazz and Blues fest and were close enough to the Cascade Park to walk.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-11-01T12:48:18-0400", "location_id": "85833", "id": "433740351", "user": {"username": "anorville", "user_location": {"name": "Marianna, Florida", "id": "34422"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Could be a lot better", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r432651785-m11068-Governors_Inn-Tallahassee_Florida.html#review432651785", "text": "Although in a great location just a block away from the state capitol, our bathroom could have been cleaner and one table lamp was broken. Although a \"continental breakfast\" was available there was only one table in the breakfast/bar lounge to sit at. Everyone else was expected to eat breakfast off their lap or take it to their room. The staff was friendly and helpful and the hotel was quiet. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-29T06:40:41-0400", "location_id": "85833", "id": "432651785", "user": {"username": "Anthony M", "user_location": {"name": "Sarasota, Florida, United States", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Well handled", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r432513273-m11068-Governors_Inn-Tallahassee_Florida.html#review432513273", "text": "Original room had no windows and extremely noisy A/C. After some reluctance moved to upgraded room, which was a lot better but was above a Bar entrance so banging doors but not until too late. This was well handled by rather overworked check in person. Valet parking efficient and reasonable priced. Breakfast is just coffee, cereals buns and toast. Well placed for some nice dining places in the City. Good for business trips and en route stopovers.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-28T14:06:18-0400", "location_id": "85833", "id": "432513273", "user": {"username": "Peter S", "user_location": {"name": "Alton, United Kingdom", "id": "503821"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "Charming", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r426921700-m11068-Governors_Inn-Tallahassee_Florida.html#review426921700", "text": "Wanted to try Governors Inn after checking out of the Doubletree. Centrally located near the Capital and walking distance to FSU.\nThis hotel is charming!  As told to us, this once was a horse stable.  \nBeds are comfortable, bathrooms modern and large, continental breakfast is served.  The staff is very friendly and accommodating.  There is no elevator but great rooms on the ground floors.\nWill be back!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-11T05:03:54-0400", "location_id": "85833", "id": "426921700", "user": {"username": "Live4Maine", "user_location": {"name": "Bi-Coastal", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Very civilised, quiet up market hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r425899525-m11068-Governors_Inn-Tallahassee_Florida.html#review425899525", "text": "Spent two nights in this gentile hotel. The staff are very friendly and professional, and the location is great for central Tallahassee. We were initally unhappy with the window looking out on the not-so-private coyrtyard so they moved us upstairs. The loft rooms are great with lots of space and peaceful. Note there is no parking, so we used the valet parking service at $12 per night which worked just fine.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-07T10:12:15-0400", "location_id": "85833", "id": "425899525", "user": {"username": "starmanUk", "user_location": {"name": "Romsey, United Kingdom", "id": "503839"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-09", "title": "Supernice room and stuff", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r414046649-m11068-Governors_Inn-Tallahassee_Florida.html#review414046649", "text": "The guy at the reception (David) was really nice to us, we were transferred here from wakulla springs because of the huracane, but here was much better. We had power, wifi, airci, tv... All time! Really great service. We got a free drink in the afternoon, and breakfast, although it was quite basic, that could be improved. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-09-02T15:42:31-0400", "location_id": "85833", "id": "414046649", "user": {"username": "Pepusina", "user_location": {"name": "Leeuwarden", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2015-11", "title": "Named after old Governors", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r406121504-m11068-Governors_Inn-Tallahassee_Florida.html#review406121504", "text": "Well we got to stay here only for one night. If they didn't screw up the bills it would have been a really close to perfect night. From the start at the valet he was super nice and even helped an old man with his baggage. No elevator was a bummer but the stairs weren't that bad. The room was a bit smaller but still had everything that you needed. It was also very clean and everything was where it needed to be. The bed was a smidge on the tall side. It hit me about mid belly in height. The inside of the hotel was really cool from the Bob the Builder side of me. All old exposed beam gives me the warm n fuzzes. The place is in pretty good shape being how old they say it is. Heck who remembers Lawten Chiles as Governor. I do but I'm really old. All the rooms are named after Governor's and other stately famous people. In all a good place and if you get a good rate I will stay here again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-08-16T05:54:04-0400", "location_id": "85833", "id": "406121504", "user": {"username": "markballinger", "user_location": {"name": "Jacksonville, Florida", "id": "60805"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-08", "title": "Not quite what it used to be", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r401543672-m11068-Governors_Inn-Tallahassee_Florida.html#review401543672", "text": "I have been staying here for about ten years, several times a year.  It is the only place I stay when coming to Tallahassee, and I come almost exclusively for business.  The rooms are fine...antique style furniture, comfy beds, in most rooms.  Each is unique.  I have stayed in all courtyard, some interior, and most loft suites.  \n\nI don't think anything has changed in the last 10 years, so it probably about time for some renovation.  Over the years though, it has gone downhill in many other respects.\n\nCleanliness...relatively ok, used to be better. I have had rooms with rings around toilets, hair on floor, etc., especially in the past year or so.  Dust is visible.  Thankfully they have reinforced the courtyard doors with deadbolts, because they used to just open.  They have had AC issues, but always moved me to another room if my original room was subpar.  \n\nBiggest complaint is the service now.  Valet is present, somewhere purportedly.  Never when you seem to need it.  No one greets you anymore, it seems, and you always wait for someone to show up at front desk.  I usually bring my own bags to my room now, otherwise who knows when someone will be available to bring them.  A few years ago they used to have room service through a local eatery.  Not sure what happened but they do not have that anymore, and the continental breakfast seems more sparse with each visit.  They purportedly have a managers happy hour...I usually am not able to make it, but they used to have a good selection of beer and wine available after as well.  Now, the selection is insulting.  Frontera  something for white, and Fronterra Merlot for red.  All 1.5L.  This is a $9 bottle, for 1.5l.  Are you serious?! Is this a college student hotel? I understand we are in Tallahassee, but after happy hour you charge guests and $5 for a glass of this garbage is ridiculous.  I don't care about the price, keep some quality wine on site if you keep wine at all. And beer...bud light, mich ultra? They used to be have a decent selection. Again, we are not college students. I understand they don't have to have anything, but please don't insult your clientele with such horrible selections.  This hotel has the reputation of a higher class hotel in Tallahassee, and it used to be.  Now, not so much.  Please Governor's, step it up.  This hotel used to be the crown jewel of hotels in the area.  Now, it feels like they are trying to get by with the barest of everything.  The towels are even ratty now.  Location is huge, and they have that going, but the quality of stay has continuously decreased in the past 10 years, and drastically in the last 2.  \n\nI really would recommend that Governor's evaluate its quality and reinstate some of the things that used to make this a great place to stay.  Now, it is truly marginal at best.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-08-04T20:48:07-0400", "location_id": "85833", "id": "401543672", "user": {"username": "MrsGatorgirl", "user_location": {"name": "Orlando, Florida", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Governors Suite", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r399186066-m11068-Governors_Inn-Tallahassee_Florida.html#review399186066", "text": "Great location next to Capitol, valet parking only, no elevators, nice breakfast included with room rate, wifi free, uncomfortable sleeper sofa,   Fridge and sink in suites.   Plenty of restaurants within walking distance.   Old property but nicely refurbished.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-30T07:16:39-0400", "location_id": "85833", "id": "399186066", "user": {"username": "raineyg", "user_location": {"name": "Port Saint Lucie, Florida", "id": "34580"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-07", "title": "Just ok stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r397561418-m11068-Governors_Inn-Tallahassee_Florida.html#review397561418", "text": "The staff was friendly and helpful. The rated the room as just ok because the phone didn't work and I was a little nervous about the courtyard door being secure. I would stay on another floor if we ever stay there again. The bed was surprisingly comfortable. There is a bar across the street but we could not hear the music and it ended by 11:00. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-26T10:50:42-0400", "location_id": "85833", "id": "397561418", "user": {"username": "Tracy Q", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Cozy Inn", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r395891342-m11068-Governors_Inn-Tallahassee_Florida.html#review395891342", "text": "Location: great! Atmosphere: great! Staff: great! History of building: great! This is a fun inn with historical info about different governors throughout the years at the entry to each room (each room is called that governors name). Plus the place used to be a horse stable and the beautiful arched wood is still showing throughout. I will stay here again and again when visiting Tallahassee!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-07-23T11:28:39-0400", "location_id": "85833", "id": "395891342", "user": {"username": "jlsweeney", "user_location": {"name": "Crestview, Florida", "id": "34159"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "The only place to stay in Tally", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r392126563-m11068-Governors_Inn-Tallahassee_Florida.html#review392126563", "text": "I read some TripAdvisor reviews and really was not sure whether to stay here.  Although mostly positive, it seemed there was also a lot of negative.  Truly, there is no negative.  This place is wonderful - from the time you check in until the time you check out.\n\nAs soon as I arrived, I was greeted warmly by both the valet and the front desk reception.  Both of them asked me what they could do to make my stay better.  I felt entirely comfortable asking them all kinds of questions about Tallahassee and they were both very knowledgeable.\n\nI booked a Courtyard room on the first floor loft and it was lovely.  You have to walk a few steps upstairs to get to it but is that really a big deal?  A lot of the reviews talked about the fact that there is no elevator and you have to lug your bags upstairs.  The valet was perfectly happy to grab my bags for me but I am perfectly capable of carrying them myself and climbing stairs.  If you are a person who cannot climb stairs, there are rooms on the first floor - a ton of them.  \n\nIf you stay there, you get 20% off the sushi restaurant a few steps away.  The place is AWESOME!  Best Sushi I have had in a long time.  Jasmine - fantastic.  Soup, salad and two sushi rolls for $10 bucks.  With the 20% off, $8 bucks!  \n\nI had a big interview at the Capitol the next day and I was exhausted.  The bed was truly wonderful and comfy.  It was the first time I have slept past 7 am in months.  And the pillows were fine.  Someone complained that they were lumpy - not the case.  Yes, they are foam pillows but it you want feather pillows, bring your own (I did).  \n\nThe toiletries in the bathroom are wonderful and they are in a lovely little basket with lots of towels.  The display was just adorable and a nice touch.\n\nThey have complimentary wine and you do have to ask for it.  I'm pretty sure they'll let you have as much as you want - although I didn't drink any of it because of the pending interview.  Still, another nice touch.\n\nBreakfast the next day is a continental breakfast.  I also saw a bunch of reviews complaining about breakfast.  I suppose people want them to make omelets or something.  They had cereal, toast, muffins, yogurt and bagels - I had an asiago bagel which was out of this world.  Yummy.  They also have a make your own waffle station - the kids love that!  The coffee, too, which was necessary before heading to the Capital, was really good.\n\nAll in all, I can say that when I go to Tallahassee, I won't stay anywhere else.  This place is amazing, the staff is amazing and it truly feels like home.  If you want to go somewhere where you are treated like family, this place is it.  If you want the industrial, standard, boring chain hotel, go down the street.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-07-13T08:33:16-0400", "location_id": "85833", "id": "392126563", "user": {"username": "Blancheee", "user_location": {"name": "Naples, Florida", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Boasts an old-world charm most hotels lack these days", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r391449517-m11068-Governors_Inn-Tallahassee_Florida.html#review391449517", "text": "In all honesty, I'd probably give it 4.5 stars. What a lovely inn, though. You just can't find this kind of styling and charm in new construction. So, what it lacks in brand new-ness, it makes up for in authenticity. Check in was a breeze. The valet parking was convenient. Our room was on the 2nd floor and close to the front of the hotel. THAT was a small problem, in that it was a Thursday night in a college town, and the hotel is across the street from a popular bar. Someone parked their truck in the road near the hotel and the pounding bass was a major annoyance as we tried to fall asleep. Additionally, the room was over the breakfast area, so we were awakened around 6 a.m. by the clatter of dishes. I requested a move to the back of the hotel, and we were accommodated with not penalty or resistance. (Obviously, it helped that the hotel was not fully booked.) Just ask for a room at the back of the hotel when you book your room. Or bring your earplugs.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-11T10:47:30-0400", "location_id": "85833", "id": "391449517", "user": {"username": "progonoskis", "user_location": {"name": "Florida", "id": "28930"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Pleasant stay!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r384355984-m11068-Governors_Inn-Tallahassee_Florida.html#review384355984", "text": "It was hard to find the hotel,since there wasn`t a sign with the name of the hotel,just a small sign\" HOTEL\"!WE booked the Governor`s Suite and we got the Governor Holland room!THe room was large,antique furniture ,but very dark,specially in the living room!There was lack of lamps !THe bed was very tall,I am a petite and short woman!I wish there was a bench helping me climbing the bed!THe location was great and Tallahassee is a very easy city to move!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-20T10:47:33-0400", "location_id": "85833", "id": "384355984", "user": {"username": "Liylly", "user_location": {"name": "Sao Paulo", "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Almost great", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r381907130-m11068-Governors_Inn-Tallahassee_Florida.html#review381907130", "text": "This place has been renovated but not 100 percent.  There are still some quirks and in some spots areas of improvement .  The shower curtain is all plastic rubber and one of the Windows lacked a curtain and only had slats that faced the street.  My colleague said they couldn't sleep due to a loud fan going on and off in his room.\n\nMe?  I slept like a baby, loved the location from where you can walk to restaurants and the old school vibe.  Breakfast downstairs was complimentary and the staff was lovely.\n\nI will make this my Tallahassee hotel from now on.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-06-12T09:01:30-0400", "location_id": "85833", "id": "381907130", "user": {"username": "crazytravelernyc", "user_location": {"name": "New York City, New York", "id": "60763"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Sweet hotel!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r380264464-m11068-Governors_Inn-Tallahassee_Florida.html#review380264464", "text": "We were traveling across country and stayed at this sweet hotel. It's old and charming, but well kept and clean. \n\nBreakfast was good. Staff was friendly. Parking was easy. \n\nThe 4-poster beds are VERY high, which was a bit stressful with young kids (admittedly this isn't a hotel specifically designed for kids), so we had to move a mattress down for the kids. But beyond that, it was clean and sweet. \n\nNo complaints! ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-06T07:14:13-0400", "location_id": "85833", "id": "380264464", "user": {"username": "Hannah W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Charming!", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r380076701-m11068-Governors_Inn-Tallahassee_Florida.html#review380076701", "text": "We decided to stay at the Governors Inn while passing through Tallahassee.  Having attended FSU as undergraduates we never had a chance to stay at the Inn so while passing through town and having the option to stay anywhere we decided to stay at the Inn for the experience of something local, historic, and charming...out of the ordinary.  The staff was very friendly and accommodating throughout our stay.  We woke up early to get on the road before the typical coffee and breakfast time - we called the front desk for coffee and it was delivered with little delay - made just for us.  Beds are comfortable and rooms are clean!  The bathrooms are a bit dated but we didn't mind.  Overall, a very pleasant experience.  We will be back.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-05T15:51:26-0400", "location_id": "85833", "id": "380076701", "user": {"username": "Lauren W", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-05", "title": "Very bed and breakfast like", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r379593102-m11068-Governors_Inn-Tallahassee_Florida.html#review379593102", "text": "We arrived late, 11:00 PM, only to discover that we had to park on the street or pay a valet $12 to park our van. We parked on the street and had no issues.\n\nThe room was amazing and historically furnished. BEAUTIFUL!\n\nThe breakfast had a lot to be desired, basically only Cheerios and milk.\n\nThe staff was very accommodating and friendly.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-04T03:43:58-0400", "location_id": "85833", "id": "379593102", "user": {"username": "Creechcr8v", "user_location": {"name": "Memphis, Tennessee", "id": "55197"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-05", "title": "Historic but...", "url": "https://www.tripadvisor.com/ShowUserReviews-g34675-d85833-r376817132-m11068-Governors_Inn-Tallahassee_Florida.html#review376817132", "text": "If you want an historic ambiance, antiques and close proximity to government buildings and museums, you might like the Governor’s Inn.  However, there is no elevator and our double queen room required negotiating four flights of stairs. The doorman carried our baggage up and down.  He also recommended some restaurants, since the Inn serves no food, though you can buy a few drinks and snacks from coolers near the check-in desk. The desk clerk was new; he couldn’t find our reservation at first and didn’t know how to make room keys.  The fourposter beds were so high that they required a step stool to get in and out. Continental breakfast consists of coffee and pre-packaged mini-muffins. All in all, I prefer a modern hotel with amenities and probably would have liked the Doubletree down the street.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-05-26T11:49:46-0400", "location_id": "85833", "id": "376817132", "user": {"username": "Forsyth", "user_location": {"name": "North Carolina", "id": null}}}]}