{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2012-07", "title": "Perfect??!! HA!! Far From it... Save your $ for something else", "url": "https://www.tripadvisor.com/ShowUserReviews-g33165-d3317046-r139488116-m11068-Perfect_Pairing_Walking_Tour-Temecula_California.html#review139488116", "text": "Stay away from the far from \"Perfect Pairing Tour.\"  It is a rip off full of lies from the owner himself.\n\nWe bought this deal on Amazon local with promises of gourmet food and wine tastings, professional chef led tour + $20 credit toward any of the shops you visit -HA! \n\nhttps://local.amazon.com/inland-empire/B0085F1UAQ\n\n That's what they would like you believe! For starters, their website wasn't set up for booking online although it said it was.  After calling them to book a tour,(20 mins. into the call) giving the owner helpful hints on how to make his website more user friendly and pointing out errors on the website like the 2 check in times that are posted for the same tour:\n\nCheck in at 11:30 am Tour Starts at 12:00 pm sharp.\nCheck in at 1:30 pm and Tour starts at 2:00 pm sharp.\n\nI was told (by the owner) all tours start at 2:00 and check in is at 1:30 because they want the tour to end at the beginning of happy hour at Sweet Lumpy's.\nAfter inquiring about the 3 types of tours posted on their website, I was told they were all the same.\n\nThat should have been our first clue the to highly disorganized, sloppy, unprofessionalism we encountered ...all starting with the owner of this business himself! YIKES!  Unfortunately, he makes it an absolute mess for everyone involved. Poor vendors they roll their eyes at hearing about yet another misfortune created by the owner, Ian.\n\nWe arrived for our tour at 1:30 pm for our tour (that is supposed to start at 2) as that it is the time the owner told us to arrive only to find out that the tour had already left because it started at noon!  Well, the gracious lady at Villa di Calabro  called the tour company for us.\n\nSomeone apologized to us for the confusion and asked who had told us to arrive when we did. When everyone figured out the owner is the one responsible for our late arrival, we were promised that they would make it up to us somehow because we had already missed half of the tour.  We were told they would comp. dinner for us to make sure we were happy  since we had booked a hotel room down the street to come in to town just for this event.  \n\nThe tour guide came to pick us up and walk us over to join the tour, so that we could at least enjoy the last 1/2 of it.  Turns out the others on the tour had been  told there was no tour scheduled for that day when they arrived! [smh]\n\nWe felt bad for Kristine the tour guide.  She had to pick up the slack for the obvious mess she did not create.  All stops along the way were not surprised by the lack of organization.  What a trooper Kristine was!  She was fabulous!\n\nApparently, these tours are new and we were just tour #6. We were on the \"happy hour tour\" and those begin in 2 weeks, though the website doesn't say so, and the owner says the tours are all the same.\n\nAll this to say, we had fun on the  1/2 tour we did manage to have.  However, no promised gourmet food tasting, no professional chef led tour + $20 credit toward any of the shops you visit.  Here's what they pass off as \"gourmet\" -we had a Mexican food appetizer platter to share, and deep fried happy hour fare, oh, I guess the chocolate covered bacon is considered a \"specialty\" there.\n\nSo, this nightmare continues...\nWe were told a variety of things that they would do to make up for owner's mistake:  a comp. dinner, to a private tour, for the same night...which turned into the same promises for the next day since we had booked a hotel.\n\nAt the end of our tour, Kristine - offered to have us go to another wine tasting and participate in an \"open mic\". We were not in the mood to sing and were wondering when or who will handle the comp offer. I mentioned this to Kristine and she was a bit surprised about it. Our tour guide steps away to call the owner unbeknownst to us and then suddenly hands me the phone to speak directly with the owner, Ian.  An angry Ian, gives me an earful about how we got \"most of the tour\" minus a couple of things like the olive oil tasting \"which is free anyway and we can do that on our own anytime\" and blasted off about how we were trying to \"milk this for all we could.\"  Hearing Ian's clearly agitated yelling at me, the customer, I returned the phone to Kristine without incident as there was no point in attempting to reason with someone who was determined to blame us again, his customers.\n\nWell, ZERO, NADA, ZILTCH was made up for. We were told on the phone from whom I don't know that we would be taken care of and a dinner or something would be offered. Our checkout time was at noon from the hotel.  We got a call at 11:30 from Kristine that we would get a call in 20 mins and about meeting to pick up some gift certificates.   An HOUR later, Ian calls and gives us another earful, this time with a ton of excuses from his car breaking down, he was so stressed and under pressure, etc. Ian also chose to bad mouth his tour guide and blamed everyone for his lack of professionalism. WHAT A MESS!\n\nThis tour is a nice idea if it were managed professionally.\nSadly, it is not.\n\nMy advice:\n\n1. STAY AWAY!\n2. If you have already purchased an online daily deal from Amazonlocal, Living Social, Groupon, etc. ask for a refund immediately.  This is not worth your time. Thanks Amazonlocal  for your 30 day refund policy!", "helpful_votes": "8", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2012-09-05T08:23:28-0400", "location_id": "3317046", "id": "139488116", "user": {"username": "jane4c", "user_location": {"name": "Los Angeles", "id": null}}}]}