{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-11", "title": "Great food", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r436679051-m11068-STACKED_Food_Well_Built-Torrance_California.html#review436679051", "text": "Love the simplicity of the iPad ordering system. The food is great and the staff are really friendly. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-11-12T13:09:14-0500", "location_id": "3725195", "id": "436679051", "user": {"username": "Arturo G", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-09", "title": "Love the concept for customization!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r432174083-m11068-STACKED_Food_Well_Built-Torrance_California.html#review432174083", "text": "Love the whole idea that you can customize whatever ingredient you want on the food of choice.\n\nThe other thing, i wish they would let us to customize as well is the sandwich, sandwich are the only food on the menu that you cannot customize!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-27T09:04:06-0400", "location_id": "3725195", "id": "432174083", "user": {"username": "Concernguest", "user_location": {"name": "California", "id": "28926"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-03", "title": "Good concept - problems with the execution", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r402613634-m11068-STACKED_Food_Well_Built-Torrance_California.html#review402613634", "text": "This is a restaurant where you can specify virtually every element, every detail on your plate.  I like Romaine lettuce the best in an entrée salad. No problem - just select it on the ordering notebook. Often, I find that tomatoes don't taste as good as I'd like them to, and so I delete them on the ordering notebook. I like jicama, and it's not always included on a salad.  No problem - you guessed it - add it on the notebook. \n\nI love being able to create my uniquely favorite salads. Unfortunately, I think it is very complicated for the people in the kitchen to put these dishes together, when every ingredient must be checked and double-checked? Perhaps a better system could be developed for the kitchen to view and then assemble orders? \n\nOne time when we were there, my daughter's sandwich came out after about 15 minutes, while my salad came to the table after two inquiries, and after she'd finished her dinner. We had it boxed, to go. The manager came over and comped it, with apologies, which I appreciated since it was the right thing to do.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2016-08-07T17:22:05-0400", "location_id": "3725195", "id": "402613634", "user": {"username": "NYCbacktoLAhooray", "user_location": {"name": "SoBay, CA", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2015-07", "title": "Over Priced Burgers", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r382924536-m11068-STACKED_Food_Well_Built-Torrance_California.html#review382924536", "text": "Stacked has a modern system where you sit at a table and order on line.  They bring you the food and that is about all.  The burgers are about $15.00 which is way over priced.  There is very little service at all.  I ate there once and never again.  I think it is a lot of money for the very little service provided.  I can get better burgers at In N Out Burger.  Frankly I do not know how Stacked stays in business; my guess is a lot of young people go there.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2016-06-15T13:39:29-0400", "location_id": "3725195", "id": "382924536", "user": {"username": "Metrotorrance", "user_location": {"name": "Torrance, California", "id": "33182"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-10", "title": "Happy hour", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r344835763-m11068-STACKED_Food_Well_Built-Torrance_California.html#review344835763", "text": "It was ok for a happy hour.  The drinks were a little pricey  the appetizers were ok but not much of a selection.  ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-02-03T12:40:23-0500", "location_id": "3725195", "id": "344835763", "user": {"username": "John S", "user_location": {"name": "Torrance, California", "id": "33182"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-01", "title": "A good choice for fresh food", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r338944924-m11068-STACKED_Food_Well_Built-Torrance_California.html#review338944924", "text": "This is a hip place with a good food selection. Customers order via an I-Pad on each table. Servers are available to explain the menu and assist with ordering via the I-Pad. \nThe food is mainly comfort food, with great hamburgers, pizza, wings, salads and other selections. They also have a full bar with many beers on tap.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-01-10T09:18:18-0500", "location_id": "3725195", "id": "338944924", "user": {"username": "137rick", "user_location": {"name": "Buena Park, California", "id": "32122"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Bacon.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r337379030-m11068-STACKED_Food_Well_Built-Torrance_California.html#review337379030", "text": "I love burgers and the variety is awesome. I pad screen is used to order and you have pictures of all your toppings, sauces and more. Don't forget the bacon", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-01-04T14:18:05-0500", "location_id": "3725195", "id": "337379030", "user": {"username": "Steve M", "user_location": {"name": "Redondo Beach, California, United States", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-06", "title": "Food wins for being good when served hot, and service needs inmprovement", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r334719632-m11068-STACKED_Food_Well_Built-Torrance_California.html#review334719632", "text": "The food was good, but the service wasn't that great.  I'm going to  try to side with the fact there was a large group of 20 and the one waiter was over overwhelmed.  \nYou'd think with the iPad ordering it would be a bit easier to keep track of things ordered but there are some kinks they still need to work out. Some people were confused with the iPad ordering and needed extra help.  So the one waiter had to stop and help about half the group to try and help them with the order.  Eventually he started to take orders the old school way.  \n\nKeep in mind we did not walk in with a group of 20, we made reservations so it was no surprise we were coming.  This was a Thursday night so it wasn't as if the place was crowded.  12 of us were there at first and there was one waiter to serve 12 people.  Just getting the drinks to us was a chore.  When our food started coming out in spurts we received burgers with no fries, and then came the fries but they were cold.  The concept is cool and the food is good.  I would really like to go back with a smaller group and see if the service is better.  It’s unfortunate the other staff didn’t assist until near the end of the meal.  Really the restaurant was pretty empty so for his coworker to lend a hand I don’t think would have been a big deal.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-12-23T20:18:39-0500", "location_id": "3725195", "id": "334719632", "user": {"username": "lowbuxlux", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 3, "travel_date": "2015-12", "title": "Build-Your-Own-Burger", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r333179313-m11068-STACKED_Food_Well_Built-Torrance_California.html#review333179313", "text": "After my previous review on Yelp, Mr. Paul Motenko (co-owner) reached out to me to give his restaurant another opportunity as his guest. I'm impressed that he is proactive to respond/reach out to existing/past patrons... since most new businesses tend to fail within the first 5-10 years.\n\nI was at the mall this afternoon (12/06/15) to try to finish my Christmas shopping, & stopped in with my family. Customer service was night & day from my 1st visit; considering it was linner time & the restaurant was fairly packed, we were attended to promptly. Upon entering, we waited for the hostesses to finish their discussion before one greeted us. I requested to sit in a booth to allow privacy in case I needed to nurse my newborn.\n\nOnce we were seated, we were left to our own devices but we knew what we wanted, then paged our server to inform her of my Yelp check-in deal (50% off any regular price appetizer); she came within in 5-mins., reviewed my order [Pepper Stack Burger (angus beef with pepperjack cheese, roasted poblano pepper, grilled tomatoes & onions, & red pepper aioli on brioche bun), kids chicken tenders (5 pieces of chicken tenders with baby carrots & fries), Burger Bytes appetizers (3 angus beef with lettuce, tomatoes, pickles, red onions on mini-brioche buns), & large fries], & sent the ticket to the kitchen.\n\n10-mins. after placing our order & H was almost done drawing on her kids placemat, the sliders & fries came out. My husband said the sliders were much better than the burger from the initial visit. The fries were hot, crispy on the outside & tender on the inside, & minimally salted; they were just slightly too hot to handle so I had the little one eat hers with a fork. We were about 1/3 into the appetizer & side when Nicky reappeared with my burger & daughter's kids meal.\n\nMy burger was cooked perfectly (medium-well)... it was warm & juicy, but lacked flavor/seasoning if it weren't for the pepperjack cheese, poblano pepper, & aioli. The bun was toasted so it held up well during my meal, instead of the ingredients oozing out of it. With each bite, I got a string of ooey-gooey cheese, including my last morsel; my burger was warm from start to finish. =)\n\nH didn't like her chicken tenders & swapped all of them for 1 of my husband's sliders. I asked why she didn't like them... she said the skin [batter] & meat tasted funny. I took a taste & didn't find anything wrong with them other than the batter being a little bland, the chicken itself was tender but under seasoned. We were done in under an hour & my newborn slept through the meal so it was an uneventful dining experience when I was expecting drama from the kids. Whew!\n\nOur server, Nicky, was friendly & efficient. She stopped by at opportune times to drop off our order, checked on us & asked if we needed anything (i.e. condiments, water refills, etc.), & cleared our empty/dirty plates. Upon check-out, I noticed the appetizer discount was applied. This girl was on-the-ball! I was having trouble with my card's magnetic strip & somehow it worked for Nicky; she must have the magic touch or the cards are \"stacked\" against me (yes, pun intended) just to prove how awesome Stacked's/Nicky's customer service. When Nicky returned with my receipt, she threw in an incentive for us to return; scratchers for free food or a prize on our next visit within the incentive's time frame. Upon hearing that, H shouted we HAVE to come back because she loves scratchers & winning something. Sneaky Stacked. ;-)\n\nI find that knowing the menu & exactly what you want helps speed up the online ordering process, & it doesn't hurt to be familiar with their app. I'll reiterate that the food is average & pricey--you don't get the bang for your buck here, but customer service was much improved on this visit. I think the price point should be adjusted in comparison with other build-your-own-burger restaurants... as some Yelpers noted, there are better options available.\n\nHere's another tip, Stacked: I noticed there were quite a few family patrons with young children. Have you considered installing some games on the iPad to keep them entertained? It'll save you the expense of printing kids placemats & buying crayons, it's more green/environmentally-friendly. Granted, the kids might prefer to game instead of eating, but it'll keep them entertained longer until the food arrives & when they finish their meal before the adults.\n\nThis is a 3.5 rating instead of 4 due to taste & value. Would I come back? Yes, especially when you have a 5-year old that will keep reminding you of the potential prize that you will win. :-)", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-12-15T17:47:01-0500", "location_id": "3725195", "id": "333179313", "user": {"username": "Kimberly L", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-11", "title": "Not as good as last time", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r327617909-m11068-STACKED_Food_Well_Built-Torrance_California.html#review327617909", "text": "I had the gluten free burger last year.  very good.  This time it was very crowded and the staff seemed overwhelmed.  I order the gluten free pizza with dairy free cheese.  It came really late - after everyone else's food.  Then it was burnt to a crisp.  It took a long time to make the next one (not really their fault), so much so that I had to take it with me because the meal made us late.  The pizza was good, and I'd go back, but only when it wasn't overly busy.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-11-18T06:44:13-0500", "location_id": "3725195", "id": "327617909", "user": {"username": "Janetlynn13", "user_location": {"name": "Pittsburgh", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "Stacked My Way", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r312818398-m11068-STACKED_Food_Well_Built-Torrance_California.html#review312818398", "text": "Stacked is a wonderful place to go if you're in the mood for a sandwich, burger, mac and cheese, pizza or salad.  The server was very helpful and friendly.  He explained how to order our food on the tablet.  Everything is listed in categories on the right.  Simply tap and the food picture appears on the left.  The menu offers regular entree items that you modify to suit your tastebuds.  If you order a cheese burger, for instance, you see the burger in layers showing all the ingredients in the burger.  If you want something additional, simply search on the right and drag it to your burger picture.  If there's something you don't want on it, tap the item and drag it to the right.  If you want it on the side, drag the picture in the space between the burger pic and the listing on the right.  There are so many choices!  There must have been 15 sauce choices for the burger - not just catsup, mustard or mayo.  If you see something on the menu for another entree and it's not listed on the right menu, simply ask and they'll add it to your entree.  I ordered a cranberry walnut salad with chicken.  It had spinach, cranberries, walnuts, smoked applewood bacon, red onions, avocado, Point Reyes blue cheese and a whole cut up chicken breast.  I could have switched the spinach for one of 8 lettuce offerings.  My friend had a prime rib sandwich (8 oz!) with au jus.  Both meals were ample servings.  We did order a large shoestring french fry.  They were done to perfection.  It could have easily fed three people.  Can I mention, they had regular fries, shoestring fries, waffle fries, sweet potato fries, cheese fries, or combo fries.  Mac Cheese will never be the same.  Stacked offers 8 different varieties including lobster mac n' cheese!  Next time I'll have to go for dessert.  Make your own ice cream sandwiches, sundaes or shakes.  The possibilities are endless.  There is a kids menu.  This is a fun casual place to visit with friends or family.  If you sign up for their \"club\" you can get happy hour appetizers at the happy hour rate anytime of day you go there.  They serve alcohol.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-09-22T12:14:51-0400", "location_id": "3725195", "id": "312818398", "user": {"username": "Honolulugirl18", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-08", "title": "Great concept could do better", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r309344339-m11068-STACKED_Food_Well_Built-Torrance_California.html#review309344339", "text": "We visited this restaurant after viewing the website and it looked like there was a lot of variety.\nThe concept is great, order from an iPad and basically design your own meal. You get exactly what you ask for do even the fussiest of eaters should be happy.\nFood was not the best I've had during my visit but it was good enough, just not amazing. Two of us had bunless burgers which were nice (chicken and veggie) whilst the other had pizza which didn't look that appealing but was a huge portion.\nThe decor let it down a bit for me, felt like I was in a fast food chain not a restaurant.\nWould recommend a visits though.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-09-11T13:24:42-0400", "location_id": "3725195", "id": "309344339", "user": {"username": "GazandKel", "user_location": {"name": "Derby, United Kingdom", "id": "187048"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-07", "title": "Cool place to try!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r296016272-m11068-STACKED_Food_Well_Built-Torrance_California.html#review296016272", "text": "Heard about this place from a friend that visited SoCal recently, so naturally.. I had to bring the kids to try it.  You order off the I-Pad at the table… and the process was a little slow as it was our first time.  The girl who seated us also gave us the option of ordering with her if we'd rather do that, but we opted to use the I-Pad so we could see all of our options.  We didn't get too crazy though.. ordered a few burgers and a salad.  Although everything tasted wonderful and was presented well, the food arrived before the drinks, which the wait staff did not notice and I had to call them back and have them check on our drinks.  The food arrived fairly quick.  Then we ordered a milkshake which also took forever to get.  Paid about $95 for a party of 5.  It was neat to try this… just not sure I'll be back.  \nPros: the bar with LOTS of options.\nCons: It's located in the mall, which made it a little hard to find since I am not from the area.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-08-05T08:27:40-0400", "location_id": "3725195", "id": "296016272", "user": {"username": "Beatrice C", "user_location": {"name": "Visalia, California, United States", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2015-06", "title": "Interesting concept, but food was just \"OK\"", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r282086138-m11068-STACKED_Food_Well_Built-Torrance_California.html#review282086138", "text": "Met some family members here while in the area.  The restaurant's concept is focused on giving you the options to \"customize\" your order by doing everything via a tableside tablet and selecting a myriad of options.  While not overly complicated, I found the concept more annoying than entertaining and really would have preferred just ordering in the customary fashion and not dealing with the tablet.  The food was good, not great, and wasn't overly quick being served.  The restaurant was a bit dark and somewhat minimalistic in the table set-up.  Not bad, but no real wow.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-06-22T06:40:37-0400", "location_id": "3725195", "id": "282086138", "user": {"username": "Kevin L", "user_location": {"name": "Maumee, Ohio, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-03", "title": "I LOVE THIS PLACE!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r279411662-m11068-STACKED_Food_Well_Built-Torrance_California.html#review279411662", "text": "This place is awesome!  I love how you get to order on the iPad!  Their milkshakes are awesome!  I love their wedge salad and eggs and carrots and ranch!  Their french fries are the bomb!  My son loves their mac and cheese!  Just great menu and great food and great atmosphere.  My husband LOVES the beer!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-06-10T20:08:45-0400", "location_id": "3725195", "id": "279411662", "user": {"username": "Tami M", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-10", "title": "Excellent food - and concept", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r276268060-m11068-STACKED_Food_Well_Built-Torrance_California.html#review276268060", "text": "Great place where you order yourself on iPads at the table.  You can completely customize you order.  Absolutely recommend!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2015-05-31T14:07:40-0400", "location_id": "3725195", "id": "276268060", "user": {"username": "Renae T", "user_location": {"name": "Torrance, California", "id": "33182"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Fun times!!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r262171526-m11068-STACKED_Food_Well_Built-Torrance_California.html#review262171526", "text": "The most fun I have had in LA in a very long time. Took my friend here for his birthday and it was a blast. Our waitress name was Nash and she was wonderful.  We had a few mistakes made on our order and they were quick to resolve them the manager was more than wonderful about fixing everything and being sure we were satisfied. The next time I take a girls trip out west I have to bring all of us here if we're going to end a Friday night the best way possible!!!!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-03-27T17:20:39-0400", "location_id": "3725195", "id": "262171526", "user": {"username": "Diva135", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-11", "title": "Order on a IPAD", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r241338710-m11068-STACKED_Food_Well_Built-Torrance_California.html#review241338710", "text": "Stacked is a perfect place to go to when you want to eat get your food pay and go without hardly waiting. Perfect if you are grapping a bite before movie for example. At your table you will find an ipad that you can scroll through the menu to pick your appitzers drinks food and dessert.  You literally begin to stack your ingredients on your burger, pizza or salad.  There are a variety of cheeses, meats, sauces lettuce and bread to choose from to stack to perfection.  Each person takes turns at the ipad then you push the send to kitchen button and you are done.  In a few your waiter will pop up at your table with your meal.  You can also pay right when you finish ordering or you can wait to the end of your meal either way you dont have to flag down a busy waiter you just swipe you card and go.  There is also a button to split the check and you can use multipe cards as well as call for a waiter and pay cash.  If you pay at the beginging and decide you want dessert you simply swipe your card again and stack your ice cream sandwich etc... and hit that send to kitchen button again. I love the fast service and the hands on approach to this restaurant. They also have happy hour and a full bar. Ilove their skinny fries with the curry ketchup or aiola sauce", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-11-24T16:41:08-0500", "location_id": "3725195", "id": "241338710", "user": {"username": "Niketa C", "user_location": {"name": "Los Angeles, California, United States", "id": null}}}, {"lang": "en", "rating": 3, "travel_date": "2014-10", "title": "Wonderful Customizing But Nothing More", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r232789037-m11068-STACKED_Food_Well_Built-Torrance_California.html#review232789037", "text": "It was an...okay experience. The i-pad creates a fun and unique method of ordering food, and it's great for customization. There is a wide variety of options. After we ordered, we waited for a long while. and when it finally came, I was kind of disappointed that the food was a little cold- as if it had been sitting for quite a while. It would have definitely tasted better if it was warm. The service was nothing special, the servers were just doing their job and nothing more.The space inside though was very spacious. Because they had the football game on the TV, there were a couple other customer who got overly noisy and excited when their team made a goal, but that's understandable. If I had to, or circumstances provide that I go to that area again, I would eat here just for the fun of customization.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-10-05T18:52:40-0400", "location_id": "3725195", "id": "232789037", "user": {"username": "Erika H", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-08", "title": "Excellent options - wide variety", "url": "https://www.tripadvisor.com/ShowUserReviews-g33182-d3725195-r224580697-m11068-STACKED_Food_Well_Built-Torrance_California.html#review224580697", "text": "We love this place.  The kids love ordering on the iPad and the food is REALLY good.  High quality salads, large portions.  We LOVE their milkshakes and SO many choices", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2014-08-26T06:44:29-0400", "location_id": "3725195", "id": "224580697", "user": {"username": "TravelPro4You", "user_location": {"name": "San Pedro", "id": null}}}]}