{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2014-02", "title": "Yes, Yes, I am certainly feeling something, but I don't think it's the love.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42763-d6275108-r194052541-m11068-Instafirm_Body_Wraps-Troy_Michigan.html#review194052541", "text": "Just say No!!\n\nI too purchased a Groupon to Instafirm for a Facial Sculpting Session.  When I called to make the appointment I was immediately put off.  Before I had even stepped foot in the Spa the girl was telling me that the Groupon I purchased was basically worthless because the results would only last a few days unless I opted to purchase the $750.00 package to go with it.  \n\nNote, nowhere on their website does it say that it takes 10 visits to achieve results that last any period of time and then ongoing maintenance (Especially not under the before and after pics).  By the time I got off the phone I felt like I was trying to buy a used car.\n\nAll of that said and done, I had already purchased the Groupon so I made the appointment.  \n\nThe day of the appointment I setout to the Spa in less then pleasant weather conditions, and being new to the area managed to hit a horrid stretch of road and blow out two tires in a pothole. So there I am on the side of the road with AAA changing my tires and get a phone call from the Spa at 12 minutes after the hour. \n\nWere they inquiring to my well being? Noooo.  Where they calling to see if I was lost or needed directions? Uh Uh.  The message on my voicemail was, and I quote \"You are almost 15 minutes late so we are cancelling your appointment.  If you decide to rebook you will have to pay full price for a session before we would be willing to honor your Groupon on a second visit.\" \n\nDon't fall for their \"it was owned by a little old lady who only drove it on Sundays\" Groupon deals.  This is not a place looking to build client relationships or address your individual needs.  This is a get them in, get their money and get them out as fast as you can kinda place.", "helpful_votes": "10", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2014-02-14T05:45:02-0500", "location_id": "6275108", "id": "194052541", "user": {"username": "Kimberlykate N", "user_location": {"name": "Virginia", "id": "28967"}}}]}