{"paging": {"total_results": "13", "skipped": "0", "previous": null, "results": "13", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-03", "title": "Great Southwest and Mexican Artwork", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r414218411-m11068-Zocalo-Tucson_Arizona.html#review414218411", "text": "While in Tucson I wanted to buy some authentic southwest artwork and if possible Mexican artwork. We were referred by our hotel to Zocalo for the place to go. We were not disappointed. The only thing that stopped me from buying everything they had was my wallet. Great people, very friendly, we picked up some great pieces and they shipped it to our home. Can't wait to go back to Tucson to visit the store again. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": "RobertoyKarolina, Owner at Zocalo, responded to this review", "text": "Thank you so much for your kind review. We work hard to bring unique items to our store. So glad you appreciate our efforts and took the time to let us know!", "title": "Owner Response", "published_date": "2016-09-04T10:14:24-0400", "id": "414633685"}, "trip_type": "Business", "published_date": "2016-09-03T06:54:21-0400", "location_id": "550255", "id": "414218411", "user": {"username": "rabump", "user_location": {"name": "Schenectady, NY", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-02", "title": "YOW! WOW!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r347734241-m11068-Zocalo-Tucson_Arizona.html#review347734241", "text": "OMG! Had only a very few choice places that we wanted to find since my husband is not the world-class SHOPPER that I am but even he was 100% entranced and enchanted when we found this place AND he was the one who made the purchase so what does that tell you! It has the best of the best when it comes to Mexican accessories and we've been everywhere so know quality and prices PLUS the owner is a delight and will tell you all about each piece. We will most definitely be back here.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": "RobertoyKarolina, Owner at Zocalo, responded to this review", "text": "Thank you so much for your positive feedback. We enjoy our work and are happy to tell you the history of your purchases! ", "title": "Owner Response", "published_date": "2016-09-04T10:17:29-0400", "id": "414634843"}, "trip_type": null, "published_date": "2016-02-14T14:08:07-0500", "location_id": "550255", "id": "347734241", "user": {"username": "Lili1012", "user_location": {"name": "Sedona", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "A Treasure Chest", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r310698619-m11068-Zocalo-Tucson_Arizona.html#review310698619", "text": "This delightful store overflows with fine Mexican colonial furniture, pottery, rugs, Day of the Dead figurines, hand-embroidered Guatemalan pillow cases, jewelry, folk art, mirrors, tin stars, iron chandeliers, pillows, linens and the list goes on and on. When I entered Zocalo, I felt as if I had gone into the attic of a huge mansion, crammed with elegant, exceptional items. No inexpensive souvenirs in this place. Everything signals \"top quality.\"\n\nA man working here -- perhaps the owner -- told me the store had moved from its previous nearby address in June 2015 to this much smaller space. Thus, I often found myself edging past a kaleidoscopic array of objects, all calling for my attention. The plans are to move the store again in March 2016 to a currently  unknown permanent location.\n\nMeanwhile, a sale -- the first in 10 years -- was on when I visited in mid-September, 2015. Discounts at the time included 25 percent off on Mata Ortiz pottery and 60 percent off rugs. I resisted the urge to pluck many items from the shelves and instead browsed carefully. Photographs that I took will help me make a decision about something to buy in the next few days. I'm leaning toward a Mexican wood-carved Santos or a lovely Christmas ornament.\n\nI highly recommend Zocalo as a worthwhile stop for tourists and Tucson residents alike. The store is located in a strip mall just west of Broadway Village and has free parking.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": "RobertoyKarolina, Owner at Zocalo, responded to this review", "text": "Thank you so much Rumples for your kind review. We are so glad you appreciate the effort it takes to import special items for our clients.  Hope to see you soon!", "title": "Owner Response", "published_date": "2016-09-04T10:22:30-0400", "id": "414636684"}, "trip_type": "Solo travel", "published_date": "2015-09-15T11:23:09-0400", "location_id": "550255", "id": "310698619", "user": {"username": "Rumples", "user_location": {"name": "Tucson, Arizona", "id": "60950"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-09", "title": "A great find!", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r307628095-m11068-Zocalo-Tucson_Arizona.html#review307628095", "text": "While in Tucson visiting family members, I stumbled upon this amazing store. After talking to the utterly nice owners, I realized that every single piece of furniture was carefully picked in his original country (usually Central and Latin America) by the owners themselves. I ended up buying 4 splendid dining room chairs for our appartment in NYC, we were pleased with the way the store handled the shipping of the pieces. They arrived in perfect condition. We can't wait to go back to Tucson only to buy more furniture from Zocalo.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-09-06T15:33:50-0400", "location_id": "550255", "id": "307628095", "user": {"username": "diplorob", "user_location": {"name": "Paris, France", "id": "187147"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-04", "title": "I go here every time I'm in Tucson; a trip I must make each time :)", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r265346213-m11068-Zocalo-Tucson_Arizona.html#review265346213", "text": "I love the passion that the owners have for  the artifacts and furniture that they sell. They have some of the most beautiful and unique items from deep down in Mexico, European flea markets, and other exotic importers. Most of their furniture is crazy-big-gorgeous-carved-heavy woods, just stunning craftsmanship and artistry. They also have carved wooden chairs that are upholstered with gorgeous hand worked colorful fabrics. I usually go every year to see their collection of Caterinas and Calaveras, they are beautiful and delicate, wonderful folk art, unique tin punch pieces, beautiful milagro pieces, mirrors, just too much to name. It's such a fun place to roam around because they have such an endless variety of folk art, furniture, accessories and fabrics. I just remembered the saint figurines they have are also stunning. I love handcrafted art that the artist has put their heart and soul into, and you will find that here. Their items are expensive, but  given that they travel the world for these pieces, transport them home (very delicate, many of them), and they are truly unique and one of a kind...I wouldn't expect them to be bargains! If you want to take in some beautiful objects that are truly one of a kind, and maybe hear a story or two from the proprietors, it's definitely worth the trip.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2015-04-12T15:13:02-0400", "location_id": "550255", "id": "265346213", "user": {"username": "munkiemama", "user_location": {"name": "Orange County, Ca.", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-08", "title": "Beautiful Mexican furniture", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r227914474-m11068-Zocalo-Tucson_Arizona.html#review227914474", "text": "Robert and his team work with artisans from San Miguel Allende to create beautiful replicas of colonial Mexican pieces. Additionally the store is filled high quality Mexican pottery and remarkable artifacts. We have purchased many pieces over the years and still love to visit just to browse .", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2014-09-09T07:28:21-0400", "location_id": "550255", "id": "227914474", "user": {"username": "mjtravelerOmaha", "user_location": {"name": "Tucson, Arizona", "id": "60950"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-03", "title": "Zocalo Takes No Responsibility for Shipment Damage", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r206480393-m11068-Zocalo-Tucson_Arizona.html#review206480393", "text": "Zocalo was commissioned to pack and ship an antique music box, storage chest and 17 metal discs that played on the music box.  Upon receipt of the shipment it was immediately evident that Zocalo had improperly and poorly packed the discs resulting in them being bent and unusable.  I have sent picture and communicate step by step unpacking and yet the owner continues to want to blame the shipping company.  The shipment arrived in highly wrapped plastic film, neither the music box or the storage chest have even a scratch or any sign of damage.  The music discs were loose in the cabinet and had obviously been allowed to ship and move during transit.\nThe owner continues to blame the freight company and asks me to file a claim.  I can't file a claim as that would be wrong and fraud.  I have written to the freight company to inform them of the situation and that no claim should be honored.", "helpful_votes": "7", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2014-05-21T08:19:22-0400", "location_id": "550255", "id": "206480393", "user": {"username": "Ohio C", "user_location": {"name": "Dayton, Ohio", "id": "60785"}}}, {"lang": "en", "rating": 5, "travel_date": "2013-12", "title": "More of an experience than a store", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r187307234-m11068-Zocalo-Tucson_Arizona.html#review187307234", "text": "I went to Zocalo in search of a specific item and ended up spending at least an hour wandering around this big store. It was such fun to guess the origin of pottery, baskets and woven goods (often I was wrong). The sales people were helpful and interesting but didn't bug me as I browsed. Really enjoyed shopping there and I think this is the only time I've ever reviewed a store on Trip Advisor. Highly recommend but if you have children they will test your nerves - lots of fragile items within reach.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2013-12-10T12:50:08-0500", "location_id": "550255", "id": "187307234", "user": {"username": "megrey", "user_location": {"name": "Tucson, Arizona", "id": "60950"}}}, {"lang": "en", "rating": 4, "travel_date": "2013-09", "title": "great store, incredible inventory", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r177954951-m11068-Zocalo-Tucson_Arizona.html#review177954951", "text": "Drove by Zocalo and just had to stop, the windows were so inviting with lots of painted pottery.  The store is huge with everything from embroidered pillowcases, tablecloths, runners, furniture, mirrors, metal work, decor, jewelry. I even found some beautiful wool sweaters!  I spotted some beautiful and unique Christmas ornaments -- tin 3D stars (they also had beautiful ceiling lights in the shape of stars), birds in a basket...and ended up buying Christmas ornaments!  Told you they have it all!  The best part is that everything is very high quality, the best of the best, no junk or cheap stuff here.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2013-09-20T16:04:31-0400", "location_id": "550255", "id": "177954951", "user": {"username": "JamesBondLosAngeles", "user_location": {"name": "Los Angeles", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2012-01", "title": "My Favorite Store in Tucson", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r123299844-m11068-Zocalo-Tucson_Arizona.html#review123299844", "text": "There's something magical about this store. The selection of Mexican art & furnishings is beautiful... many things from this store are in my home!", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2012-01-19T05:50:59-0500", "location_id": "550255", "id": "123299844", "user": {"username": "Cyndi L", "user_location": {"name": "Tucson, Arizona, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2011-07", "title": "bueatiful art and furniture", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r119407964-m11068-Zocalo-Tucson_Arizona.html#review119407964", "text": "This store has to most beuatiful furniture and Mexican art in Tucson.  Make sure to check it out for the holidays or any time really.  I know I will be doing some Christmas shopping here.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2011-10-17T12:48:12-0400", "location_id": "550255", "id": "119407964", "user": {"username": "TucsonLocal123", "user_location": {"name": "Tucson, Arizona, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2011-08", "title": "Creative Furnishings/Colonial/Mexican/Indian", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r116174139-m11068-Zocalo-Tucson_Arizona.html#review116174139", "text": "Very large display of hand carved furniture, lamps, art, mirrors, rugs and pottery.\nMany of the furniture pieces are grand and very stately but there is something for everyone in the store from a hand made Mata Ortiz pot to Talevera pottery with the beautiful colors.  You will feel like you are in a museum and yet you are in a very nicely displayed retail store in Tucson.  Great Mexican restaurant right down the street for follow-up buying discussions!  Enjoy we did....", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2011-08-02T09:58:26-0400", "location_id": "550255", "id": "116174139", "user": {"username": "Caryl70", "user_location": {"name": "Rio Verde, Arizona", "id": "31332"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "Best of the Southwest", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d550255-r5651522-m11068-Zocalo-Tucson_Arizona.html#review5651522", "text": "During my first trip to the American Southwest I was introduced to Zocalo's by a local friend. I loved the rich style of the Mexican Colonial furniture and found Zocalo's to be an excellent source of  fine antique furniture, talavera, and fixtures. I highly reccomend it as a place to stop and browse a fine collection of furniture and art, and to learn something of the vibrant history of 'the Old Pueblo' from their friendly staff.\n", "helpful_votes": "9", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2006-08-20T20:00:00-0400", "location_id": "550255", "id": "5651522", "user": {"username": "scotland10", "user_location": {"name": "Edinburgh, Scotland", "id": null}}}]}