{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2015-05", "title": "Shops, Food and Services on a Busy Street", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d6732703-r269827893-m11068-Historic_Sunshine_Mile_Shopping_District-Tucson_Arizona.html#review269827893", "text": "This 2-mile stretch of Broadway Boulevard between Euclid and Country Club offers a variety of locally owned shops, businesses and restaurants. For tourists who expect to be in the area, consider checking on-line to determine if there are places here of interest to you. Some of the shops, such as Picante, offer items that may be suitable as gifts to bring home. Residents can find everything from auto repairs to a podiatrist.\n\nThe three local eateries along the strip are Laverna's Coffee Shop & Cafe, just off Broadway on Plumer; Tucson Tamale Company; and Rocco's Little Chicago Pizzeria. \n\nI do not recommend that visitors park their vehicles and walk along the busy boulevard. There is nothing special along the way, such as a garden or a park, to see.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-05-03T21:34:46-0400", "location_id": "6732703", "id": "269827893", "user": {"username": "Rumples", "user_location": {"name": "Tucson, Arizona", "id": "60950"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Shop Tell You Drop in Locally Owned Stores", "url": "https://www.tripadvisor.com/ShowUserReviews-g60950-d6732703-r210049623-m11068-Historic_Sunshine_Mile_Shopping_District-Tucson_Arizona.html#review210049623", "text": "I loved shopping in this area. It was a great area to find unique interesting gifts. One of my favorite stores had lots of neon and lights in the window, plus lots of other fun stuff. I picked up a brochure that directed me to other stores in the area. Also shopped at a cute Mexican folk art store and a store with an eclectic mix of heirlooms. On further down, there was a poster shop, shoe store, outdoor garden decor and toys. This area has a great mix of stores to shop in and find souvenirs to take home, plus I love the Mid-Century architecture in the area. Looks like some interesting restaurants, too.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Family", "published_date": "2014-06-12T11:04:24-0400", "location_id": "6732703", "id": "210049623", "user": {"username": "monica h", "user_location": {"name": "Tucson, Arizona", "id": "60950"}}}]}