{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2015-02", "title": "A step back in time", "url": "https://www.tripadvisor.com/ShowUserReviews-g33198-d493753-r253869362-m11068-McCharles_House_Restaurant_Gardens-Tustin_California.html#review253869362", "text": "Most tea rooms cannot compete with the truly elegant environment of The Mc Charles House.  I have been a client from 20+ years past and the new fixed menu provide just as much quality and uniqueness as it had before.  The Mc Charles is really about giving yourself a treat as much for the stomach as for the eyes.\n\nThis gem of a tea-room is about relaxing, sipping freshly brewed tea, gazing at the flowers, sharing thoughts with friends AND enjoying a classic and elegant meal.  After enjoying tea with my lovely mother and little girls amid the cabbage roses and ginger punch,  I would have been happy with a simple scone and some tea sandwiches. Yet, I was delighted when I was offered plenty of wine-doused chicken, wild rice with bits of dried fruits and fresh heirloom tomatoes in a fabulous vinaigrette.  To finish, I indulged in toffee laced scones, bread pudding and all of the chocolate trifle that my heart desired.  \n\nI have always found the McCharles as one of the most delightMost tea rooms cannot compete with the truly elegant environment of The Mc Charles House.  I have been a client from 20+ years past and the new fixed menu provide just as much quality and uniqueness as it had before.  I read other reviews and if you are looking for a money-value for a meal, you've come in with the disposition of a frustrated coupon-clipper.  While saving one's money is a savvy practice,  the Mc Charles is really about giving yourself a treat as much for the stomach as for the eyes.\n\nThis gem of a tea-room is about relaxing, sipping freshly brewed tea, gazing at the flowers, sharing thoughts with friends AND enjoying a classic and elegant meal.  After enjoying tea with my lovely mother and little girls amid the cabbage roses and ginger punch,  I would have been happy with a simple scone and a little savory delight.  Gorging was for my eyes, not my stomach.  Yet, I was delighted when I was offered plenty of wine-doused chicken, wild rice with bits of dried fruits and fresh heirloom tomatoes in a fabulous vinaigrette.  To finish, I indulged in toffee laced scones, bread pudding and all of the chocolate trifle that my heart desired.  \n\nI have always found the Mc Charles as one of the most delightful tea rooms that share a special place equal or greater to many I have enjoyed in England.  .", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Atmosphere", "name": "rate_atmosphere", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-02-12T11:09:49-0500", "location_id": "493753", "id": "253869362", "user": {"username": "Sandy N", "user_location": {"name": "Tustin, California", "id": "33198"}}}]}