{"paging": {"total_results": "13", "skipped": "0", "previous": null, "results": "13", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Astonish about this collection", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r415015265-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review415015265", "text": "Very unique collection of rare books, like out of print, rare, collectibles and many historical local and from the Bay ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2016-09-05T09:27:56-0400", "location_id": "1545069", "id": "415015265", "user": {"username": "jaguarcancun", "user_location": {"name": "Vallejo, California", "id": "33212"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "A History of the Printing Arts", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r379222961-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review379222961", "text": "This is a surprising collection for a town this size.  There is a great collection of binding tools which are not usually seen unless you ask.  A few are in a display case but many more are hidden away in drawers and cabinets.  If you get a chance for a full tour you will be shown works by many of the world's greatest printers from the 15th to the 20th century.  This includes Gutenberg, Caxton, Gruninger, Bodoni, William Morris, Bruce Rogers and the like.  There are also printing equipment like an Albion Press and a Linotype machine.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-02T20:13:28-0400", "location_id": "1545069", "id": "379222961", "user": {"username": "travelkfiVallejo", "user_location": {"name": "vallejo, ca", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "World class collection of rare books and printing.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r367802069-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review367802069", "text": "As a new resident of Vallejo I was floored when I stumbled on this amazing collection of  letter press books in the basement of the JFK library downtown. The space is kind of funky, but the walls are lined with beautiful books, many of them extremely rare, some unique. All were left to the City of Vallejo by an avid and remarkable collector. This is a real treasure for people interest in books, printing, history and art. The volunteers who staff this are bursting with pride and eager for people to view and use the collection. Hours are limited: only open the 1st and 3rd Tuesday afternoons and for the 2nd Friday evening Artwalk each month .", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Business", "published_date": "2016-04-26T06:28:42-0400", "location_id": "1545069", "id": "367802069", "user": {"username": "camdonsf", "user_location": {"name": "Vallejo, California", "id": "33212"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-11", "title": "Rare books and documents available for viewing .", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r331899855-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review331899855", "text": "Visiting the McCune Collection is like stepping into a library on an English estate. Many wonderful and unusual books are available for viewing. Programs are offered 4 times a year featuring guest speakers telling about history of places around Vallejo.An old printing press is on display .Some rare prints are on display .The room is bright and well lit so it is easy to see what is featured. For book lovers it is a treat. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-12-10T16:02:56-0500", "location_id": "1545069", "id": "331899855", "user": {"username": "JoAnne C", "user_location": {"name": "Vallejo, California, United States", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Great time travel!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r288963836-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review288963836", "text": "One of the volunteers who works at the site was so kind to show me old books from the 19th century(and before) and showed fabulous(much more modern) prints of artists, mysterious photos and plenty of pop-up books. It was a delight to ponder through the place and made me want to go back when I might have a lot more time to spend. The collections are part of the artwalk that is the 2nd Friday of the month, and a place where great puppets have preformed!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-07-14T13:09:11-0400", "location_id": "1545069", "id": "288963836", "user": {"username": "mareye2015", "user_location": {"name": "Fort Collins, Colorado", "id": "33423"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-06", "title": "McCune Collection--A Hidden Gem!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r288622792-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review288622792", "text": "For book lovers, art enthusiasts, people on a cheap budget, or anyone searching for something unusual to do while on vacation in the bay area, I definitely recommend visiting this well-hidden gem called the McCune Collection. The non-profit houses an assembly of rare books, antiquated printing presses, various prints, illustrations, maps, pop-up books, and so on. The Donovan J. McCune Room, located on the basement floor of the JFK Library in Vallejo, California, is operated by a small group of passionate, knowledgeable volunteers. Don’t worry if you’re not university-educated or don’t know a thing about print-making; you don’t need to have prior knowledge of this type of thing before coming to visit. The volunteers will expertly guide you through the materials, answering questions that you may not even know to ask, in a straight-forward, easy-to-follow manner. The most refreshing part about the McCune Collection is that the volunteers openly encourage visitors to engage with the collection by allowing visitors to hold, handle, and page through books that are over five hundred years old. The McCune’s casual, welcoming environment is perfect for all types of learners, including those who prefer to learn hands-on and one-on-one.\n\nThis was recently my third visit to the collection in the last few years, and I’m always astonished by the extensive breadth of materials to view, touch, and explore. Although the venue may seem small and humble from the outside, I recommend allowing at least a couple of hours to peruse the wealth of curiosities that you will discover—most likely, in just an hour or two you will only be able to scratch the surface of taking it all in. \n\nSome of my favorite selections in the vault include a copy of The Consolation of Philosophy from 1491, originally written by Boethius in the sixth century. Ask the volunteers to share the story of Boethius who composed this book while in prison; his text reflects upon the transient nature of fame and wealth, suggesting that all we can ever have are the values we hold within us. The McCune Collection, additionally, contains an elegant William Morris rendition of Chaucer, created in 1896, with stunning and intricate illustrations by Edward Burn Jones. It’s fun to compare this version to older, more modest versions from previous centuries, which they will also show you. Also, request to see an example of fore-edging while you’re there. The volunteers will show you a tiny scene painted on the gold-paged-edges of a small palm-sized Latin book. The paintings are invisible when the book is closed, but flip the edges up or tilt them down and the cityscapes of London and Paris will reveal themselves to you! For something varied from the book scene, remember to ask to see the linoleum-block, botanical prints of Henry Evans. \n\nThe best way to see the collection is to request a private tour, as the collection is only available for walk-in-access a few times a month, but is always available to see by appointment. Call to schedule a visit in advance at 707-674-4082 or just email them at mccunecollection@gmail.com to set-up a time to come by. For those who live nearby, the collection is open the first and third Tuesday of each month, from 2 to 4pm, and also in the evenings for Second Friday Art Walk in downtown Vallejo. It is always free to visit!", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-07-13T11:57:46-0400", "location_id": "1545069", "id": "288622792", "user": {"username": "LaRagazzaPigra", "user_location": {"name": "Fort Collins, Colorado", "id": "33423"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-06", "title": "Wisdom of the Ages", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r286165900-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review286165900", "text": "The McCune Kelmscott Chaucer paper/puppet show was a delight. It brought a classic publication to us in an extremely entertaining way. Kudos to their creativity.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-07-06T12:37:25-0400", "location_id": "1545069", "id": "286165900", "user": {"username": "Linda L", "user_location": {"name": "Vallejo, California", "id": "33212"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "Great place for printing and rare books enthusiasts to visit", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r285391486-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review285391486", "text": "Features a working 1870 Albion Press and linotype machine, as well as a wonderful collection of rare and unusual materials, including a comprehensive collection of Henry Evans prints, a page from the Gutenberg Bible and an original edition of the Kelmscott Chaucer; has been called one of the finest rare book collections anywhere.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-07-03T14:22:17-0400", "location_id": "1545069", "id": "285391486", "user": {"username": "julie29942", "user_location": {"name": "Vallejo, California", "id": "33212"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-06", "title": "Art Walk Fridays and Pop-up Books", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r284795564-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review284795564", "text": "The McCune Collections has been added to Vallejo Friday Night Art Walk (second Friday of the month) and appears to be the starting point from the western side of Vallejo.  The artists set up in the foyer of the collection. Thus far there has been Ben Brookshire's recycled book art in April and Jean Cherie's sculptures in May and her life journey in June with others added every month.     While the art is exhibited, the collection of books is also open for exploration.  I was able to see a collection of over 100 pop-up books that were just recently added.  A lot of work goes into making spectacular pop-up books.   The nights I have been there the parking was easy, the admittance free, and refreshments were served.   Thus far it has never been crowded so I had time to look around.  After that I walked down Georgia Street to look at the other art displays.  A handy map of the art walk can be found at http://www.vallejoartwalk.com/vallejoartwalk/map.html .  It appears that over 35 businesses are involved in this art walk.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-07-01T11:02:47-0400", "location_id": "1545069", "id": "284795564", "user": {"username": "travelkfi", "user_location": {"name": "vallejo, ca", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-06", "title": "Hidden Gem In Downtown Vallejo", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r278960765-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review278960765", "text": "The McCune Rare Book and Art Collection is a little known hidden gem right in the middle of downtown Vallejo.  The collection has rare manuscripts, vintage printing presses and performance art right at the John F Kennedy library.\n\nThey are now open for second Friday Art Walks so if you haven't been, don't miss this extraordinary gift to the City of Vallejo.", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Couples", "published_date": "2015-06-09T04:55:37-0400", "location_id": "1545069", "id": "278960765", "user": {"username": "BStreetTraveler", "user_location": {"name": "Vallejo, California", "id": "33212"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-05", "title": "McCune Rare Books", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r272834467-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review272834467", "text": "The McCune Rare Book and Art Collection is located in the same building as the John F Kennedy Library, 505 Santa Clara St, Vallejo, CA 94590 but it is on the bottom level near the back parking lot. It is nonprofit and staffed by volunteers.\n\nThis is a wonderful place if you are interested in old books or printing. The admission is free. It starts with a leaf from the first book made with moveable type - the Gutenberg Bible (1450). They have 6 more books printed before 1500. These are called incunabula.  The great thing is that you don't have to just view these items behind glass cases. They will bring them out and let you sit at a table if you are interested in reading or just viewing them. One book I looked at for a long time was a 1517 edition of Virgil's Aeneid. It had page after page of illustrations of Aeneas journey from Troy to Italy, including a journey into the underworld.\n\nAnother great book is the Kelmscott Chaucer. This was printed in 1896 by William Morris with 72 illustrations by Edward Burne-Jones, major pre-raphelite painter. It is a large book like the large bible you see in a church.  At the end of the May and the beginning of June, the Magical Moonshine Theatre has scheduled puppet shows at the McCune using some of the illustrations from this Kelmscott Chaucer.\n\nThere is also a working 1852 Albion Printing Press and other printing presses there.  It has a large collection of binding tools.\n\nThere are too many rare books to list or see in one visit. A good place to start is their website: http://www.mccunecollection.org where they list many of the items in the collection. It is easy to make free reservations to see the collection on days or hours when they normally wouldn't be open. Just email them (mccunecollection@gmail.com) letting know your interest and possible days and times and they will work to get you in.\n\nThis sight is near the Vallejo ferry terminal and also a few blocks from the Vallejo Naval and Historical Museum at 734 Marin. Website: http://www.vallejomuseum.org/. This is another great place to learn about the early history of Vallejo and the Mare Island Ship yard. They have a working periscope and many other exhibits.", "helpful_votes": "5", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-05-18T12:36:09-0400", "location_id": "1545069", "id": "272834467", "user": {"username": "travelkfiVallejo", "user_location": {"name": "vallejo, ca", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-03", "title": "McCune Collection and Mare Island", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r272233331-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review272233331", "text": "I took the ferry over from San Francisco.  This is only a short walk from the ferry terminal. This museum is right by the library and its free to visit but not often open. First thing that hits your sight is an enormous linotype machine that was used for newspaper printing.  This had a furnace on the machine which would melt lead ingots to make reusable type to set up the words and then could be melted down for the next edition.  What ingenuity and time saver!  Then there are books on all the shelves of the room showing different printers.  I went to a  Sunday lecture they had on how books and magazines are reused by one fellow to make collages.  They had some coffee and refreshments out for the visitors.\n\nThere are other interesting historic buildings in downtown Vallejo and a friend took me over to see Mare Island.  There are the historic drydocks (very large), the cemetery where Francis Scott Keyes' daughter is buried , and St. Peter's Chapel with Tiffany windows.  Alden park with its bandstand, surrounded by torpedo, rocket, mines and other artifacts, is a good place to rest. There is also the old officer housing still being used for tours and some of the buildings being converted for contemporary business.  There is a warehouse which houses the Mare Island Museum and has many exhibits.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2015-05-15T14:31:41-0400", "location_id": "1545069", "id": "272233331", "user": {"username": "john b", "user_location": {"name": "San Francisco, California", "id": "60713"}}}, {"lang": "en", "rating": 5, "travel_date": null, "title": "History of Printing and Books", "url": "https://www.tripadvisor.com/ShowUserReviews-g33212-d1545069-r56179820-m11068-McCune_Rare_Book_and_Art_Collection-Vallejo_California.html#review56179820", "text": "This is a great collection of rare books with some art prints.  It contains a history of printing starting with Gutenberg, continuing with many of the early printers of the 15th-16th Centuries.  It contains a large collection of 18th century Latin books printed by the famous Barbou printers in Paris.  Highlights of the collection are the incunabula (books printed before 1501), Kelmscott Press books (including the world famous Kelmscott Chaucer), a number of wolrd famous bibles, including a Baskerville Bible and Doves Bible.  There is also a superb collection of Nonesuch Press, Grabhorn Press and a complete set of the Book Club of California.  Art prints include those by Henry Evans of his botanical works.", "helpful_votes": "11", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2010-02-16T12:54:51-0500", "location_id": "1545069", "id": "56179820", "user": {"username": "oldbookcollector", "user_location": {"name": "san francisco", "id": null}}}]}