{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2016-11", "title": "Loved it, BUT...", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r434823976-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review434823976", "text": "Stayed afew days at the Blue Marlin, loved it but, No wifi. The toom was great, roomy, clean and comfortable. Very quiet there. Lots of restaurants near by and 1 block from the boardwalk and ocean. It would have a perfect visit, but no wifi. The manager / owner, tried to help , but it just did not happen. The staff is great, very helpful.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Business", "published_date": "2016-11-05T08:05:40-0400", "location_id": "484796", "id": "434823976", "user": {"username": "Mike M", "user_location": {"name": "Norfolk, Virginia", "id": "58026"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-10", "title": "It was fine", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r426413697-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review426413697", "text": "The place was built in the 60's,  it is older. We just wanted somewhere to sleep and shower, it fit the bill. Don't expect a 5 star. People at the office area were nice and helpful. Our towels and beds were clean. Any time we asked for fresh we got it.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-10-09T09:49:30-0400", "location_id": "484796", "id": "426413697", "user": {"username": "regina b", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "gross", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r417536442-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review417536442", "text": "This place is dirty. And the people in charge are arrogant. It smelled musty and the rooms aren't carpeted. They charged my credit card without me signing for a parking pass. Not a good place to stay.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-12T09:42:48-0400", "location_id": "484796", "id": "417536442", "user": {"username": "anitabaker66", "user_location": {"name": "Roaring Spring, Pennsylvania", "id": "53558"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Loved our stay ", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r399230260-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review399230260", "text": "We just came from a 5 night stay and we have to say for the money it was very nice .....it was clean close to beach staff was great ...The hotel was quiet had a ocean view close to everything ...They staff very friendly we enjoyed our stay and will return again ....Thanks ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-30T09:26:05-0400", "location_id": "484796", "id": "399230260", "user": {"username": "Sherry B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "No more !", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r397875179-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review397875179", "text": "Very dissapointing, not what i expected, one of the bed was missing the boxspring !!!!,\nBathroom and  the towels  dirty. Pool small . The only thing good about this motel is it's\nvery close to the beach.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-27T04:33:47-0400", "location_id": "484796", "id": "397875179", "user": {"username": "Americagreat2016", "user_location": {"name": "Gatineau, Canada", "id": "182166"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-07", "title": "Horrible motel, dirty and disgusting", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r393103594-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review393103594", "text": "I would give this place no stars if I could because this motel was horrible. It says suites and inn on the website but it's just a motel. Our room was dirty, our outlet by the bed was broken, found a dead bugs behind the bed and the floor looked like it never got swept. The bathroom was just disgustingly dirty, looked liked dried blood was on the wall and the tub had black marks in it and hair. The entire room was dirty. My second night there some drunk guy just fell asleep in front of our room.The phone in the room was disconnected. The cleaning staff was friendly but didn't seem to know what they were doing. The parking lot is super small and the stair and elevator are filthy. If you just want a place to stay for night and there's absolutely no where to go then I'd say stay here but this motel was horrible. I felt like I need to bleach myself from even being in that room. Will definitely not be staying here ever again and strongly recommend others not to even waste their time and money.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-07-16T00:04:56-0400", "location_id": "484796", "id": "393103594", "user": {"username": "Kanika G", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-07", "title": "Not what we expected", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r391379104-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review391379104", "text": "We booked this hotel because in the travel guide it said that there was a kitchenette and it had the cookware and utensils that we would need.  When we got there, we did not find any of those items. When we asked about them we were told that they do not do that anymore. This is false advertisement!! We did not expect to have to go and buy stuff we could have brought from home, had we known.\nThere were no coffee makers in the room either and they did not provide a continental breakfast as advertised. \nThe room was dirty, we wore socks and the bottom of our white socks were black!!\nThe refrigerator was dirty, as was the store. \nThe pool area was also dirty. Globs of hair on the concrete.  Slim near the walls and none of the chairs had been cleaned.  The Parking was horrible too.\nI would not stay there again. I will not recommend it to anyone.\nI will say the staff was nice.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-11T07:14:54-0400", "location_id": "484796", "id": "391379104", "user": {"username": "dmason2016", "user_location": {"name": "Canaan, New Hampshire", "id": "46035"}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Horrible!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r390741542-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review390741542", "text": "Do not book here! Not worth the money!! There is too much to say so I will try to keep it short. My experience here was not good. You are hit in the face with a strong curry spicy smell when you walk in the tiny lobby/office. It took the man about 25 minutes or so to check me in. He said I'll be with you in a minute so I sat down, he was doing something, the phone rang, he proceeded to book the person on the phone, also checking his cell phone, instead of just getting me checked in quickly so I could just get my key and go to my room. I was not impressed when I checked in on Thursday afternoon...  I felt it was so so, the building is run down, a bit rusty, only ice machine was down on first floor across the parking lot from where we were staying, inconvenient, the pool is tiny, very thin blankets, more like a curtain if you stay here bring a blanket! Not much parking, there is a one car per room limit, more than one car you have to pay $20! I saw the shower rod just hanging the day we checked in and I thought wow, that looks kind of rigged and crappy, but my big issue wasn't until the next morning when I took a shower and water was going everywhere because the curtain kept falling and wouldn't stay put. I originally booked this in like May, just for Thursday and Friday night and last minute while there on Tuesday at a different non beach front hotel decided to book Saturday night to. After taxes I paid $274.59! For one night! After dealing with the shower and other things I decided that this run down motel was not worth that!! I went down to the front desk, the not so friendly man just offered me another room or said someone could come in and fix it. We had unpacked, I did not want to be shuffled to another room nor did I want someone in there doing work that should have been done correctly before anyone even walked in the room! This was early Friday morning mind you, all I wanted to do was stay Friday night and cancel Saturday and get my money back. They still would have got over $300 of my money just for 2 nights! The man told me that there is a 72 hour cancellation policy for summer hours even though it says 24 hours on their website. I booked on hotels.com, I had 46 hours according to the time it said I could cancel by (which was 6p.m. Thursday and if I had taken a shower immediately upon checking in around 4:30 I would have cancelled the room through hotels.com!!!). All I wanted was to not stay Saturday. After dealing with the rude man and him telling me the only way I was going to get a refund for Saturday night was to leave the premises right then and I couldn't stay Friday as a penalty and I would lose out on over $200. Why should I be penalized for your run down hotel! It should have been properly installed from the get go. Not just rigged, left to dangle and get water everywhere! Have some pride in your establishment! We took the loss, told him we would just stay. We left so  the \"maintnence man\" could come and in fix it. He did absolutely nothing to clean up the mess, left screw shavings, and plastic pieces in the tub, absolutely unprofessional! No one followed up with us or checked in us at all or said anything after the incident! I have been in the customer service industry for over 10 years! This experience was terrible. After the $20 surprise parking fee for one night this cost me around $670 for three nights! I was waiting for my friend to bring the car around and the \"maintenance man\" was cussing and complaining to a cleaning lady about guests, so unprofessional. This place needs to be torn down and rebuilt by someone who cares. The only thing good about this place and I say this lightly, is the location. So if you really do not care about staying in a run down rust bucket then there is a Wal-Greens right in front of you, 7/11 right behind, a few good restaurants a street over and a couple of bars right there close. But honestly that's not worth it, please spend another $40 or $50 and stay somewhere else. Oceans 2700 is right by this one and idk about the inside but the outside looked much nicer than this one and I wished I had booked with them because they have the same rating and close prices and I was on the fence. But oh well, I'm glad I do not have to ever stay at this awful place again! I never write reviews, I could care less, but after some of my experiences at V.A. Beach I felt compelled to make an account so people do not have some of the same bad experiences I encountered while trying to enjoy my vacation. So much for short and sweet. Not trying to sabotage this place but it's the truth, and it was very unprofessional and unfriendly and I was trying to be nice about it at first even though I did absolutely nothing wrong.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-09T09:06:40-0400", "location_id": "484796", "id": "390741542", "user": {"username": "notsoworldtraveled", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "Perfect Vacation", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r389031306-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review389031306", "text": "When we originally got here, our room was wrong but that was because we booked it wrong. The people at the front desk were very understanding and got us the room we needed! Very kind staff and very nice location. Will be back again!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-07-04T06:00:47-0400", "location_id": "484796", "id": "389031306", "user": {"username": "EllioI", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "They dont care about there customer just the money", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r387808191-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review387808191", "text": "June 24-25 was my stay and it could had been a pleasure but you have management that really don't care.  they do just enough to keep business operating and they really don't care about there guest.  Things I noticed: They change sheets only the do not clean the room each day.  They use the same bucket of water to clean all floors. they leave the door open when cleaning your room and walk away. The most disgusting thing is the laundry room is a dirty shack outside in the parking lot.  Dirty laundry sheets are in open container piled up to be washed out side. walking by to see this will make you sick.  Towels, sheets wash cloth are exposed to the outside and you can see a person doing the laundry.  the sheet and towels are stored in something like an out house.   they have this male guys that looks like he is on drugs walking around doing nothing. The stair wells never was swept. shoes on the steps for two days never moved.  the steps are beyond dirty along with the elevator.  when you walk out you room you feel like you are in third world country.  I spoke to the manager and I told him the rooms are not cleaned daily along with the steps and the elevator.  The elevator is disgusting and I told the manager why don't you care.  the little things mean a lot to your customers and you don't care.  Like the elevator change the tile and clean the elevator make it look presentable.  Stains on the floor like they been there for years.  They just need to clean better, power wash them damn steps.\nHow you clean the laundry it need to be more private and in a better area.  the laundry room full of bugs and gross. they are sitting on a gold mine.  the location is perfect.\nThey don't really care and its a big health risk.  I'm searching now how to report them to the health board.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-06-30T07:26:18-0400", "location_id": "484796", "id": "387808191", "user": {"username": "924elkridge", "user_location": {"name": "Philadelphia, Pennsylvania", "id": "60795"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-06", "title": "Best little getaway ", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r385257293-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review385257293", "text": "This is our yearly family vacation spot.Room 110 for my austic son. Anew and his family are very friendly and accommodating with our sons special needs. Gary is the best staff member when you need anything thanks for the awesome care Gary. See ya'll next year!!! ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manan S, General Manager at Blue Marlin Motel, responded to this review", "text": "Thank you for compliments, we look forward to seeing you again soon", "title": "Owner Response", "published_date": "2016-06-24T08:47:48-0400", "id": "385574045"}, "trip_type": "Family", "published_date": "2016-06-23T06:38:30-0400", "location_id": "484796", "id": "385257293", "user": {"username": "Alicia C", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Worse motel I've ever stayed in", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r385083089-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review385083089", "text": "Now this is the first time pictures from a spot hasn't matched up to what I saw once there. First of all we checked in and there was an overwhelming smell of curry in the office. Once there my husband checked in with his current U.S. military ID since it just asked for a government issued ID. We were told they needed his drivers license instead. We handed the ID to the woman and she returned it by placing it on the counter. We went into the elevator and it smelled like urine. There were also cigarette butts on the elevator. We got to the room and all you could hear were the people upstairs above walking back and forth. With no carpet there is no buffer so you hear everything. The door to the cabinet that held the mini fridge was broken severely. Also the handle to the clothes drawer was broken as well. Moving into the bathroom I took a shower and was not able to close the shower curtain. The rod was not put up correctly and the curtain slumped to the middle of the rod. When taking a shower there was no way to ensure water would not get on the floor. There was always a puddle. Also the inside of the bathroom door looked like a dog or something tried chewing through it. The second day we stayed (only because after 15 minutest free checking in you are not able to get a refund) when we got back from the beach the beds were still unmade but luckily new towels and wash clothes had been put in the room. Noise from the upstairs neighbors until midnight all three nights at the motel made for cranky mornings. \n\nOn the bright side it's literally right across the street from the beach and there is ample parking. \n\nStay away from this motel if at all possible. We will NEVER stay here again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-22T16:02:22-0400", "location_id": "484796", "id": "385083089", "user": {"username": "Somer H", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Awesome value!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r384889255-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review384889255", "text": "We did not have a reservation- just pulled in. We were able to get a bottom floor room with a kitchenette for $104 a night. We were able to park right in front of our room. It had a full sized refrigerator and the room was already cool! The A/C was very cold! It was extremely clean! The bathroom was small but clean. It was very close to the beach and shopping/restaurants. I would definitely recommend this motel!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-06-22T06:55:31-0400", "location_id": "484796", "id": "384889255", "user": {"username": "Penny S", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-06", "title": "Ehh.. You get what you pay for...", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r384651020-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review384651020", "text": "This is an alright place if you're just staying overnight, other than that, I wouldn't recommend. This is a fairly cheap place one block from the beach, so I understand why it's so popular. The front desk staff isn't very friendly. The rooms are all around dirty (I had to remove a massive clump of hair out of the bath tub drain just to plug it for my kids to take a bath). Our fridge didn't work. The pool was closed one of the days we were there for \"chemical testing\". This motel attracts young kids who are there to party and are disrespectful and rowdy at night. Two of the nights we were there, there were people right outside our room screaming and fighting until 4 am. The front desk never answered their phone either night, and when we went down to complain the next morning, both times they said \"there's nothing we can do about it\". \n\nOverall, I didn't complain too much because we paid $90 a night and were a block from the beach. But, this is definitely not a kid-friendly place and is somewhere I'd only recommend staying for a short trip.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-06-21T10:11:29-0400", "location_id": "484796", "id": "384651020", "user": {"username": "Kevin D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2016-05", "title": "Scary", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r377462476-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review377462476", "text": "We were afraid to even get out of the car when we pulled into the very tiny parking lot for guests. It is a hotel where people live rather than vacation. There were residents sitting outside their rooms and undesirables walking around the outside.  We didn't even go into the office and left the property immediately and found another place to stay.  There was a door to a room open so we could see inside, it looked nothing like the pics that are on the hotels web site. When I called, they refused a refund, stating that they charge for the room 72 hours prior to the reservation date. We lost out on the 115 that was spent on the room, but it was worth it not to be afraid during our stay. Strongly do not recommend you stay here.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2016-05-28T19:04:54-0400", "location_id": "484796", "id": "377462476", "user": {"username": "nichols96", "user_location": {"name": "Pennsylvania", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Clean with great service", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r369403970-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review369403970", "text": "We came in really late after a long drive from another state and the manager, Anup Patel was great about not charging us extra for having to change our dates very last minute and he also let us stay for more than an extra hour after checkout because he saw how tired we were after the trip. The room was clean, had free Wifi, and was overall very cozy.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-05-01T19:37:22-0400", "location_id": "484796", "id": "369403970", "user": {"username": "kgemora", "user_location": {"name": "Toronto, Canada", "id": "155019"}}}, {"lang": "en", "rating": 3, "travel_date": "2016-04", "title": "Perfectly Fine for the Rate", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r365520675-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review365520675", "text": "I don't have anything bad to say, other than the fact that they do not have enough parking spaces for all guests.  The hotel was recently updated and is fine for a motel.  The room was clean, bed was comfortable and everything worked.  I found the wire-threaded security glass on the room window a bit odd (storm-protection, perhaps?). Could use some fresh paint and a lower bathroom vanity height, but for $60 a night, I am not the slightest bit upset.  The innkeeper was very pleasant and both made eye contact and was warm both during checkin and checkout.\n\nFrankly, this is one of those 60s/70s motels that dot the Virginia Beach landscape--and it could be a really cool retro destination if only they would spend a little money on it, sandblast and repair a lot of concrete and paint.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2016-04-19T17:58:59-0400", "location_id": "484796", "id": "365520675", "user": {"username": "Izrunas", "user_location": {"name": "Richmond, Virginia", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-04", "title": "Inexpensive, updated and clean.", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r360724091-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review360724091", "text": "I love this hotel and if I ever stay in Virginia Beach again this is where I'll stay! The room was only around $40 online, and it had a kitchenette. It looked like it was recently updated and it was very clean. The beds were comfortable and the shower had plenty of warm water. The pool wasn't open and no breakfast, but it was still worth the price.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-04-01T12:11:43-0400", "location_id": "484796", "id": "360724091", "user": {"username": "Cali_Isis22", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2016-03", "title": "Good for rate, terrible customer service", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r356896754-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review356896754", "text": "It's what I expected for the rate but the sheets and towels were dirty and when we called for clean sheets and a towel we were treated with disrespect and rudely by the the manager. I am very easy going but this bothered me.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-03-19T16:55:34-0400", "location_id": "484796", "id": "356896754", "user": {"username": "Cindi M", "user_location": {"name": "Uniontown, Ohio", "id": "51065"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-06", "title": "Great night life!", "url": "https://www.tripadvisor.com/ShowUserReviews-g58277-d484796-r345603783-m11068-Blue_Marlin_Motel-Virginia_Beach_Virginia.html#review345603783", "text": "The room was more than enough for me and my fiance. Very clean and relaxing. We went out in the evening and had a great time walking the boardwalk. People were super nice and I never felt uncomfortable walking around that night.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2016-02-07T07:15:26-0500", "location_id": "484796", "id": "345603783", "user": {"username": "Chelsea S", "user_location": {"name": "Frankford, Delaware", "id": "34015"}}}]}