{"paging": {"total_results": "6", "skipped": "0", "previous": null, "results": "6", "next": null}, "data": [{"lang": "en", "rating": 2, "travel_date": "2016-03", "title": "Beautiful home, disappointing stay", "url": "https://www.tripadvisor.com/ShowUserReviews-g56833-d7688133-r356632753-m11068-The_Migel_House-Waco_Texas.html#review356632753", "text": "When I first picked this house to stay in, I wanted to get a bed and breakfast experience because my husband had never stayed in one. I was so excited because I love the old architecture. My first and most important complaint is that we specifically rented the ivy room because it was less expensive and had a queen bed. When we arrived I was very surprised to see a completely bare living area and no one else was going to be in the house with us. That was okay, I would have preferred to meet the owner or something a little more personal which is typical of a b&b. The staff was very polite and I have no complaints there... However when we got to our room... The queen bed was a full.. We have a 15 month old that sleeps with us on vacations and that was not about to happen. We had to upgrade to the Eugenia. For paying over $300 a night I was extremely disappointed in the false advertisement of a queen bed because I would have not spent that much if I had known the experience was going to be the way it was. When I go to a b&b I expect to meet the owners and feel at home, comfy living areas and quality throughout. The bedding was cheap and there aren't any personal touches throughout the home. It's a beautiful home, but I would never recommend for the price. ", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Family", "published_date": "2016-03-18T13:30:06-0400", "location_id": "7688133", "id": "356632753", "user": {"username": "Hailey R", "user_location": {"name": "Seattle, Washington", "id": "60878"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-03", "title": "Please read before you book", "url": "https://www.tripadvisor.com/ShowUserReviews-g56833-d7688133-r353976116-m11068-The_Migel_House-Waco_Texas.html#review353976116", "text": "First I need to say that The Migel House is an historic house that has been beautifully restored by its owners. It's a very special property, and the rooms are so lovely to stay in. What I wish I had known is the following (not necessarily bad, but not what I have previously experienced):\n- The owners don't live there. They have someone manage the house, but she doesn't stay there. This was a little weird for three of us ladies - especially when they told us to be sure to lock the outside doors as strangers have wandered in. Then again, if that doesn't bother you, it might be nice to have the house to yourself.\n- Continental breakfast is served on weekdays and hot breakfast is served on Sat & Sun. I did not see this on the website, but they said it was stated there.\n- The bedrooms are fully furnished, but the living areas aren't. There is a sitting room upstairs with a love seat and two chairs, but when all the rooms were occupied there really wasn't a place for everyone to hang out. I think the owners intend to find period pieces for the living areas, and that takes time, but as of right now it's just that one space upstairs.\n- The carriage house room is a separate building. it's lovely with its own kitchenette, but again for us three ladies, it was weird to be separated.\n- The bedrooms are all upstairs, so be prepared to carry your luggage. For most people that's not a problem, but again, it was us three ladies, and we had some heavy luggage!\nIf you are a couple staying on the weekend, I'm sure it will be amazing. For us three ladies it was not everything what we had hoped.\nThe owners have spared no expense in their restoration - including restoring hand-painted wall paper, and there even is a working bowling alley in the basement! The house was originally owned by department store owners, and it was so fun to imagine how they lived over a hundred years ago in this house.", "helpful_votes": "4", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-03-08T17:32:57-0500", "location_id": "7688133", "id": "353976116", "user": {"username": "Stacy S", "user_location": {"name": "San Diego, California", "id": "60750"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-07", "title": "What a terrific experience", "url": "https://www.tripadvisor.com/ShowUserReviews-g56833-d7688133-r300732135-m11068-The_Migel_House-Waco_Texas.html#review300732135", "text": "Absolutely worth every penny.  Amazing home with the grandeur of days gone by.  What a relaxing and enjoyable stay.  We were lucky enough to get a tour from the owner (thank you, Robert), what an amazing story of the property and all the love + blood,sweat & tears that went into the restoration.  Take some time to explore the home and its amazing details, you will not be disappointed.  There are so many beautiful details to look at.  I can go on forever about how amazing the house itself is, but there are few more things that vault this stay right over the top: Migel House boasts the first bowling alley in Waco - and it is all yours to play with! One evening after dinner we went to HEB for some wine and cheese and spent the evening down in the basement bowling and played around like little kids.  What a kick!  The next big winner are the balconies - the back balcony was fantastic for winding down in the evening and a delight with your coffee early in the morning.  The neighborhood is very quiet and peaceful, so a very relaxing experience.  If you dig a spa type of feeling, book the Louey suite.  We saw the bathroom in that suite and it was amazing.  Huge antique tub with a super fancy walk in shower with every bell and whistle you could want.  We stayed in IVY, great bed, big room, split bathroom inside the suite, a lovely accommodation for 2.  The kitchen is amazing, could have cooked ourselves a full on gourmet meal if we wanted to.  Breakfast was basic, but good nonetheless.  Kuerig and mini fridge upstairs for drinks along with a wet bar.  The home is located on the outskirts of downtown, easy drive to downtown, Cameron Park and Baylor (and totally walk-able if you are of that ilk as we were).  Really an enjoyable stay.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2015-08-18T09:47:14-0400", "location_id": "7688133", "id": "300732135", "user": {"username": "Danielle S", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-05", "title": "Amazing!", "url": "https://www.tripadvisor.com/ShowUserReviews-g56833-d7688133-r269680240-m11068-The_Migel_House-Waco_Texas.html#review269680240", "text": "We stayed here in May while we were in town for a sporting event. All the hotel's were booked so we bounced over to the B and B route. WE ARE SO GLAD WE DID!\n\nThe home it beautifully restored. All new and modern and exceptionally clean, yet you have the experience of old turn of the century Texas. Staying here was such a pleasure. This is our new home whenever we come to Waco. Lounging in the common areas and the balcony porches, surrounded by huge pecan trees, filled with song birds was such a delight. Ahh.....\n\nThanks to the warm and welcoming owners and staff. We really had a terrific time.\n\nRod and Suzanne \n\n", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2015-05-03T06:17:25-0400", "location_id": "7688133", "id": "269680240", "user": {"username": "papi3462", "user_location": {"name": "Dallas, Texas", "id": "55711"}}}, {"lang": "en", "rating": 5, "travel_date": "2014-12", "title": "The Migel House Offers a Night to Remember!", "url": "https://www.tripadvisor.com/ShowUserReviews-g56833-d7688133-r254537772-m11068-The_Migel_House-Waco_Texas.html#review254537772", "text": "This past December we were fortunate to discover the delightful Migel House. Rich in Waco history, the Migel House features beautifully crafted original woodwork and artistically designed stained glass, with large elegant sitting rooms, and a warm inviting kitchen area. Not only is the Migel House a visual treat, but the hospitality is most welcoming. We stayed in the charming Ivy Suite which had stunning views from abundant windows on two sides of the establishment. From the more formal dining and living areas to the carriage house, every inch of the Migel House provides a fascinating look back to a more elegant time. I highly recommend the Migel House.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-02-16T10:41:59-0500", "location_id": "7688133", "id": "254537772", "user": {"username": "Cathy J", "user_location": {"name": "Lubbock, Texas", "id": "56208"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-01", "title": "The Migel carriage house is incredible.", "url": "https://www.tripadvisor.com/ShowUserReviews-g56833-d7688133-r254379290-m11068-The_Migel_House-Waco_Texas.html#review254379290", "text": "The Migel carriage house was built in 1910 was incredible. I stayed there for two weeks in January 2015. The outside of the building is beautiful. The scenery is elegant, lush and very cozy. The inside is equally as beautiful as the outside with all the very best amenities you would expect from such a beautiful property. I would joyfully stay there again and again...", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Solo travel", "published_date": "2015-02-15T15:23:08-0500", "location_id": "7688133", "id": "254379290", "user": {"username": "Torrie C", "user_location": {"name": "Austin, Texas", "id": "30196"}}}]}