{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-10", "title": "Here is where supporting local business really makes a difference.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33235-d10721020-r432240089-m11068-Farm_Creek_Brewing_Company-Walnut_Creek_California.html#review432240089", "text": "Wonderful little start-up brewery with big dreams.  They seem to be doing it right, as they add new fresh offerings to their already substantial list of great beers and ales.  It is only a Taproom, but they have 'arrangements' with which you can order for food delivery, and you can always \"BYO\". The Taproom is now a Monday - Sunday afternoon and evening operation, but check their website or Facebook for changes.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-10-27T13:06:48-0400", "location_id": "10721020", "id": "432240089", "user": {"username": "CWillC", "user_location": {"name": "Walnut Creek, California", "id": "33235"}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Great Brewery in Walnut Creek", "url": "https://www.tripadvisor.com/ShowUserReviews-g33235-d10721020-r411824915-m11068-Farm_Creek_Brewing_Company-Walnut_Creek_California.html#review411824915", "text": "Ran into a Farm Creek tent at the Broadway Plaza Thursday night band while in town for business and weekend pleasure trip.    I was surprised and happy that the selection did not have an over hopped IPA or other over flavored something.   THANK YOU for brewing a good tasting beer with some flavor that is not overpowering (ie one can enjoy a few).     The lager was outstanding and I learned from a brief conversation  with the owner that they had just opened. So my wife and I checked the brewery out a few days later. \n\nBeer here is outstanding and the owner, wife, and staff very friendly.   They have a mug club that give you 20oz pours and if you go frequently...the math works out well.   This brewery is ground floor at this point but I see them doing very very well.   Only snacks are served there as far as food, but there are a number of restaurants close and they deliver in there - Pizza place especially.   \n\nChild friendly and I imagine dog friendly as well.   Great music (Allman Brothers when we walked in) and a farm type atmosphere inside.   Tables are somewhat limited but there are plans to grow that as this opens up more.   I highly recommend checking it out.   Beer wise (I tried 3)....the most surprising was the Amber Ale.  It is dark in color and flavor to me was near a porter.    Unique taste that got better as I drank more.   They also have a brew very close to Sweetwater 420.    I've home brewed since 1981 and been to many breweries....this one's beer among the best.   Sadly I live in SC so visiting this for me will be 1x a year if I am lucky!\n\nOne last PS - there were a number of Car repair/tire workers in there as they had just gotten off their shift.   While not always the case, these are typically the type of beer drinkers that will only drink a Bud or Bud Light.   These patrons were thoroughly enjoying the Lager and this tells me that Farm Creek can cater to craft beer nuts as well as the person that just wants a good tasting beer where the hops and other flavors don't knock you taste buds out   Well done!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": {"lang": "en", "author": ", Owner at Farm Creek Brewing Company, responded to this review", "text": "Thank you so much, Jim, for the great and thorough review! It was nice meeting you and your wife and talking with you both. Maybe we'll see you in the taproom sooner rather than later. Take care!\n\nRandy and Heather", "title": "Owner Response", "published_date": "2016-08-29T15:41:07-0400", "id": "412497064"}, "trip_type": "Couples", "published_date": "2016-08-28T06:50:07-0400", "location_id": "10721020", "id": "411824915", "user": {"username": "Jim C", "user_location": {"name": "Columbia, South Carolina", "id": "54184"}}}]}