{"paging": {"total_results": "20", "skipped": "0", "previous": null, "results": "20", "next": null}, "data": [{"lang": "en", "rating": 3, "travel_date": "2016-10", "title": "Not bad", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r432009604-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review432009604", "text": "We stayed here one night while doing business in Warren. The front desk clearly was friendly & helpful. The hater is a little dated but clean. The carpet is a little old & warn but not horrible. Our room was spacious with a large refrigerator and full kitchen. It's was like a mini apartment. It does not offer a hot breakfast which was a disappointment but I guess if your staying here for an extended stay you could stock your kitchen in your room and cook your own breakfast. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-10-26T20:19:20-0400", "location_id": "94416", "id": "432009604", "user": {"username": "JubileeJerry", "user_location": {"name": "Springfield, Ohio", "id": "51000"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-07", "title": "Great getaway", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r428994375-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review428994375", "text": "I absolutely love this Extended Stay because of the layout of each room.  They have a homey feel to them.  I love the way the are set up as suites with the kitchen kinda of having its own entity. It's conveniently located near food and shopping. There is a really nice laundry facility and exercise area.  The staff is the absolute BOMB!!! Very accomodating especially Kathy who has waited on me on numerous occasions. Always with a smile and very courteous. I would recommend this one all the time.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Your feedback is important. Thank you for sharing. It is great to see you enjoyed your \"getaway\" at our hotel. I am thrilled to read your comments about how amazing our staff was and your satisfaction with your room accommodations. Thank you again for your review.  We look forward to seeing you in the future, should your travels bring you back to our area.\n", "title": "Owner Response", "published_date": "2016-11-03T08:10:44-0400", "id": "434310918"}, "trip_type": "Solo travel", "published_date": "2016-10-17T19:40:36-0400", "location_id": "94416", "id": "428994375", "user": {"username": "Corliss P", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-08", "title": "Price, Room, And Staff Are The Best", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r420157069-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review420157069", "text": "Stayed a week in August, definitely wasn't a mistake! Staff attended to my needs, breakfast was great (and the coffee is like heaven), A kitchen for cooking, and so much more! Definitely coming back next year!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "It is so rewarding to see you had an excellent stay at our hotel. Your nice comments about our attentive staff and the fully equipped kitchen provided in your room is much appreciated. It is pleasing to know you found everything suitable. The staff and I would like to thank you again for posting your review.  We look forward to welcoming you back in the future!", "title": "Owner Response", "published_date": "2016-09-27T12:30:05-0400", "id": "422929139"}, "trip_type": "Family", "published_date": "2016-09-19T06:26:17-0400", "location_id": "94416", "id": "420157069", "user": {"username": "HeroTehAnimator", "user_location": {"name": "Matawan, New Jersey", "id": "46605"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Warren Civic Center suite hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r384241320-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review384241320", "text": "One of the best Extended Stay brand hotel locations.\n\nI usually cringe when Extended Stay comes up as our hotel selection from Hotwire or Priceline, but happily, this location exceeded most expectations.\n\nThe location of this hotel is great.  There are lots of nearby restaurants.  Some are even within walking distance.\n\nThe Warren Civic Center is about a block away.  City hall and the library are located there.  This ten year old building (the Civic Center) is an architectural centerpiece of this community (as was the nearby GM Tech Center in the 1950s).\n\nIf you are lucky enough to book an overnight stay on a Saturday night, be sure to visit the local farmer's market on Sunday morning (in front of the Civic Center).  \n\nOkay, turn on Google maps and look at the local neighborhood.  You will see just to the South is a Wal-mart.  Fill your room fridge cheaply if you want.  Look to the North.  Buddy's Pizza is on the corner of Old 13 mile Rd.  Buddy's is one of the Detroit metro area's best pizza places (check out the reviews...Buddy's is always in the top 10 Tripadvisor list for Warren restaurants).  National Coney Island is just across the parking lot to the West (a three minute walk), and they are also in TA's Warren top 10 restaurants list.\n\nThe room-suite at this Extended Stay hotel is better than most Extended Stay layouts.  The suite feels more like a hotel suite and a lot less like a cheapo college one room dorm apartment.  The kitchen (not kitchenette) has a lot more counter space and cabinets than most Extended Stays and it comes complete with a real stove, real oven, real dishwasher as well as the usual full size fridge and microwave oven.  If you need pots and pans, toaster, plates, silverware you will have to arrange with the front desk to have those items delivered to your room.\n\nThe bed was average... not too hard and not too soft.  It is certainly not plush like any 3 or 4 star hotel bed.  Expect a 2 star hotel quality bed.  \n\nAs with most Extended Stay hotels, this room (#218) did have some problems but most were minor.  The toilet didn't flush well.  We had to get a plunger from the front desk and do it ourselves because the maintenance staff had gone home for the day.  The faucet in the bathtub dripped constantly, but since we weren't paying the water bill I didn't care.  The ceiling above the TV area squeaked every time the person (or elephant) in the room above us got up to walk around.  The trim at the top of the refrigerator door was missing and a dangerous sharp edge was exposed.\n\nI would definitely recommend bidding low on Priceline or selecting a 2-1/2 star Hotwire, pet-friendly hotel with on-site laundry.  You will likely end up staying here.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you for taking the time to write a thorough review of your stay at our hotel. I am disappointed that there were maintenance issues in the room, but I am thrilled you had an excellent experience. Thank you again for your kind words.  The staff and I would love to provide you with another comfortable stay in the future.\n", "title": "Owner Response", "published_date": "2016-06-21T11:24:21-0400", "id": "384671721"}, "trip_type": "Couples", "published_date": "2016-06-20T04:50:22-0400", "location_id": "94416", "id": "384241320", "user": {"username": "flintjarvis", "user_location": {"name": "Flint, mi", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "You won't be disappointed with this Hotel.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r376045560-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review376045560", "text": "Stayed in middle of May 2016 and the Hotel had everything I needed. A large clean room, hot shower and a kitchen to prepare my food. There is really no breakfast but that didn't matter. Looks like the rooms had been recently upgraded. Fresh paint. Lots of pillows. Bed was comfortable. The free Wifi was sufficient for my needs, Hotel was not that busy and was quiet. Will definitely stay at this chain of hotel again.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you for your great review of our property.  I'm so pleased to hear that you enjoyed our recent renovations as well as our spacious accommodations.  It’s great to read that we were able to provide you with a home away from home experience!  The staff and I would like to thank you again for posting your review.  We look forward to welcoming you back in the future!", "title": "Owner Response", "published_date": "2016-05-25T10:11:56-0400", "id": "376490492"}, "trip_type": "Solo travel", "published_date": "2016-05-24T03:27:24-0400", "location_id": "94416", "id": "376045560", "user": {"username": "David D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2016-05", "title": "Great Price. Great room. Great staff.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r373313600-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review373313600", "text": "Booked room for 2 nights on a travel website and was worried when i saw some of the poor reviews. After checking into the hotel i am beginning to wonder if i can ever believe the reviews anymore. Check in was easy, front desk was friendly. Room was way beyond what i expected. This newly renovated hotel had huge rooms. A kitchen with full size stove, fridge and microwave. Flat screen tv. Big clean bathroom.Non-smoking hotel.  Free wifi and lots of parking. You will not be disappointed staying here.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "I appreciate you taking the time to write such a great review.  I'm so pleased to hear that we were able to exceed your expectations and provide you with a wonderful stay!  It’s great to read that you enjoyed our fully equipped kitchens, spacious rooms, and our friendly customer service.  The staff and I would like to thank you again for posting your review.  We look forward to welcoming you back in the future!", "title": "Owner Response", "published_date": "2016-05-23T08:04:01-0400", "id": "375818858"}, "trip_type": "Business", "published_date": "2016-05-16T03:44:20-0400", "location_id": "94416", "id": "373313600", "user": {"username": "laurmich96", "user_location": {"name": "Burlington, Canada", "id": "154984"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-12", "title": "Disgusting hotel STAY AWAY!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r337006760-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review337006760", "text": "This is the WORST hotel I've ever seen before in my lifetime! IF YOU'RE CONSIDERING THIS HOTEL, DON'T!!! I don't know where to begin except that this hotel is filthy, unsafe, and uninhabitable. The management interior photos are NOT the actual photos of this hotel. I made the mistake of booking this hotel for a family stay based on the reviews and photos. To my horror, after checking into our room, it was something out of a horror film... the hallways were dark, run-down, and dirty. The elevator lights were half out and looked like someone was murdered in the elevator. The room itself was absolutely disgusting - please see the photos I took. I wasn't able to take more photos because I almost threw up from how disturbingly disgusting the room was. I can't believe this hotel is open for business. False advertising anyone?? The walls were falling apart, the stove has never been cleaned with food and other unknown substances baked into the bottom of the stove and the burners, the sink and counter were being held up by one leaning piece of wood, the refrigerator had caked grime and mold, the carpet looked like someone rubbed feces everywhere, the towels in the bathroom were gray... I was in the room for about 90 seconds total and managed to snap a few photos before I left as fast as I could to talk to management about the room. To my dismay after telling the front desk person (who was very pleasant), their solution was to a) put us into another Extended Stay miles away, or b) possibly get someone to clean it in the morning. NO FRIGGIN WAY were we going to stay in that disgusting, unsafe hotel. I have yet to contact corporate directly regarding the experience. I can go on and on about how awful this hotel is. We ended up staying across the street at another hotel we stayed a previously who fortunately had a last-minute cancellation.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Your review for our hotel was recently brought to my attention.  The situation you described is unacceptable, and I sincerely apologize for your experience.  As this hotel’s manager, I can assure you that I have used your comments as a training tool to ensure we are thoroughly cleaning and inspecting rooms to our company’s high standards.  The staff and I appreciate your comments, as it will only help us to improve.  Please feel free to contact me directly, at war@extendedstay.com, with any additional comments or questions.  We do hope you will choose to stay with us again so we can have the opportunity to provide you with a better experience.", "title": "Owner Response", "published_date": "2016-01-11T06:59:16-0500", "id": "339172432"}, "trip_type": "Family", "published_date": "2016-01-03T10:25:21-0500", "location_id": "94416", "id": "337006760", "user": {"username": "Rumour13", "user_location": {"name": "Chicago, Illinois", "id": "35805"}}}, {"lang": "en", "rating": 4, "travel_date": "2015-07", "title": "Friendly and above average service! Rooms are minimally ok.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r315133780-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review315133780", "text": "The front desk is incredibly knowledgeable and helpful. The rooms are clean but just feel outdated or frequently fixed. The accommodations and atmosphere is comfortable and peaceful. I enjoyed the bedding and availability of outlets for my phone charger and iPad next to me unlike other hotels where outlets are scarce or inconvenient. The breakfast accommodations is in the front lobby which I personally do not like, however, it was available. Overall very well!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you so much for posting a review of our property.  Please accept our apologies that our hotel’s appearance was not to your satisfaction.  Still, I’m so pleased to read that you had a great stay at our hotel and enjoyed our friendly customer service.  Once more, thank you for posting your review.  We look forward to having you visit with us again in the future.", "title": "Owner Response", "published_date": "2015-10-13T11:24:56-0400", "id": "318344615"}, "trip_type": "Business", "published_date": "2015-09-30T10:43:16-0400", "location_id": "94416", "id": "315133780", "user": {"username": "Mark B", "user_location": {"name": "El Paso, Texas", "id": "60768"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-07", "title": "Decent", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r279325194-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review279325194", "text": "I was looking for a hotel for a couple weeks that had a stove and I chose here since it was nicely reviewed. I didn't have any big issues. Kitchen was pretty small but it did its job. Like I couldn't open fridge all the way with oven open or while I was standing at stove. It wasn't a big thing but I also found it odd the microwave wasn't lit inside while in use. Hard to see how food doing in there. It could've been a bit more updated though. Couch looked old and had old stains. It was the type of stain for long use and not something u can clean away anymore. Still it wasn't gross and I didn't see a bunch of new stains or dirt, so they doing ok with cleaning. They just need to upgrade on couch and carpet. It was cheap though so as long as their wasnt huge problems Im good. Last thing was those towels were super rough. Replace those too, or get better fabric softener haha. I would go back if need I needed cheap place with kitchen for over a week.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Your review for our hotel was recently brought to my attention.   Please know that we are sincerely sorry that your accommodations were not to your expectations.  Your comments were reviewed by the staff, and we will be working with our housekeeping staff to ensure that all of our couches and carpets are cleaned properly.  The staff and I appreciate your comments, as it will only help us to improve.  Please feel free to contact me directly, at dcarroll@extendedstay.com, with any additional comments or questions.  We do hope you will choose to stay with us again so we can have the opportunity to provide you with a better experience.", "title": "Owner Response", "published_date": "2015-07-01T06:31:12-0400", "id": "284716152"}, "trip_type": "Couples", "published_date": "2015-06-10T11:56:15-0400", "location_id": "94416", "id": "279325194", "user": {"username": "DoughRly", "user_location": {"name": "Detroit, Michigan", "id": "42139"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-02", "title": "I can't believe it!!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r254012207-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review254012207", "text": "So we booked this hotel a week ago and paid in full using Hotels.com so as we are leaving for our 3.5 hour drive this hotel calls us and says they can not accommodate us tonight. It's a little late to call don't you think. So here we are traveling on a snow storm with no hotel. Great! I even talked with the manager Pauly Legarde and he's like you just made the reservation and we were like no it's been a week and paid in full. He stated that's it wasn't so we called Hotels.com and complained. The booking agent tired for 40 minutes to contact Pauly Legarde the manger at Extended Stay. Finally the booking agent (buy the way was extremely FANTASTIC) offered to find us another hotel in area. Not only did she go out of her way to help us she contacted it to make sure there was a room for us. So my recommendation for Extended Stays of America is SHAME ON YOU.....😁 you don't get to be rude to your customers and then tell them there's nothing you can do.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-02-13T11:04:46-0500", "location_id": "94416", "id": "254012207", "user": {"username": "Anderia H", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2015-01", "title": "Really nice for the money", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r249649516-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review249649516", "text": "I've stayed at a number of Extended Stay Americas but I think this one might be the nicest yet, at least when everything is taken into account. I adored the room layout. The staff members I interacted with were all very nice and helpful. Was this my idea of an ideal get-a-way spot? No, not really, but it was a very nice room at a very reasonable rate. I hope to post some pictures of the room.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you so much for sharing your experience with us.  I truly appreciate your comments regarding the the layout of our hotel and the great service provided by our staff.  I will be sure to share your kind remarks with our team.  The staff and I would love to provide you with another comfortable stay in the future.", "title": "Owner Response", "published_date": "2015-01-27T09:37:50-0500", "id": "251305421"}, "trip_type": "Business", "published_date": "2015-01-16T17:28:48-0500", "location_id": "94416", "id": "249649516", "user": {"username": "dbergtkd", "user_location": {"name": "Plover, Wisconsin", "id": "60195"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-11", "title": "Good service. Fair price. You get what you pay for maybe more.", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r244977632-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review244977632", "text": "This was a great stay. It wasn't that clean but it was worth the price. They had a full kitchen with stove, fridge, and plenty of counter space. It was very spacious: there was a living room area. The continental breakfast was horrible but I didn't expect much to begin.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you for taking the time to write a review of your stay.  We appreciate the kind comments about your spacious and comfortable room; however, we apologize that you had some cleanliness issues and that our free grab-and-go breakfast did not meet you expectations.  As this hotel’s manager, I will review our cleanliness standards with my housekeeping staff to ensure that your experience is not repeated.  I will also be sharing your feedback on our grab-and-go breakfast with upper management.  The staff and I appreciate your comments, as it will only help us to improve.  Please feel free to contact me directly, at war@extendedstay.com, with any additional comments or questions.  It would be our pleasure to have you stay with us again in the future to show you our positive strides taken to enhance your experience with us.", "title": "Owner Response", "published_date": "2014-12-29T04:35:21-0500", "id": "246331001"}, "trip_type": null, "published_date": "2014-12-18T08:42:27-0500", "location_id": "94416", "id": "244977632", "user": {"username": "Leslie B", "user_location": {"name": "Taylor, Michigan", "id": "42747"}}}, {"lang": "en", "rating": 3, "travel_date": "2014-09", "title": "Value in Detroit Area", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r232286144-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review232286144", "text": "Pros:\n1.  Staff very helpful and accommodating.\n2.  Good price for large room with kitchenette- just ask front desk for cooking utensils.\n3.  Easy to get to-  only about 30 min from Henry Ford Museum/Greenfield Village.\n4.  Simple breakfast\nCons:\n1. Got in at 11pm. Lady yelling in parking lot that a group of young people were doing bad things in the parking lot that we could see close by of another hotel.  We saw big group of people milling about and didn't feel very safe.  Quickly had our group go into hotel.  - That said, it seemed like a nice area and this may have been an isolated event.\n2.  We requested non-smoking.  Room smelled of smoke.  The staff was apologetic and stated they would take care of it.\n3.  Mattress cover for hide-a-bed had some stains on it.\n\nWould I stay here again?\nYes.  The price was right and the staff was courteous and helpful.  I would request to see my room first to make sure there wasn't a smoke smell.\n", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2014-10-02T13:18:32-0400", "location_id": "94416", "id": "232286144", "user": {"username": "Thankful-Travelers4", "user_location": {"name": "Loma Linda, California", "id": "32642"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-09", "title": "My choice hotel to stay in !", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r226704402-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review226704402", "text": "The Extended Stay America Deluxe, Warren, Michigan is my choice for hotels. Ms Arev and her staff are top shelf. Always a pleasure staying here ! There is one bad thing. The WiFi is very slow. Aside from this all is good here.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "We want to thank you for taking the time to post a review of your stay.  We are so happy to know that you enjoyed your stay and our staff.   We sincerely apologize that you had issues with our free Wi-Fi during your stay, we will contact our internet provider to address the issue.  \r\n\r\nWe would like to thank you again for posting your review.  We look forward to welcoming you back in the future.", "title": "Owner Response", "published_date": "2014-09-17T13:04:35-0400", "id": "229490430"}, "trip_type": "Business", "published_date": "2014-09-03T11:09:27-0400", "location_id": "94416", "id": "226704402", "user": {"username": "Maurice D", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2014-07", "title": "Team Travel", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r226324994-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review226324994", "text": "This hotel was in a great location for our needs. Our rooms were clean and the beds were comfortable. It was great to have the kitchen too! The staff was super nice! There are many restaurants in the area. Overall it was fantastic. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "I want to thank you for taking the time to post a review of your stay.  I truly appreciate your comments regarding the cleanliness, comfort of our beds and convince of having a kitchen.  I am thrilled to read that my staff provided you with such friendly service.  Once more, thank you for posting your review.  We look forward to having you visit with us again in the future.", "title": "Owner Response", "published_date": "2014-09-08T12:04:14-0400", "id": "227763453"}, "trip_type": "Friends getaway", "published_date": "2014-09-02T07:21:23-0400", "location_id": "94416", "id": "226324994", "user": {"username": "number1baseballmom", "user_location": {"name": "Belle River", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-07", "title": "Enjoyed our stay, no problems", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r218818673-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review218818673", "text": "Me and my husband decided to stay 3 days here for our anniversary, we  made a good decision by picking this hotel first off Stella was amazing, we never had staff before remember our names (something small I know) but made us feel really good, she always checked on us, asking if everything was fine, having been to other hotels in the area this was the best one having a full size kitchen, the furniture was updated, my husband really enjoyed reclining in chair watching sports on the flat screen, also having our room on the first floor alot of the times you have a problem with loud noises, & a lot of traffic but it seem everyone was on mental timer lol everyone was settle around 10pm, also it was great not having housekeeping come knocking on your door, (you can request it if needed) but we were able to sleep in no problem we have alot of family always visiting from out of town I will definitely be sending them there best hotel yet. I cant wait to return.Hope this review helped happy travels, be on the lookout for Stella A+++, the whole staff is great also.", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you so much for posting a review of our property.  I am proud to read that you received such excellent service from our staff.  We are so pleased that you enjoyed your room and your fully-equipped kitchen.  Thank you again for sharing your experience with us.  We would love to see you again, should your travels bring you back to our area.", "title": "Owner Response", "published_date": "2014-08-05T06:35:50-0400", "id": "219707942"}, "trip_type": "Couples", "published_date": "2014-08-01T01:25:13-0400", "location_id": "94416", "id": "218818673", "user": {"username": "spoiledangel32", "user_location": {"name": "Detroit, Michigan", "id": "42139"}}}, {"lang": "en", "rating": 4, "travel_date": "2014-06", "title": "Like having an apartment away from home!", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r213342495-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review213342495", "text": "We stayed here last month for a week while visiting friends and family. Having stayed at this hotel in the past (and becoming unenchanted with the service & guests this hotel attracted), I was pleasantly surprised at how well they have improved. The new manager, Stella is far and above one of the nicest, most sincere people in the hotel industry that I have ever met. When I initially walked into the lobby upon check in, I was greeted by a young lady in the hallway who said \"Hi Christine\". When was the last time you went to check into a hotel and was called by your first name the minute you walked in? After we received our keys and came back downstairs to go get groceries, she asked how the room was? I had called the day before to confirm a deluxe room with 2 beds, and she reserved it specifically for us. She also advised us to let them know if we needed anything else during our stay. After our first night, we came downstairs to head out for the day and Stella asked how the night sleep was? Was it quiet enough, no noise after 10pm, no babies crying in the hallways? This hotel was surprisingly very quiet. It seems they have a no noise policy between 10pm - 8 am, which is greatly appreciated for those of us who wanted to sleep in a little. It also helps to alleviate extra noise since they don't have a housekeeper going from room to room knocking on doors like a traditional hotel. You can pay extra for daily housekeeping, but we like not having to worry about someone coming into our room every day. We were able to get extra sheets and towels form the front desk upon request. We felt right at home here and the room was large and comfy. The furniture was new and comfortable. Carpet was new & clean.It's really nice to have the full size kitchen. The kitchen is outdated, and I understand that they might not want to renovate it. It might be nice is they at least painted the outside of the cupboards or at minimal the inside shelves of cupboards and drawers. A fresh coat of paint would really refresh these areas because the insides of the cupboards and drawers were really kind of gross and dirty. We didn't use any utensils of dishes because of this. We bought paper plates and plastic utensils. The other suggestions that I would make is to tell the housekeeping staff to clean a little more diligently. The areas between bed/nightstand and the areas between dresser/wall had visible dirt and debris. These are areas that get overlooked in most  hotels, and they can really pay closer attention to these areas.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, General Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you for taking the time to write a review of your stay.  We are pleased to hear that Stella and the rest of our staff took such good care of you.  We are glad that you appreciated the updated room and the fully equipped kitchen; however, we are sorry to hear that the cabinets and drawers were not in satisfactory condition.  We will be working with our housekeeping and maintenance staff to ensure the rooms are cleaned thoroughly and that all aspects of our rooms are up to our standards.  \r\n\r\nWe appreciate your comments, as it will only help us to improve.  We invite you to contact us, at war2@extendedstay.com, if you have any additional comments.  Thank you again for your kind words.  We would love to provide you with another comfortable stay in the future.", "title": "Owner Response", "published_date": "2014-07-15T05:49:04-0400", "id": "215522058"}, "trip_type": "Friends getaway", "published_date": "2014-07-02T12:21:02-0400", "location_id": "94416", "id": "213342495", "user": {"username": "Sunloverch", "user_location": {"name": "Rancho Mirage, California", "id": "32942"}}}, {"lang": "en", "rating": 2, "travel_date": "2014-06", "title": "Stay at another hotel", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r213122378-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review213122378", "text": "The hotel is old, the carpet was disgusting, made a path about the hotel with towels because it was so tainted with grease and dirt. Wifi didnt work they way it should have and there was a shady bunch of people, living there i assumed, up all night, pacing the floors above, which made the floor creak constantly, switched rooms and yet more noises, this time i dont know where they were coming from. Just stuff in the walls i guess, in the ceiling, old pipes or something. Finally just slept in my truck until i went to work the next day and booked at a new hotel. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2014-07-01T08:56:04-0400", "location_id": "94416", "id": "213122378", "user": {"username": "Yeadonc91", "user_location": {"name": "Warren, mi", "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2014-03", "title": "Very Comfy home away from home! ", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r202570243-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review202570243", "text": "Although all the staff we encountered were friendly and helpful, Stella was Exceptional from the phone call booking the resv. To the departure date. It was a pleasure. I have traveled for ten yrs and very few are as welcoming as her. I wish there was a Stella in every hotel I stayed. Room was clean and I loved the set up. It was a great 10 day stay! Thank you!", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [], "owner_response": {"lang": "en", "author": "Manager_11525, Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Thank you for posting a glowing review of your stay.  I’m happy to hear that you enjoyed our overall accommodations and our friendly staff, especially Stella.  Thank you for choosing Extended Stay Hotels.  We look forward to welcoming you back in the future!", "title": "Owner Response", "published_date": "2014-04-28T09:33:39-0400", "id": "203168256"}, "trip_type": "Business", "published_date": "2014-04-24T08:13:24-0400", "location_id": "94416", "id": "202570243", "user": {"username": null, "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 4, "travel_date": "2014-01", "title": "Clean, Quite and Comfortable", "url": "https://www.tripadvisor.com/ShowUserReviews-g42794-d94416-r201077231-m11068-Extended_Stay_America_Detroit_Warren-Warren_Michigan.html#review201077231", "text": "The staff was very pleasant and accommodating from the front desk staff all the way up to the manager all made my stay very enjoyable. I recommend this location to anybody needing a stay in the area. Clean, Quite and Comfortable and had a oven great for those like me that don't fry their food.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": {"lang": "en", "author": "Manager_11525, Manager at Extended Stay America - Detroit - Warren, responded to this review", "text": "Chad – The staff and I appreciate your kind remarks.  We’re thrilled to hear that you enjoyed your time at our hotel and the service our staff provided.  Thank you for choosing Extended Stay Hotels.  We look forward to hosting you again in the future!", "title": "Owner Response", "published_date": "2014-04-18T06:42:24-0400", "id": "201672933"}, "trip_type": "Business", "published_date": "2014-04-14T09:37:36-0400", "location_id": "94416", "id": "201077231", "user": {"username": "Chad S", "user_location": {"name": "Cleveland, Ohio", "id": "50207"}}}]}