{"paging": {"total_results": "12", "skipped": "0", "previous": null, "results": "12", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2015-11", "title": "Not good", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r327866808-m11068-Walnut_Inn_Suites-West_Covina_California.html#review327866808", "text": "Two things you have to bring to this hotel (besides money). No clothes hangers!!! So bring your own. When asked for it, Hotel: \"we don't have any.\" \nOnly 1 coffee pot in the lobby. If you want hot water or hot tea, bring your own electric kittle.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": null, "published_date": "2015-11-19T09:56:02-0500", "location_id": "1772484", "id": "327866808", "user": {"username": "AKYC09", "user_location": {"name": "Waukegan, Illinois", "id": "36854"}}}, {"lang": "en", "rating": 1, "travel_date": "2015-07", "title": "Soiled Linens", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r293471202-m11068-Walnut_Inn_Suites-West_Covina_California.html#review293471202", "text": "Horrible, horrible experience in July 2015.  Aesthetically, the establishment, rooms and decor are dated but not a big deal.  The furniture is simple but functional.  The mini fridge was nice.  The bathroom and shower was acceptable.  However, it was disgusting to find hair of various lengths and colors between the top and bottom sheets.  In addition, in the second room for our teenage daughters, the bed not only contained hair but disgustingly stained sheets.  That being said, they obviously do not change the linens after each guest's stay.  We called management and asked for housekeeping to change the sheets, but instead we had to walk to the office and were handed  more sheets and pillow cases.  We placed the sheets over the bed and slept on top, without blankets, with the lights on and one eye open.  No apology or explanations offered by management.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2015-07-28T13:55:16-0400", "location_id": "1772484", "id": "293471202", "user": {"username": "JR B", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2014-08", "title": "Stay away from the walnut", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r220160854-m11068-Walnut_Inn_Suites-West_Covina_California.html#review220160854", "text": "I don't know how other people gave this hotel more than 1 star. But I'll start by telling you about my experience. The only reason I stayed at the walnut was because I went to a music festival in the area and booked a hotel last minute so all of the others in the area were sold out already (and now I know why this one wasn't). The employees knew about the festival too, and maybe that was the reason they were so unpleasant and condescending when we checked in. I was graciously greeted by a \"what?\" from the lady at the front desk, which was just about the only word I could understand that she spoke because she had a very thick accent and was sitting behind a glass wall and didn't make any effort to stand up or get closer to the speaking hole. So after I finally got the room key (which looked about 7 years old and had an old brown sticker that used to be white with our room number on it), I walked to the room, with a glimmer of hope for the inside because the outside of the hotel looked somewhat newly remodeled so I was hoping the same for the room. WRONG. All of the furniture, carpet, bedspread, and pillows in the room looked like they had been there since the 70s and they all looked like they hadn't been cleaned since the 90s. There wasn't a single second in that room that I wasn't wearing sandals or socks. There was a hole in the wall and the nightstand had a huge chunk of wood broken off of it. I didn't even move the comforter on the bed a single inch because I was scared to see or touch the sheets. So I slept on top of the bed with one of my own towels as a blanket, and thank god I brought my own pillow. I even felt that the food I was eating was getting dirty by touching the air in that room and it made me lose my appetite. The bathroom was the cleanest part of the room because it looked ALMOST up to date and like maybe it had gotten cleaned recently. Still didn't take my shoes off tho. I'm so thankful I only booked this hotel one night because if I hadn't, I would have rather slept in my car after the second night of the festival. Do not stay at this hotel unless you enjoy still feeling dirty AFTER you shower. This place made me want to never even eat a walnut again in my life.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2014-08-06T20:12:28-0400", "location_id": "1772484", "id": "220160854", "user": {"username": "Yestojess", "user_location": {"name": "Las vegas", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2014-07", "title": "Don't make a reservation because they won't honor it.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r217336209-m11068-Walnut_Inn_Suites-West_Covina_California.html#review217336209", "text": "Go figure, I booked a room through Expedia for 4 people. Got there at 9 pm and there were two kids in the clerk's  booth. They called for Mom and a haggard young woman appeared from the back and asked if I had a reservation. Long story short, she fumbled about a few minutes shrugged and then had one of the kids call the manager or owner! They gave my room away and said they had notified Expedia of non-availability but I showed her my cell phone app -- I get instant alerts about anything... busted! Plus, she wouldn't help me get a room elsewhere. It doesn't make sense because I have to pay if I don't show and they make out because they don't need to clean the room. These idiots need to get into another line of business because they don't know what \"hospitality\". means.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2014-07-24T16:29:59-0400", "location_id": "1772484", "id": "217336209", "user": {"username": "linefeeder", "user_location": {"name": "New Jersey", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2014-07", "title": "piss poor customer service-lost out reservations", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r214180801-m11068-Walnut_Inn_Suites-West_Covina_California.html#review214180801", "text": "I made reservations for two rooms on June 30th for the 4th of July weekend. when we arrived to check in we were told we didn't have reservations as they had no record of us. the female clerk tried to call the off duty male clerk who had taken my reservation but after numerous attempts( I counted 5 times and I do not know how many more times she tried when I went to the car to inform my family of situation and to get my phone). I called the agency though whom discounted service I was using to inform them of problem. of course they couldn't anything about it since I called the motel directly but they(my card services) did get me a room elsewhere and their customer se4rvice was good(Amy). as for this place I was treated poorly by the middle-eastern/ Indian woman clerk. the fact that the 1st 2 individuals I had dealing with were her small children(10-12/8-9)who were playing a video game on the front desk computer and obviously weren't taught common sense or curiosity for I had to call for help. after going through all this I was then informed I was stupid since I didn't get a conformation number from the \"clerk\" when I made the reservation(I have 2 doctorates, 2 master, 1 bachelor) but the male who took my reservation hung up before I could get a confirmation and I did fail by not calling back and try to talk to this individual(bad accent) but I didn't want to go through this lack of communication with this individual again, would i recommend this location. NO!!!! just because of the poor customer serve, oh by the way, we found a room(suite) next door for almost $100 less,", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Family", "published_date": "2014-07-07T14:18:13-0400", "location_id": "1772484", "id": "214180801", "user": {"username": "Noel E", "user_location": {"name": "Yuma, Arizona", "id": "31418"}}}, {"lang": "en", "rating": 1, "travel_date": "2014-02", "title": "Terrible customer service!!!!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r193327547-m11068-Walnut_Inn_Suites-West_Covina_California.html#review193327547", "text": "I went there to get a 3 hour rest before my work day started just three hours! I got there at 3am and the guy at the front desk spoke little English he charges me $66 which I agrees to pay and because I am a female he was suspicious that I had other guests so he kept pointing at the camera and told me he was gonna kick me out if I has guest before I even got a receipt back. He strategically gave me a room right where the lobby is so he can spy on me. I went in the room and the pillows were on the floor the sheets were messy it looked as if someone was there but room service didn't clean that room I didn't care I was just so sleepy so I walked in. I called my friend to bring me some food so he dropped me off some food and we stood outside of the room talked for 10 minutes and the guy comes out and tells me to leave because I signed for one person only he pointed me to where I put one person and he said get off my property... I asked for a refund and he said no because I occupied the room for an hour I refused to leave until he gave me my refund he said he was going to call the police I told him don't worry about it I'll call them he saw that I was not gonna budge so he gave me back my money and told me to never come back again", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2014-02-07T01:51:36-0500", "location_id": "1772484", "id": "193327547", "user": {"username": "Wormie77", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2013-08", "title": "worst experience ever had!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r178999423-m11068-Walnut_Inn_Suites-West_Covina_California.html#review178999423", "text": "The man at the desk appeared drunk or on some drugs. Couldn't understand English it seemed like. Gave me a smoking room when I asked for non smoking. Treated me like I was an idiot when I asked for a non smoking room. Argued with me that I tinkled the sheets from placing my luggage on the bed. Acoused me of using the shower before asking for a non smoking room.  Finally agreed to a refund but charged me twice, the next morning he didn't apologize or even say thank you. Just gave a blank glare. \n\nWhen I called to file a complaint his wife was not any nicer. She told me there were cameras all over the hotel and said her husband did no wrong. She refused to refund any of my money or apologize for my experience. So I was charged twice for they're mistake.\n\nRoom was nice but hospitality is everything. If you read this review don't stay there!", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Couples", "published_date": "2013-09-28T16:53:56-0400", "location_id": "1772484", "id": "178999423", "user": {"username": "Justin P", "user_location": {"name": "Pasadena, California, United States", "id": null}}}, {"lang": "en", "rating": 1, "travel_date": "2013-06", "title": "Terrible Customer Service!", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r162684683-m11068-Walnut_Inn_Suites-West_Covina_California.html#review162684683", "text": "This place has THE WORST customer service I have ever encountered in my life.  I noticed something off when I noticed that the front desk has a protective shield like a bank that the front desk guy was behind.  He was grumpy and didn't go out of his way to make me feel welcome.  He perked up when I paid cash for a 3 night stay.\n\nAfter receiving the room key, I was walking out and noticed that someone had driven up and honked, seemed to be waiting for someone.  Then I proceeded to my room.  When I came to pass the waiting car, the female driver (she doesn't deserve to be called a lady) accused, \"You're in my parking spot.  You need to move.\"\n\n\"Excuse me?\" astonished, I said, \"I was here first and the parking spot is unmarked.\"  The space next to my car was vacant and lots more vacant spaces in the parking lot.\n\n\"That first spot is for managers and you need to move,\" the female demanded.\n\n\"Oh, so, you're a manager?\" I asked.  \"The space is unmarked and I'm not going to be there long, I just paid for my stay for 3 days.  I'm just going to unload and be on my way.\"\n\n\"You need to move,\" the female \"manager\" rudely demanded again.\n\nNow I was truly offended. \"I just paid for 3 nights and you want me to move my car?!  Fine, you can have 'your' spot and I'll take my business elsewhere!!!!!\"\n\n\"Fine!\" the female screeched.\n\nSo I went back to the lobby.  Explained to the guy what just happened and demanded my money back.  Thankfully, he gave it back.  The only thing he said was, \"Yeah, that spot is for managers.\"  He didn't have a problem with it when I first walked in.  Think he might be the henpecked husband--no wonder why he's seems depressed and grumpy!  Left that hellish place and will never go back again.  The worst service I have ever experienced!  So glad I will never again have to deal with that female who is one of the rudest persons I've ever met!  And, I'm being nice!\n\nI went next door to Wayside Motel.  Now that's a business that knows how to treat customers!  Much cheaper with a decent room too!", "helpful_votes": "12", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2013-06-01T20:44:22-0400", "location_id": "1772484", "id": "162684683", "user": {"username": "BeingTrue", "user_location": {"name": "Los Angeles, California", "id": "32655"}}}, {"lang": "en", "rating": 3, "travel_date": "2011-11", "title": "Nice and clean rooms, reasonable rates, but not for children.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r120662933-m11068-Walnut_Inn_Suites-West_Covina_California.html#review120662933", "text": "I booked a room via booking.com and got a great rate on a good size room, which was clean and had a small kitchenette with a flat top stove, a sink and a small fridge. The TV was an old CRT 25 inch model, but I was here on business and not to watch TV so that is fine by me. \n\nHowever, I cannot recommend this hotel for anyone with children or anyone who is averse to porn being readily accessible by just channel surfing. \n\nNot the pay-per-view porn that is in pretty much every hotel chain. I'm talking about channel 55 which is hardcore, straight-up porn. Since there is no channel guide on the TV or in the room, just going through the channels will ensure no one will miss it. There is no warning, no mention of it at all, and no way to block or lock it out. \n\nBarring the free (and all too accessible) pornography, this is a nice little place.", "helpful_votes": "3", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s3.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}], "owner_response": null, "trip_type": "Business", "published_date": "2011-11-16T04:42:56-0500", "location_id": "1772484", "id": "120662933", "user": {"username": "DouglasBW", "user_location": {"name": "Chandler, Arizona", "id": null}}}, {"lang": "en", "rating": 2, "travel_date": "2011-09", "title": "Unfriendly staff, did not honor price line price fees", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r117600475-m11068-Walnut_Inn_Suites-West_Covina_California.html#review117600475", "text": "Very unfriendly staff, almost as if my husband and I were an inconvenience to them. Priceline confirmation (booked 3 weeks prior to stay) quoted us $240 for two rooms, two nights. The front desk staff said they changed their fees. Very shady. They use a small credit card machine, no receipts. \n\nHotel sheets had a semen stain. Told staff, he did not speak English so we had a definite language barrier. Said he could give us a sheet to change our own bed but would not call maid services. Disgusting.\n\nWould not stay again and DO NOT recommend. Stay away and search for another motel/hotel with similar rates. Not worth the hassle.", "helpful_votes": "2", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "3", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss3.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2011-09-02T13:18:37-0400", "location_id": "1772484", "id": "117600475", "user": {"username": "Bwalker0304", "user_location": {"name": null, "id": null}}}, {"lang": "en", "rating": 5, "travel_date": "2011-08", "title": "Affordable and great standard.", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r116893651-m11068-Walnut_Inn_Suites-West_Covina_California.html#review116893651", "text": "Hotel is new or renewed. Very clean and nice. Standard is pretty high. King size bed, sofa, plazma tv, clean bathroom. Neighberhood is nice. ", "helpful_votes": "1", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2011-08-18T05:58:47-0400", "location_id": "1772484", "id": "116893651", "user": {"username": "dnkroz", "user_location": {"name": null, "id": null}}}, {"lang": "it", "rating": 2, "travel_date": "2012-06", "title": "Sporco", "url": "https://www.tripadvisor.com/ShowUserReviews-g33250-d1772484-r161585185-m11068-Walnut_Inn_Suites-West_Covina_California.html#review161585185", "text": "Motel di scarso livello, camere sporche di piccole dimensioni (per gli USA) e personale non molto disponibile.\nLa posizione è molto comoda per chi è in transito.\nNon lo consiglierei nonostante il prezzo contenuto. C'è di meglio.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s2.0-11068-5.png", "subratings": [{"localized_name": "Rooms", "name": "rate_room", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Sleep Quality", "name": "rate_sleep", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}, {"localized_name": "Location", "name": "rate_location", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Cleanliness", "name": "rate_cleanliness", "value": "1", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss1.0.gif"}, {"localized_name": "Service", "name": "rate_service", "value": "2", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss2.0.gif"}], "owner_response": null, "trip_type": null, "published_date": "2013-05-23T04:42:27-0400", "location_id": "1772484", "id": "161585185", "user": {"username": "AleLuga", "user_location": {"name": "Lugano, Switzerland", "id": "188095"}}}]}