{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 1, "travel_date": "2016-09", "title": "Unless you like throwing up...", "url": "https://www.tripadvisor.com/ShowUserReviews-g33260-d10672567-r421509479-m11068-SoCal_Wings-Westminster_California.html#review421509479", "text": "The wings themselves are terrible, their tasty sauces don't cover that up. Full of fat and grease. Ordered 20 wings, after the 3rd wing I couldn't stomach them anymore. My husband (much less discerning than myself) ate about 10. He woke up in the middle of the night violently sick. It Is obvious they use the cheapest, lowest quality wings they can find. Will never go here again and I'll be warning everybody I know.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s1.0-11068-5.png", "subratings": [], "owner_response": null, "trip_type": "Couples", "published_date": "2016-09-23T08:58:01-0400", "location_id": "10672567", "id": "421509479", "user": {"username": "scobooty", "user_location": {"name": "Philadelphia, Pennsylvania", "id": "60795"}}}, {"lang": "en", "rating": 4, "travel_date": "2016-06", "title": "Tiny place, good chicken", "url": "https://www.tripadvisor.com/ShowUserReviews-g33260-d10672567-r398462084-m11068-SoCal_Wings-Westminster_California.html#review398462084", "text": "This Mom n Pop chicken and boba cafe is located off Beach and Hazard, with the door facing the Hazard side of the street.  Ironically, they're located next door to Popeyes, but it doesn't seem to affect their business too much, as the stream of customers were constant while we were eating there.\n\nThe place is small, holding about 8 tables, so not ideal for a large group.  Most of the customers were phone orders, getting the food to go.\n\nThere were 3 of us, and we decided to get the Family 30 piece of wings with 2 sides: zucchini sticks and Asian slaw.  At the last minute I decided to toss in an order of their chicken nuggets, which came with a drink and a side, which we decided on the potato wedges (that ended up being our favorite side).\n\nFor the sauces, we had 10 of the wings in the Aloha teriyaki sauce, 10 in the Lemon Pepper, and we split the last 10 into 5 Firecracker, and 5 original.  We were offered 3 dipping sauces, which we chose ranch, blue cheese, and the sweet chili.  \n\nQuite honestly, the Aloha and Lemon Pepper didn't need any dipping sauces. They had flavor on their own. The Aloha was sweet, as the Lemon Pepper was savory and quite lemony, so pucker up!  Between the 2, I liked the Aloha more, and probably because of the sweet sauce.\n\nThe original and Firecracker were quite the opposite end as well, with original being plain seasoning (although there was a slight Louisiana kick to it) to the in your mouth spicy Firecracker,which the ranch and blue cheese helped balance the heat.\n\nThe sides were more than generous, as we barely finished the slaw and zucchini. We took home the wedges, and we even had 6 wings leftover... practically another meal.\n\nMost of the wings were decent size, and not heavily covered in batter.  I do wish they offered the option of no batter, or naked, but the girl said they're pre battered.  It could explain why it only took 8 minutes to get our order.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "4", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss4.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-28T08:46:58-0400", "location_id": "10672567", "id": "398462084", "user": {"username": "callmemochelle", "user_location": {"name": "Anaheim, CA", "id": null}}}]}