{"paging": {"total_results": "2", "skipped": "0", "previous": null, "results": "2", "next": null}, "data": [{"lang": "en", "rating": 4, "travel_date": "2015-10", "title": "An Evil Dead Visit", "url": "https://www.tripadvisor.com/ShowUserReviews-g39143-d7785673-r318440848-m11068-Roxy_s_Downtown-Wichita_Kansas.html#review318440848", "text": "We had tickets to Evil Dead the Musical on 10-10-15. Pretty disappointed at the lack of blood splattered in the show, since that's what it's known for, but I imagine that wouldn't be a big issue for any other show. As for the actual venue, it's quite nice. The chairs that we set in weren't the most comfortable for the long haul, but not bad. The bathroom is quite a hike, as is the entrance, so this wouldn't be the best place for someone with physical limitations. The building has really been renovated well and it's a great place for a small production. It's a couple hours drive for me to get to the Roxy, but I'd go back for the right production. ", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s4.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-10-13T19:22:34-0400", "location_id": "7785673", "id": "318440848", "user": {"username": "B K", "user_location": {"name": "Kansas", "id": "28937"}}}, {"lang": "en", "rating": 5, "travel_date": "2015-08", "title": "Always a fun time!", "url": "https://www.tripadvisor.com/ShowUserReviews-g39143-d7785673-r299996840-m11068-Roxy_s_Downtown-Wichita_Kansas.html#review299996840", "text": "We attended the current production of Pageant. The beauty pageant premise of the show is hilarious. The contestants are played by men who very ably portray female contestants in a beauty pageant. The actors were all outstanding and very talented. Roxy's has been renovated from the former Cabaret Old Town theater. New furnishings include carpet throughout, seating, wall sconces and updated bathrooms. The theater needed a face-lift and the new owners have done a great job with it. The reservation process - by phone - is very efficient and it was nice to pay for the tickets over the phone and not wait in line at the theater. Ice cream dessert drinks are one of their signature items and not to be missed. Roxy's is a gem for Wichita and the local productions are always outstanding.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "owner_response": null, "trip_type": null, "published_date": "2015-08-16T12:39:43-0400", "location_id": "7785673", "id": "299996840", "user": {"username": "JohnTerry13", "user_location": {"name": "Wichita, Kansas", "id": null}}}]}