{"paging": {"total_results": "1", "skipped": "0", "previous": null, "results": "1", "next": null}, "data": [{"lang": "en", "rating": 5, "travel_date": "2016-07", "title": "From the Ashes Rises Culinary Perfection in the Heart of Downtown", "url": "https://www.tripadvisor.com/ShowUserReviews-g41952-d10517797-r389725320-m11068-Talyta_s_Cafe-Worcester_Massachusetts.html#review389725320", "text": "The location now occupied by Talyta's Cafe was for years \"Worcester Subway\", directly across City Hall on Front St. For the last couple of years, this restaurant continues to cook up amazingly fresh, homemade, authentic Central and South American dishes. So far, I've sampled their breakfast sandwich, pupusas, burritos, tacos, chimichangas (my personal favorite) and as of yesterday's lunch, a delicious Brazilian soda I've never seen before. The staff could not be friendlier or more helpful and ingredients used to make their own salsa, guacamole and other garnishes, along with the main dishes themselves, continue to astound me with their freshness. Whenever I'm in the area during lunchtime, Talyta's is a must. There is an $8 minimum to use debit/credit cards and the dishes are extremely affordable given the portion sizes. Overall, so glad this wonderful and authentic restaurant downtown continues to provide high-quality, homemade cuisine at such low prices and I hope they continue to prosper for years. As a size note, parking in downtown Worcester is a challenge and while there is metered parking along Front St. and surrounding side streets, I would recommend parking at the city lot behind the public library and simply walking across the Worcester Common park.", "helpful_votes": "0", "rating_image_url": "http://www.tripadvisor.com/img/cdsi/img2/ratings/traveler/s5.0-11068-5.png", "subratings": [{"localized_name": "Service", "name": "rate_service", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Value", "name": "rate_value", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}, {"localized_name": "Food", "name": "rate_food", "value": "5", "rating_image_url": "https://static.tacdn.com/img2/ratings/traveler/ss5.0.gif"}], "owner_response": null, "trip_type": "Friends getaway", "published_date": "2016-07-06T06:19:03-0400", "location_id": "10517797", "id": "389725320", "user": {"username": "meduza1350", "user_location": {"name": "Massachusetts", "id": "28942"}}}]}